[
{"id":"1","title":"The Olumo Rock","content":"The Olumo Rock is located at Ikija Road, Abeokuta, Ogun State., Ogun.\r\n\r\nDerived from the Yoruba word for 'under the rock', this spot has become the word association - at least where tourism is concerned - with the city of Abeokuta, Ogun State. It is one of the most popular attractions in Nigeria. Behind the sheds of the popular itokun market are structures which serve as the habitats of craftsmen and traders. The locals at the olumo rock are very welcoming and make the whole visit all the more exciting by taking tourists through the dyeing process amongst other things.  \r\nHistory of The Olumo Rock\r\nDuring the intertribal wars of the 19th century, the egba people found safety in the olumo rock. The substructure was given a new look in 2006 and some of the things that accompanied the new look of the rock include; a new restaurant, museum, a water fountain, and the ancient Itoku market where craftsmen and traders go about the daily market activities.\r\nSafety\r\nThis is a very safe location.\r\nThings to Do and What to Bring\r\nThings to do at the olumo rock include climbing the mountain on man-made stairs carved into the mountain and rocks. Guests are advised to go along with cameras to take beautiful photos that will be added to their photo albums and bring back magnificent memories. Also, a water bottle is needed during the climb up the mountain.\r\nBest Features\r\nThe Olumo Rock has folklore of the egba people and guests would be taken through it by a guide who is available on site. The rock itself is a sight to behold and the Ogun river is also a must-see.\r\nBest Time to Visit The Olumo Rock\r\nThe site is always filled with tourists from around the world during the festive periods as a lot of people look forward to being captivated by the folklore of the egba people.\r\nMost Common Visitors\r\nThe most common visitors are tourists from different parts of the world, also, archeologists are seen here.\r\nWeather at The Olumo Rock\r\nThe Olumo Rock is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"2","title":"Birikisu Sungbo Shrine  (Sungbo Shrine)","content":"Birikisu Sungbo Shrine is located at Oke Eri near Ijebu Ode, off the Ijebu-Ode\/Ibadan Road., Ogun.\r\nIn the bible, she is known as the Queen of Sheba. In Nigeria - and specifically in Ogun state- she is called Birikisu Sungbo, and there is a shrine dedicated to her. It is believed that she will answer all your heart's desires if you ask nicely. Worth a try.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"3","title":"June 12 Cultural Center  (Cultural Center)","content":"June 12 Cultural Center is located at Cultural Center, Kuto, Abeokuta, Ogun.\r\nBuilt to commemorate the June 12 annulled elections of 1993, this rehabilitated cultural center houses a swimming pool, convention center, an amusement park, and a cinemas\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"4","title":"Living Faith Tabernacle Worldwide, Otta  (Winners Chapel)","content":"Living Faith Tabernacle Worldwide, Otta is located at Km. 10, Idiroko Road, Ota, Ogun.\r\nReputed as the world's largest church in capacity terms, this is an architectural masterpiece located in Canaanland where people from far and wide come to worship under a holistic atmosphere.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Living Faith Tabernacle Worldwide, Otta, here are some helpful things to take along with you:\r\n\r\nYour Bible\r\n\r\nBest Features\r\nThis is a vibrant pentecostal place of worship where the ministrations speak to your soul and refresh your spirituality.\r\n\r\nWriter's Review\r\nIt is a place where man meets his maker in fellowship.\r\n\r\nMost common visitors\r\nChristians are the major groups of people who can be seen here.","contentgroup":"Religion","travel":"0","favourite":"0"},
{"id":"5","title":"Lisabi Sacred Forest","content":"Lisabi Sacred Forest is located in, Ogun.\r\nThis was established. It is notable as the burial place of the great warrior Lisabi the hero of the Egba people.\r\n\r\nThe Lisabi festival is held here yearly.\r\nLong long ago in distant Egba land where evil reigned supreme, there was a warrior named Lisabi who rose up to conquer this evil. Upon his death, he was buried in a forest in Ogun and today is known as Lisabi forest and is a popular place where people come from far and wide to visit.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Lisabi Sacred Forest, here are some helpful things to take along with you:\r\n\r\nMosquito repellant.\r\n\r\nLight clothing.\r\n\r\nHiking gear.\r\n\r\nThings to do while at Lisabi Sacred Forest\r\nThese are the following things you can do while you're here:\r\n\r\nParticipate in the Lisabi festival.\r\n\r\nBest Features\r\nIt is a historical site.\r\n\r\nMost common visitors\r\nHistorians, Fun lovers, Religious leaders.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"6","title":"National Museum Abeokuta","content":"National Museum Abeokuta is located in, Ogun.\r\nThis was built. It is notable as a historical site for relics and records of the Egba people.\r\nWelcome to the Abeokuta national museum which boasts of relics and records from the past that celebrate the rich history of Egbaland.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the National Museum Abeokuta, here are some helpful things to take along with you:\r\n\r\nCamera or a good camera phone.\r\n\r\nThings to do while at National Museum Abeokuta\r\nThese are the following things you can do while you're here:\r\n\r\nVisit the different galleries.\r\n\r\nLearn about the history of Egba land.\r\n\r\nBest Features\r\nIt is a place that celebrates our rich Nigerian, Yoruba history\r\n\r\nWriter's Review\r\nTo go learn about the rich history of our land.\r\n\r\nMost common visitors\r\nCurators, Historians, Tourists are visitors to this place.\r\n\r\nThe carvings are so African!- Lizzy, a European curator.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"7","title":"Centenary Hall","content":"Centenary Hall is located at Ake, Ogun.\r\nHistory of Centenary Hall\r\nThis was built in 1930. It is notable as the symbol of the Egba people's settlement in Abeokuta.\r\n\r\nThe building was commissioned along with the 10th Alake’s Coronation Anniversary.\r\nThe centenary hall was built as a testament to the resilience and prosperity of the Egba people. It marks 100 years of settlement of the Egba people in Abeokuta.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Centenary Hall, here are some helpful things to take along with you:\r\n\r\nA digital camera with solid batteries.\r\n\r\nThings to do while at Centenary Hall\r\nThese are the following things you can do while you're here:\r\n\r\nAppreciate the superior architecture.\r\n\r\nTake pictures of the building.\r\n\r\nDocument about it.\r\n\r\nBest Features\r\nIt celebrates the rich Egba history.\r\n\r\nWriter's Review\r\nTo learn and document the Egba history.\r\n\r\nMost common visitors\r\nCurators, Historians, Tourists.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"8","title":"Osuuru water spring","content":"Osuuru water spring is located in, Ogun.\r\nThis was discovered. It is notable as a spring with healing prowess.\r\nThe Osuuru spring is said to have no apparent source and flows even in dry seasons. Adventurous visitors are welcome to find the source. That is, if they can.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Osuuru water spring, here are some helpful things to take along with you:\r\n\r\nSwimming gear.\r\n\r\nHiking gear.\r\n\r\nMosquito repellant.\r\n\r\nThings to do while at Osuuru water spring\r\nThese are the following things you can do while you're here:\r\n\r\nDrink the spring water.\r\n\r\nTake a dip in the spring pool.\r\n\r\nGet a landscape picture.\r\n\r\nBest Features\r\nIt is a beautiful tourist spot.\r\n\r\nWriter's Review\r\nTo go and experience nature like never before.\r\n\r\nMost common visitors\r\nTourists, Adventurers are the type of people that come here.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"9","title":"Oyan Dam","content":"Oyan Dam is located at Abeokuta North, Ogun.\r\nThis was built in 29th march, 1983. It is notable as the primary source of raw water for Abeokuta and Lagos cities for various daily essentials.\r\n\r\nThe dam crosses the Oyan River, a tributary of the Ogun River.\r\n\r\nDuring construction, 22 villages were submerged, with the displaced people moved to three settlement camps.\r\nThe Oyan dam was built primarily to supply raw water for both Lagos city and Abeokuta. Recently, its potential for irrigation and hydroelectric power supply is under investigation.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Oyan Dam, here are some helpful things to take along with you:\r\n\r\nCamera with a change of batteries.\r\n\r\nThings to do while at Oyan Dam\r\nThese are the following things you can do while you're here:\r\n\r\nTake a picture of the dam.\r\n\r\nBest Features\r\nIt is an important structure for the people of Abeokuta and Lagos.\r\n\r\nMost common visitors\r\nEngineers, Government officials, Tourists.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"10","title":"Omo Forest Reserve","content":"Omo Forest Reserve is located in, Ogun.\r\nThis was established. It is notable as a conservation and relaxation spot.\r\n\r\nElephants are a common sight here if you wait long enough, you are sure to see some.\r\nhe Omo forest is home to over 200 species of trees, 125 species of birds and the endangered white-throated guenon monkey. This makes it not just a place of immense beauty, but also of conservation importance.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Omo Forest Reserve, here are some helpful things to take along with you:\r\n\r\nHiking gear.\r\n\r\nMosquito repellant.\r\n\r\nShorts.\r\n\r\nThings to do while at Omo Forest Reserve\r\nThese are the following things you can do while you're here:\r\n\r\nTake selfies with the wildlife.\r\n\r\nI appreciate wildlife.\r\n\r\nTake a walk with nature.\r\n\r\nBest Features\r\nIt is a place to either take wildlife pictures, appreciate wildlife or simply meditate.\r\n\r\nWriter's Review\r\nTo go and appreciate mother nature in her splendor.\r\n\r\nMost common visitors\r\nTourists, Nature enthusiasts are the most common people here.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"11","title":"Obasanjo Farm  (Ota farm)","content":"Obasanjo Farm is located at KM 5, Idiroko Road, Ota, Ogun, Ogun.\r\nThe Ota farm owned by the former president Olusegun Obasanjo is one of the largest farms in Nigeria boasting of a variety of poultry, livestock and food products.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\ndo not wander off unsupervised.\r\n\r\nWhat To Bring\r\nBefore heading to Obasanjo Farm, here are some helpful things to take along with you:\r\n\r\nCash.\r\n\r\nThings to do while at Obasanjo Farm\r\nThese are the following things you can do while you're here:\r\n\r\nBuy Egg.\r\n\r\nTake a tour of the farm.\r\n\r\nBest Features\r\nIt is a place to get various farm produce fresh.\r\n\r\nWriter's Review\r\nEasy, to go get fresh farm products!\r\n\r\nMost common visitors\r\nFarmers, Wholesalers, Caterers are the type of people you can find here.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"12","title":"St. Peter Cathedral","content":"St. Peter Cathedral is located at Ake Road, Ake, Ogun.\r\nThis was built in 1898. It is notable as the oldest house of worship in Nigeria.\r\n\r\nOne of the most known pastors of the church include the Reverend Josiah J. Ransome Kuti (the grandfather of Fela Anikulapo Kuti, the inventor of Afrobeat),\r\nLooking to attend a service in Abeokuta? Where better than the St. Peter cathedral, the first and oldest church in Ake, Abeokuta, and Nigeria.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to St. Peter Cathedral, here are some helpful things to take along with you:\r\n\r\nRosary.\r\n\r\nHymnbook.\r\n\r\nThings to do while at St. Peter Cathedral\r\nThese are the following things you can do while you're here:\r\n\r\nSay a prayer.\r\n\r\nAdmire the architecture.\r\n\r\nBest Features\r\nIt is a historical site.\r\n\r\nWriter's Review\r\nTo go say a prayer or attend a service.\r\n\r\nMost common visitors\r\nPastors, Architects, Religious faithful.","contentgroup":"Religion","travel":"0","favourite":"0"},
{"id":"13","title":"Sungbo Eredo","content":"Sungbo Eredo is located at Oke Eri near Ijebu Ode, off the Ijebu-Ode\/Ibadan Road., Ogun.\r\nThis was built in the 10th century as a monument to Sungbo and as a spiritual fortification round an ancient Kingdom. It is notable as the largest known ancient man-made structure in sub-Saharan Africa\r\n\r\nThis site was added to the UNESCO World Heritage Tentative List on 1 November 1995 in the Cultural category\r\n\r\nIn September 1999, a British archaeologist, Dr. Patrick Darling of Bournemouth University publicized his findings which popularized the ancient monument\r\nEssentially, it is a moat with an earth wall alongside it. A 100-mile-long wall forming a rough circle enclosing roughly 400 square miles, whose construction began a millennium ago, this is one of the largest monuments in sub-Saharan Africa\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nensure you go along with a local guide\r\n\r\nand be prepared for insects and other animals as it is a rainforest\r\n\r\nWhat To Bring\r\nBefore heading to Sungbo Eredo, here are some helpful things to take along with you:\r\n\r\nHiking boots\r\n\r\nA map\r\n\r\nCamera\r\n\r\nThings to do while at Sungbo Eredo\r\nThese are the following things you can do while you're here:\r\n\r\nVisit the locals and learn their history from them\r\n\r\nTake a hike in the rain-forest and view the monument\r\n\r\nBest Features\r\nThis outstanding monument is a rampart or system of walls and ditches. Its vertical sided ditches of hardened laterite (natural soil mixture of clay and iron-oxides) show how the ditch profiles were originally dug. Together with the bank of spoil heaped upon the inner side, the combined height can be as much as 20 meters. Trees above this gigantic ditch help protect its sides from the forces of nature. The grave of Bilikisu is located in Oke-Eiri inside Sungbo's Eredo. It is an important site of pilgrimage among the locals.\r\n\r\nMost common visitors\r\nIt is frequented by archaeologists, adventurers, traditional worshipers, and adventurers.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"14","title":"MKO Abiola Stadium","content":"MKO Abiola Stadium is located at IBB Boulevard, Kuto, Abeokuta, Ogun.\r\nThis stadium is named after the philanthropist and politician Chief MKO Abiola\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nThings to do while at MKO Abiola Stadium\r\nThese are the following things you can do while you're here:\r\n\r\nHang out at the local bars and enjoy the view of the stadium\r\n\r\nWatch sporting activities and shows\r\n\r\nBest Features\r\nThis is a stadium in Abeokuta with a 35,000 seating capacity. Used for sporting activities and social events, it is a notable landmark in Abeokuta South.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"15","title":"Olusegun Obasanjo Presidential Library","content":"Olusegun Obasanjo Presidential Library is located at Presidential Boulevard, Abeokuta, Ogun.\r\nThis was established in 2005.\r\nHoused in the Obasanjo Library Complex, the library, when fully completed, will be a center of academic research and conference in Ogun State.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nsome parts of the complex is still undergoing construction so watch your step\r\n\r\nWhat To Bring\r\nBefore heading to Olusegun Obasanjo Presidential Library, here are some helpful things to take along with you:\r\n\r\nBusiness materials\r\n\r\nWriting materials\r\n\r\nCamera to capture the sights\r\n\r\nBest Features\r\nRemodeled after the United States presidential library system, the Olusegun Obasanjo Presidential Library is primarily a historic, touristic, recreational and academic center regarded as a national archive and place for the preservation of genuine presidential papers, documents, materials, and other historic items associated with the office of President Olusegun Obasanjo.\r\n\r\nWriter's Review\r\nAside from the museum and other archival amenities, the library will also comprise an auditorium for seminars and workshops that can accommodate up to 1,500 people. Hoped to be fully completed by 2016, it will be the first presidential library in Africa.","contentgroup":"Library","travel":"0","favourite":"0"},
{"id":"16","title":"Eye Foundation Hospital, Ijebu Imushin","content":"Eye Foundation Hospital, Ijebu Imushin is located at Old Lagos-Ore-Benin Road, Ilese \/ Ijebu-Imushin, Ogun. This was established in 2013.\r\n\r\nSaviour of Sight Award by the Latter Day Saints charity, West African Regional Office, Ghana\r\n\r\nIjebu Professional's Award for Excellence in medicine\r\nA member of the Eye Foundation Hospital Group, this is the first and foremost indigenous eye practice in the country that runs a group practice with many sub specialized ophthalmologists.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Eye Foundation Hospital, Ijebu Imushin, here are some helpful things to take along with you:\r\n\r\nYour medical reports and documents\r\n\r\nExtra pair of clothes\r\n\r\nBest Features\r\nThis is a high tech specialist Eye hospital committed to promoting excellence in eye care delivery, research, and training. It is equipped with modern surgical facilities that are regularly upgraded to meet international standards.\r\n\r\nWriter's Review\r\nProviding state-of-the-art ophthalmic care comparable to that obtainable in foreign countries, Eye Foundation Hospital aims to establish itself as the premier specialist eye hospital in Africa.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"17","title":"Sacred Heart Hospital","content":"Sacred Heart Hospital is located at Lantoro Road, Abule Oloni, Abeokuta, Ogun.\r\nThis was established in 1895. It is notable as the oldest existing medical hospital in Nigeria\r\nThe Sacred Heart Hospital is a Catholic missionary general hospital that provides healthcare and is also a reputable center for the training of health care personnel\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Sacred Heart Hospital, here are some helpful things to take along with you:\r\n\r\nYour medical reports and documents\r\n\r\nExtra pair of clothes\r\n\r\nBest Features\r\nParticularly known for its outreach programs which provide the most destitute regional population with the best possible, if basic, healthcare, Sacred Heart Hospital is a 300-bed hospital that has played a central role in the healthcare of Ogun State.\r\n\r\nWriter's Review\r\nLong been approved as a training center for various medical disciples, it is a reputable medical center for internships and residency. A referral point for many other hospitals in and around the state, it continually services and provides healthcare using available technology.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"18","title":"Babcock University  (BU)","content":"Babcock University is located at Ilishan-Remo, Off Sagamu-Benin Expressway, Ogun.\r\n“For travelers who intend to visit\/ for prospective students of the institution, here are some things to note”:\r\nSecurity\/Safety\r\nBU offers maximum security, with 24 hours of surveillance. It is a very safe location.\r\n\r\nWhat to Bring\r\nBooks and other educational materials.\r\n\r\nThings to do while at Babcock University\r\nEnroll for full and part-time courses.\r\nReceive lectures.\r\nAttend educational, social and religious events.\r\nMake inquiries.\r\nMake extensive use of the library for reading and research purposes.\r\nWorship at religious centers in the University\r\n\r\nMost Common Visitors\r\nStaff, Students, and Researchers are the most common people you will find there.\r\n\r\nBest Features\r\nBU is a Christian private University that has risen through the ranks to become one of the most reputable Universities in Nigeria. Through a thorough religious and academic background, graduates of BU have come to be respected and are well represented in almost all walks of life in the nation.\r\nWriter’s Review\r\nAs a Seventh-day Adventist school, it incorporates the doctrines and practices of the Seventh-day Adventist Church to lead each student to a total dedication of life in selfless service for God and Humanity. As the motto implies “Humility, Truth, and Service”, the University strives to imbibe these principles in its students guiding them to the formation of a character marked by integrity, self-discipline, responsibility, tolerance, loyalty and spiritual leadership.\r\n\r\nNotable Milestones\r\nBabcock University Makes History, Performs First Open Heart Surgery-Laila’s Blog- Oct 23, 2015.\r\nAward for the Best Private University in Africa.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"19","title":"Covenant University  (CU)","content":"Covenant University is located at Km 10 Idiroko Road, Canaan Land, Ota, Ogun.\r\nThings To Know About Covenant University\r\nFor travelers who intend to visit\/ for prospective students of this institution, here are some things to note:\r\n\r\nSafety\/Security\r\nThe University is in a very secure location, with top-notch security personnel, and 24\/7 CCTV cameras.\r\n\r\nWhat To Bring\r\nBefore heading to CU, here are a few handy items to come along with:\r\n\r\nBooks, and other Educational materials\r\n\r\nA camera for taking fun pictures.\r\n\r\nThings To Do While At CU\r\nThese are the following things you can do while you’re here:\r\n\r\nPartake in educational, recreational, social, and religious events held.\r\n\r\nMake extensive use of the library and other resource materials.\r\n\r\nSightseeing.\r\nMake inquiries about their admission process.\r\nEnroll in full and part-time courses.\r\n\r\nBest Features\r\nFounded on the ethos of strong Christian mission, with a motto of raising a new generation of world leaders, CU runs in four colleges namely; College of Business and Social Science, College of Engineering, College of Leadership Development Studies and College of Science and Technology.\r\n\r\nNotable Milestones\r\nHebron Startup Labs; Nigeria’s first incubation hub in a tertiary institution.\r\n\r\nFormally established in 2017, it was developed to help produce more entrepreneurs (regardless of their academic level) from within the institution rather than just having certificates after graduation and contributing to the Nation’s unemployment rate.\r\n\r\nIn 2017 Covenant University graduates were revealed to be the most employed graduates by Job search websites such as Stutern, Jobberman, and BudgIT.\r\n\r\nCovenant University partners firm on clean energy- Punch Newspapers- Apr 9, 2016.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"20","title":"Crawford University","content":"Crawford University is located at Igbesa, Ogun State, Ogun.\r\nThings To Know About Crawford University\r\nFor travelers who intend to visit and for prospective students, here are a few awesome things to know:\r\n\r\nSecurity\r\nThe University is situated in a secure location with seasoned security personnel.\r\n\r\nBest Time To Visit\r\nDuring office hours on weekdays, the University is open to inquiries and studies.\r\n\r\nWhat To Bring\r\nBefore heading to the institution, here are a few things to bring along:\r\nBooks\r\nEducational Materials\r\n\r\nA valid means of identification.\r\n\r\nCrawford University School Fees\r\nHaving an idea of the school fees, at the institution is one step in the right path. The University has released its tuition fee schedule for different programs, find this by clicking the link Crawford university\/school fees.\r\n\r\nMost Common Visitors\r\nStudents, staffs, and education enthusiasts are the most common faces at the University.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"21","title":"Olabisi Onabanjo University","content":"Olabisi Onabanjo University is located at Ago-Iwoye, Ogun.\r\nFor travelers who intend to visit\/prospective students of the institution, here are a few things to note\":\r\n\r\nSafety\/Security\r\nThe University is located in a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Olabisi Onabanjo University, here are some handy things to take along with you:\r\nBooks\r\nEducational materials\r\n\r\nSeminar necessities\r\n\r\nFor a Post-UTME candidate: come along with all necessary documents such as JAMB result slip, Post-UTME exam pass, writing materials. It's also advisable to bring some form of identification.\r\n\r\nThings To Do\r\nWhile at OOU, you can do the following:\r\n\r\nEnroll in a full-time or part-time program\r\n\r\nTake a tour around the University\r\n\r\nVisit places of interest\r\n\r\nParticipate in social and religious events.\r\nBest Features\r\nOOU was established in response to the reduced standard of education in the Ogun state and currently stands as one of the foremost institutions in the state.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"22","title":"Bells University of Technology  (Bellstech)","content":"Bells University of Technology is located at Ota, Ogun.\r\nhis was established in 2004to be a world-renowned University committed to the development and transformation of society through environmentally friendly technology and other innovations\r\nThis is a modern school of science and technology in the heart of western Nigeria with ultra-modern facilities and excellent lecturers.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Bells University of Technology, here are some helpful things to take along with you:\r\n\r\ncash\/credit cards\r\n\r\nBest Features\r\nFondly called 'Brick City' by the students because of the heavy use of bricks in its architecture, it is a center for higher education with most faculties leaning heavily on technological advancement.\r\n\r\nWriter's Review\r\nIt is a very safe and properly structured school learning environment.\r\n\r\nMost common visitors\r\nStudents, Parents, and Lecturers.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"23","title":"Day Waterman College  (DWC)","content":"Day Waterman College is located at Abeokuta-Sagamu Expressway, Asu Village Road, Abeokuta, Ogun.\r\nDWC provides education of world-class standards in an environment of care, using the best available facilities both locally and abroad with the aim to build the next generation of leaders for the country and indeed the African continent.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Day Waterman College, here are some helpful things to take along with you:\r\n\r\nEducational materials if you are a new or returning student\r\n\r\nHousing necessities if you are a new or returning student\r\n\r\nAn ID Card to identify yourself as they get suspicious of unattended strangers\r\n\r\nBest Features\r\nThe college is a modern co-educational boarding school designed to provide an exciting learning environment for children between the ages of 11-16\\. Whilst Day Waterman College provides a UK-based education program, it continually develops its curriculum provision map so that it integrates the Nigerian and British curricula into one comprehensive program of study. Set on a 35-hectare of the natural landscape, it has facilities and equipment of outstanding quality that have been provided to support the learning environment, including access to safe recreational areas.\r\n\r\nWriter's Review\r\nTheir students are entitled to receive a high quality education that not only caters for their diverse intellectual needs but also guarantees that their emotional, social and spiritual needs are met. All of this is possible within an environment that offers world-class facilities, in a natural, peaceful and focused setting. The surrounding is well kept and the decorum and order in the school speak volume of the efficiency of the training the school provides.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"24","title":"Crescent University","content":"Crescent University is located at KM. 5, Ayetoro Road, Lafenwa, Abeokuta, Ogun.\r\nCrescent University is an Islamic, non-sectarian and co-educational institution.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Crescent University, here are some helpful things to take along with you:\r\n\r\nAcademic documents\r\n\r\ncash\r\n\r\nBest Features\r\nI love this school because it promotes exemplary research and services oriented towards the achievement of human development.\r\n\r\nWriter's Review\r\nI would recommend people to go here because the mission of the University is to evolve a unique element for the delivery of University education fused with total quality assurance in ways that will develop personal discipline and integrity and promote societal values.\r\n\r\nMost common visitors\r\nStudents and Lecturers.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"25","title":"Redeemed Christian Church of God Camp  (Redemption Camp)","content":"Redeemed Christian Church of God Camp is located at Km 46 Lagos-Ibadan Expressway, Mowe, Ogun.\r\n\r\nCalled \"The City of Christians\", this is the headquarters of the Redeemed Christian Church of God Church and tranquil home to a population of about 10,000 people, arguably making it the largest Christian city in the world.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Redeemed Christian Church of God Camp, here are some helpful things to take along with you:\r\n\r\nBible and Hymn Book\r\n\r\nChange of clothes\r\n\r\nOfferings and Tithes\r\n\r\nBest Features\r\nWithin the Camp, there are several other structures like the main auditorium, The Redeemed Christian Bible College, Redeemer High School, International Guest House, post office, supermarket, power station, water treatment plant among others. Streets and addresses in the Redemption Camp get their names from the biblical narratives and experiences such as Redeemer Avenue, Victory Avenue, Salvation Way, etc. Right at the heart of the city are the sprawling Congress Arena, the main auditorium where services are held and a sanctuary for the faithful who come to pray and make supplications to God.\r\n\r\nWriter's Review\r\nIt is a neat town that works. The environment is clean and fresh, the electricity supply is uninterrupted and there are decent transport systems in place. Wafting from loudspeakers in different parts of the camp is mellow Christian music. The soothing effect of the songs is occasionally interrupted by exhortations in recorded messages.","contentgroup":"Religion","travel":"0","favourite":"0"},
{"id":"26","title":"Mountain of Fire and Miracles Prayer City  (MFM Prayer City)","content":"Mountain of Fire and Miracles Prayer City is located at KM 12, Lagos-Ibadan Express Way, Ibafo, Ogun.\r\n\r\nThis was built in 1999.\r\nPopularly known as Prayer City, this is the prayer camp of the Mountain of Fire and Miracles Ministries Church and it is reported to be worth fifty billion nairas.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Mountain of Fire and Miracles Prayer City, here are some helpful things to take along with you:\r\n\r\nBible and Hymn Book\r\n\r\nOfferings and tithes\r\n\r\nChange of clothes\r\n\r\nBest Features\r\nOne of the largest Christian auditoriums in Nigeria, the auditorium, which was fashioned after the Redemption Camp can accommodate over 500,000 worshipers, with an overflow of 250,000\\. It houses the Mountain Top University, the Deliverance Stadium and a large number of chalets for worshipers.\r\n\r\nMost common visitors\r\nChristians, ministers of God, and tourists.","contentgroup":"Religion","travel":"0","favourite":"0"},
{"id":"27","title":"Corona Secondary School, Agbara","content":"Corona Secondary School, Agbara is located at Yenagoa Road, Agbara Estate, Agbara, Ogun.\r\nThis is a residential, co-educational school with a unique curriculum that differentiates the graduates of the school from other schools and allows them access to the best colleges and universities anywhere in the world.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Corona Secondary School, Agbara, here are some helpful things to take along with you:\r\n\r\nEducational materials if you are a new or returning student\r\n\r\nHousing necessities if you are a new or returning student\r\n\r\nAn ID Card to identify yourself if you are a visitor\r\n\r\nBest Features\r\nLocated on a scenic 2.3-hectare campus, it provides students with a peaceful and natural environment where they can study and thrive free from the stress of city life. This environment provides ample space for sports; students have access to football, volleyball, basketball, tennis, athletics, and badminton as well as more unusual sports such as Taekwondo. The residential nature of the school also means that there is plenty of time for art, music, and drama to thrive and for students to be exposed to a range of clubs, societies, and activities.\r\n\r\nWriter's Review\r\nWith facilities such as spacious classrooms equipped with computers, interactive whiteboard, and television sets, a high profile school library fully stocked with books covering virtually all subjects, a well-equipped science room with a built-in electronic smartboard for effective teaching, and resources for teaching modern language, no wonder this is ranked one of the best secondary schools in West Africa.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"28","title":"Ijebu-Ode Grammar School","content":"Ijebu-Ode Grammar School is located at Abeokuta Road, Ijebu Ode, Ogun\r\n\r\nThis was established in 1913.\r\nA co-educational school, this is the oldest secondary school in Ijebuland, the second oldest in Ogun State, and the second oldest in the defunct Western State of Nigeria.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Ijebu-Ode Grammar School, here are some helpful things to take along with you:\r\n\r\nEducational materials if you are a new or returning student\r\n\r\nAn ID Card to identify yourself if you are a visitor\r\n\r\nBest Features\r\nArguably the best school in Ijebu Ode and Ogun State as a whole, it was initially sited in the private residence of its founder before they acquired the present land for the school premises. In 1938, the school moved to its present site and was commemorated with the important block; the famous 1938 Block.\r\n\r\nWriter's Review\r\nNotable Nigerians that has passed through the school include Otunba (Dr.) Micheal Olasubomi Balogun (CON), Olabode George, Adeola Odutola, Ayo 'Wizkid' Balogun, Abraham Aderibigbe Adesanya and many others.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"29","title":"Simeon Adebo Library","content":"Simeon Adebo Library is located at Presidential Boulevard, Abeokuta, Ogun.\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Library","travel":"0","favourite":"0"},
{"id":"30","title":"National Library of Nigeria, Ogun","content":"National Library of Nigeria, Ogun is located at 83, Ijemo Agbadu Road, Abeokuta, Ogun.\r\nThis was built to ensure the building of an informed and enlightened citizenry through the provision of information resources that are readily available and easily accessible..\r\nThis federal-owned library offers free services to the public, with a wide range of quality books and learning materials in stock.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the National Library of Nigeria, Ogun, here are some helpful things to take along with you:\r\n\r\nStudy materials\r\n\r\nBest Features\r\nNational Library of Nigeria offers a serene and quiet environment which makes studying attractive. The library's book collection contains current books, journals, periodicals, and reports. If you're in Ogun state and need a place to study, you should visit the National Library of Nigeria.\r\n\r\nMost common visitors\r\nStudents, teachers, researchers.","contentgroup":"Library","travel":"0","favourite":"0"},
{"id":"31","title":"National Gallery of Art, Abeokuta","content":"National Gallery of Art, Abeokuta is located at Ogun State Library Board, Sapon, Abeokuta, Ogun.\r\nNational Gallery of Art, Phone: 234 Email: info@nga.gov.ng\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\n32\r\nTai Solarin University of Education  (TASUED)\r\nTai Solarin University of Education is located at Ijagun Road, Ijebu Ode, Ogun.\r\n\r\nThis was established in 2005.\r\n\r\n \r\nThis is is a unique tertiary institution, apart from being the first of its kind in Nigeria, she is the only institution in the country that offers both the Bachelor's degree programs in education (B.Ed.) and trains National Certificate of Education (NCE) graduates within the same academic environment\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Tai Solarin University of Education, here are some helpful things to take along with you:\r\n\r\nAcademic documents\r\n\r\nCash\r\n\r\nValid Identification\r\n\r\nBest Features\r\nI love this place because they enhance the quality of teaching and learning and continuously update the methods and skills of knowledge providers by equipping them with modern technology services delivered by skilled and motivated members of staff to meet the contemporary and future needs of Nigeria with the capability to compete globally.\r\n\r\nWriter's Review\r\nI would recommend this place for their strong moral values and effective teaching methods that produce the finest graduates capable of impacting society in a positive manner.\r\n\r\nMost common visitors\r\nLecturers and students","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"32","title":"The Federal University of Agriculture, Abeokuta  (FUNAAB)","content":"Federal University of Agriculture, Abeokuta is located at the Federal University of Agriculture, Alabata Road, Ogun.\r\nThe university is one of the three universities of agriculture in Nigeria, the others being in Makurdi (Benue State) and Umudike(Abia State).\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the Federal University of Agriculture, Abeokuta, here are some helpful things to take along with you:\r\n\r\nAcademic documents\r\n\r\nCash\r\n\r\nValid Identification\r\n\r\nBest Features\r\nI love this place because it is a center of excellence in knowledge generation for global development and the sustenance of an environmentally friendly society.\r\n\r\nWriter's Review\r\nI would recommend this place because they build great future leaders and generate knowledge through research and intellectually stimulating environment for teaching, learning and community outreach towards sustainable development.\r\n\r\nMost common visitors\r\nLecturers and students","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"33","title":"Otunba Dipo Dina International Stadium","content":"Otunba Dipo Dina International Stadium is located at Stadium\/Talbort-Awujale Road, Ijebu-Ode, Ogun.\r\nFormerly known as Gateway Stadium, this is a multi-purpose stadium that serves as the home ground of FC Ebedei.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nMostly used for football matches, the stadium has a capacity for 20,000 spectators. A conducive stadium where comfort is prioritized for spectators, it has also hosted a number of social and political events.\r\n\r\nWriter's Review\r\nThe stadium is an enjoyable place to feel the local spirit and view a great game with sports enthusiasts. The comic chants amongst fans in Pidgin English are also something to look forward to.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"34","title":"Ilaro Stadium","content":"Ilaro Stadium is located at Off Ndoji Road, Ilaro, Ogun.\r\nThis is a multi-purpose stadium currently used mostly for football matches. It is the home stadium for Gateway F.C.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nIt features a seating capacity of 12,000 with its stands uncovered. It has an athletic track surrounding the main bowl and the pitch is adorned with natural grass.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"35","title":"Rainbow College","content":"Rainbow College is located at KM 39, Lagos-Ibadan Expressway, Asese Village, Maba, Ogun.\r\nOne of the best in Nigeria and known for its all-round excellence, Rainbow College is a co-educational Day and Boarding secondary school.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Rainbow College, here are some helpful things to take along with you:\r\n\r\nEducational materials if you are a new or returning student\r\n\r\nHousing necessities if you are a new or returning student\r\n\r\nAn ID Card to identify yourself if you are a visitor\r\n\r\nBest Features\r\nIt has state-of-the-art facilities and equipment to make teaching and learning transactions most effective and efficient. Their multi-curriculum teaching platform, which comes with a deliberate blend of Nigerian, and British curricula, puts students on a pedestal for international education opportunities. This location houses only the Boarding school. The Day School is located in Surulere.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"36","title":"The Ambassadors Schools","content":"The Ambassadors Schools is located at 74, Idiroko Road, Baby 'O' Bus-stop, Oju-ore, Ota, Ogun.\r\n\r\nThis was established in 1998.\r\nThis is a Christian co-educational private secondary school seen as one of the best schools in Ota environs.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to The Ambassadors Schools, here are some helpful things to take along with you:\r\n\r\nEducational materials\r\n\r\nYour ID card in case you need identification proof\r\n\r\nBest Features\r\nBelievers in the notion that adequate and appropriate facilities are required for the development of a child, the school is well-equipped with facilities such as a state-of-the-art library and research center, ICT center equipped with the latest computer systems, spacious and conducive classrooms, and a comfortable environment that encourages extracurricular activities.\r\n\r\nMost common visitors\r\nStudents, Teachers, Parents and Guardians","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"37","title":"Iganmode Grammar School  (IGS)","content":"Iganmode Grammar School is located at Oju-Ore, Along Idiroko Road, Ota, Ogun.\r\nThis was established in 1960.\r\n\r\nA post-primary and premier academic institution renowned for its alumni and its glory days, this government-owned secondary school is one of the oldest in Ogun, and also one of the most respected having won many titles in academic and non-academic competitions.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Iganmode Grammar School, here are some helpful things to take along with you:\r\n\r\nEducational materials\r\n\r\nBest Features\r\nThe establishment of the school was premised on the need to provide sound secondary education for the boys in Ota. Years later, they widened their doors to girls and became a co-educational school. As a government-managed school, it is one of the centers for the Joint Admission Matriculation Board (J.A.M.B) exam. It has standard laboratories with adequate space for extracurricular activities.\r\n\r\nWriter's Review\r\nThe school is overpopulated and it has become hard to properly maintain facilities put in place for better education. Some classes still use Chalk Boards and students sit on broken chairs. In spite of these, it is still a highly regarded school among the acada competition circles. For the first time in the history of Cowbell National Mathematics competition in Nigeria Public Schools, IGS student won the overall best prize for three consecutive years; 2011, 2012 and 2013.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"38","title":"Ace Medicare Clinics","content":"Ace Medicare Clinics is located at Km 4 Idiroko Road, Ota, Ogun.\r\n\r\nThis was established in 1989.\r\nThis is a private primary health care center housed in an ultramodern facility, offering the best medical care suited for each need.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Ace Medicare Clinics, here are some helpful things to take along with you:\r\n\r\nYour medical reports and documents\r\n\r\nExtra pair of clothes in case you get admitted\r\n\r\nBest Features\r\nWell-manned with trained, skilled and experienced medical practitioners, the hospital offers professional services in comprehensive health screening, dental clinics and surgeries, antenatal clinics and deliveries, infant welfare clinics and immunization, ultrasound scanning, X-Ray investigations, Computerized Tomography (CT) scan, dialysis, physiotherapy, E.C.G, specialists' consultations, and full admission facilities including executive, private, semi-private and general ward facilities.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"39","title":"Faith Specialist Hospital","content":"Faith Specialist Hospital is located at Plot 25, Block 7, Opp. Tower Aluminium Rolling Mills, Ogun State Industrial Housing Estate, Ota, Ogun.\r\nThis was established in 2010.\r\n\r\nLocated in a serene environment that is easily accessible, this is a specialist hospital geared towards the delivery of qualitative, efficient and prompt medical care.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Faith Specialist Hospital, here are some helpful things to take along with you:\r\n\r\nYour medical reports and documents\r\n\r\nExtra pair of clothes in case you get admitted\r\n\r\nBest Features\r\nThis is a 24 bedded hospital licensed by the government to practice predominantly as a trauma center. In providing 24 hours consultant-led and technology-driven medical care services, the hospital is well equipped with modern operating theatres for major surgeries, full laboratory units, a well-stocked pharmacy, radio-diagnostic units, and admission facilities. They provide specialist services in deformity correction, orthopedic surgery, physiotherapy and rehabilitation, accident and emergency services, procurement and fitting of prostheses (Artificial Limbs), burns and plastic surgery, and general surgical and medical services.\r\n\r\nWriter's Review\r\nTheir wards are conducive for patient’s relaxation and their staff are both warm and efficient in carrying out their work.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"40","title":"St. Peter Catholic Church, Ota","content":"St. Peter Catholic Church, Ota is located at Awolowo Way, Next to Local Government Secretariat, Ota, Ogun.\r\n\r\nThis was established in 1955.\r\nA renowned place of worship, this is the quintessential Catholic church for people in the Ota area who do not want to miss a day of Mass.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to St. Peter Catholic Church, Ota, here are some helpful things to take along with you:\r\n\r\nHoly Bible and Hymn Book\r\n\r\nOfferings and tithes\r\n\r\nThings to do while at St. Peter Catholic Church, Ota\r\nThese are the following things you can do while you're here:\r\n\r\nGo for confession\r\n\r\nPartake in Communion service\r\n\r\nBest Features\r\nThe church boasts of a beautiful choir with hymns always beautifully rendered. It has ample parking space. There is a variety in their way of fellowship as some sermons are done in the native Yoruba language.\r\n\r\nWriter's Review\r\nIt is a nice and soothing place with the ambiance and the serenity it affords.\r\n\r\nMost common visitors\r\nPeople looking for a place to worship, especially Catholics.","contentgroup":"Religion","travel":"0","favourite":"0"},
{"id":"41","title":"Reverend Kuti Memorial Grammar School","content":"Reverend Kuti Memorial Grammar School is located at Isabo, By Kuto Road, Abeokuta, Ogun.\r\n\r\nThis was established in 1964.\r\nNamed after the educationalist Reverend Israel Oludotun Ransome-Kuti, this is one of the oldest standing secondary school in Abeokuta and even Ogun State.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Reverend Kuti Memorial Grammar School, here are some helpful things to take along with you:\r\n\r\nEducational materials\r\n\r\nBest Features\r\nA Day co-educational school, it has produced a lot of prominent people who have contributed to nation-building. Remodeled after a period of declining facilities, it has been restored to its glory of academic excellence.\r\n\r\nMost common visitors\r\nStudents, teachers, parents, guardians, and sometimes hawkers who enter the premises to sell their wars during the students' break periods.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"42","title":"Our Lady of Apostles Secondary School, Ijebu-Ode","content":"Our Lady of Apostles Secondary School, Ijebu-Ode is located at Old Epe Garage, Ijebu-Ode, Ogun.\r\n\r\nThis was established in 1954.\r\n\r\nThis is a Catholic, independent, all-girls school known for the caliber of its graduates that have grown to become prominent and respectable personalities in Nigeria.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Our Lady of Apostles Secondary School, Ijebu-Ode, here are some helpful things to take along with you:\r\n\r\nEducational materials\r\n\r\nHousing necessities if you are a new or returning student\r\n\r\nBest Features\r\nThe school is known for its moral and academic excellence. It was established with a philosophy to educate African women. Known as one of the best schools in Ogun, its academic, sports and extra-curricular activities and performance lend credence to the competence of the school in molding a complete, all-round and capable girl-child well equipped to be of value to the nation.\r\n\r\nWriter's Review\r\nLife in the hostel entails studying, learning to live together, recreating and praying together for the fuller development of the child.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"43","title":"Ogun State NYSC Secretariat","content":"Ogun State NYSC Secretariat is located at Oke-Ilewo, Abeokuta, Ogun.\r\nThis is the administrative office of the National Youth Service Corps in Ogun. It oversees the welfare, documentation and the general affairs of youth corpers in the state.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nAlways come in your NYSC uniform or you won't be attended to\r\n\r\nWhat To Bring\r\nBefore heading to Ogun State NYSC Secretariat, here are some helpful things to take along with you:\r\n\r\nAll documents regarding NYSC including; Call-up letter, Registration documents, School's Certificate, Green Card and Student ID Card\r\n\r\nCopies of Passport Photographs\r\n\r\nYour NYSC ID Card\r\n\r\nBest Features\r\nWhile there are secretariats in all local governments in the state, this is the headquarters and so houses the State Coordinator, along with other high ranking state officials. It is here to report to after your 21 days at the Orientation Camp to get assigned to your Place of Primary Assignment (PPA). Weekly Community Development Service (CDS) are also held here, along with the NYSC sponsored Skills Acquisition Entrepreneurship Development program. This is also where to go if you have inquiries about the NYSC scheme in Ogun State.\r\n\r\nWriter's Review\r\nAs long as you are fully kitted in your NYSC uniform, you have no fear of being turned away. Different people have different tales of how they interacted with the officials and staff but I have found that a smile, knowledge of the local language, and an appealing face helps for positive interaction. It will be wise to befriend one of the staff as you never know when an inside-ear will be needed.\r\n\r\nMost common visitors\r\nYou will see a lot of Corps members, NYSC staff, SAED Instructors and hawkers here.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"44","title":"Abeokuta Golf Club","content":"Abeokuta Golf Club is located at Golf Resort Drive, Off IBB Drive, Oke Mosan, Abeokuta, Ogun.\r\n\r\nA serene and picturesque golfing and leisure spot, this is a members club that boasts a beautiful yet technical course that can give the experienced golfer a good challenge while remaining forgiving for the less experienced player. It is a prestigious and highly sought club in Ogun State.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Abeokuta Golf Club, here are some helpful things to take along with you:\r\n\r\nA hat and shades for the sunny day\r\n\r\nCamera to capture the adventures of the day and lovely sights\r\n\r\nCash or Credit\/Debit Card\r\n\r\nBest Features\r\nRanking with the best in Nigeria, they have a 4.5-kilometer course comprising four par three, four par fives and 10 par four holes. The course is surrounded by hills, one of which the clubhouse sits upon giving a bird’s eye a few of many parts of the course. The club-house is a lively place to unwind after a hard day on the course. Continually attracting new members because of its exclusivity and environment, the club extends a warm reception to intending members and visitors alike.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"45","title":"Olusegun Obasanjo Cinema House","content":"Olusegun Obasanjo Cinema House is located at Presidential Boulevard, Oke Mosan, Abeokuta, Ogun.\r\n\r\nThis is one of the fun spots Abeokuta has to offer. Located in the Green Legacy Resort, the 900-seater auditorium is transformed into a cinema house that shows exclusively Nigerian movies.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Olusegun Obasanjo Cinema House, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"46","title":"DLK Events Centre","content":"DLK Events Centre is located at Along Moshood Abiola Way, Abeokuta, Ogun.\r\n\r\nThe Yoruba's are known to love parties. No matter the occasion, they are known to go all out in their celebrations. It is no wonder event centers have become social hot spots for the 'Who is Who's to come to see and be seen in. DLK Events Centre is one of such popular event centres and if an event is hosted here, it is taken to be by the A-listers.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\ndress according to the occasion.\r\n\r\nWhat To Bring\r\nBefore heading to DLK Events Centre, here are some helpful things to take along with you:\r\n\r\nCamera to capture the event and sights\r\n\r\nYour invitation card\r\n\r\nWriter's Review\r\nEvents held here are always the talk of the town for months to come. It may be because of the type of people that can afford the centre, or the magic the event managers perform to transform the centre to match the imaginations of the clients. For whatever reasons, this is a place to see and be seen in.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"47","title":"Mariam Babangida Park","content":"Mariam Babangida Park is located at IBB Boulevard, By Kuto Roundabout, Abeokuta, Ogun.\r\n\r\nThis is a popular park located opposite the Kuto Market and Bus park. Named after the wife of the former president Ibrahim Babangida, whom the boulevard is named after, the park is used for a variety of events and businesses.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Mariam Babangida Park, here are some helpful things to take along with you:\r\n\r\nCash.\r\n\r\nCamera.\r\n\r\nIf possible, a local tour guide.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"48","title":"June 12 Cultural Centre","content":"June 12 Cultural Centre is located at By Kuto Roundabout, Kuto, Abeokuta, Ogun.\r\nNamed in commemoration of the annulled June 12 presidential election that saw Abeokuta's child M.KO. Abiola emerges winner in 1993, this cultural center is one of the major landmarks in Abeokuta.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the June 12 Cultural Centre, here are some helpful things to take along with you:\r\n\r\nCamera to capture the sights and take selfies with\r\n\r\nWriting materials and ID Card if you are headed for a conference or seminar\r\n\r\nBest Features\r\nA declining cultural centre that attracted all the wrong sorts, the Ogun State Government rehabilitated and renovated it in 2012 into this impressive architectural edifice that is used for cultural performances and shows, conferences, and events. Painted with the Ogun State colours, it blends the cultural richness and tradition that Ogun is known for with modern technology and design. There is a large hall, the gem of the centre, where major state events are held.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"49","title":"Kuto Park","content":"Kuto Park is located at By Kuto Roundabout, IBB Boulevard, Abeokuta, Ogun.\r\nhis is a popular motor park close to the Kuto market.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Kuto Park, here are some helpful things to take along with you:\r\n\r\nCash","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"50","title":"Ogun State High court","content":"Ogun State High court is located in , Ogun.\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Court","travel":"0","favourite":"0"},
{"id":"51","title":"Ogun State Hospital Management Board (General Hospital)","content":"Ogun State Hospital Management Board (General Hospital) is located at Shokenu Road, Erunbe, Abeokuta, Ogun.\r\nhe Ogun State Hospital Management Board was established by the Ogun State Health Management Edict No. 6 of 1978 promulgated by the Military Government of the state then.It manages the 40 state owned secondary health facilities and has 5 health zones, it aims at providing the state with quality, effective, quantitative and affordable health care services.The board advises and recommends the state government on ways to increase the revenue and matters related to health care through the commissioner.\r\n\r\nSafety\r\nThere is no threat to safety at the Board\r\n\r\nThings to Do\r\nAt the Board, you could work, lay a complaint about any state hospital and sightsee\r\n\r\nWhat to bring\r\nBefore going to the board, make sure to go along with a proper means of identification and the necessary documents needed\r\n\r\nBest Time to Visit\r\nBest time to visit the board would be during its working hours while the staff would be ready to help you achieve your aim\r\n\r\nMost Common visitors\r\nCommon visitors at the board include the staff, medical practitioners and government officials","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"52","title":"South Local Government Clinic","content":"South Local Government Clinic is located in, Ogun.\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"53","title":"Moshood Abiola Polytechnic  (MAP)","content":"Moshood Abiola Polytechnic is located at Ojere Road, South East Abeokuta, Ogun.\r\n\r\nThis was established in 1980.\r\n\r\nOriginally named Ogun State Polytechnic, the school was renamed to commemorate Moshood Abiola, the winner of the annulled June 12 presidential election. It is one of the frontline learning tertiary institutions in Nigeria favored for its academic attainments and practical technological development.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Moshood Abiola Polytechnic, here are some helpful things to take along with you:\r\n\r\nEducational materials\r\n\r\nYour ID card in case you need identification proof\r\n\r\nBest Features\r\nIt commenced operation on two temporary campuses, namely: Oke-Egunya and Onikolobo. Movement of all departments from the temporary campuses to the permanent site at Ojere started in April 1985 and was completed in March 1988. Part of its academic offerings includes classes in Business and Management Studies, Communication and Infomation Technology, Environment Studies, Engineering Science and Technology, and Centre for Part-Time. A prestigious institution, it has many notable people in its alumni organization including Bisi Alimi, Ibikunle Amosun, Dayo Amusa, Adewale Ayuba, Kayode Akintemi, Funke Akindele and many more.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"54","title":"Federal High Court, Abeokuta","content":"Federal High Court, Abeokuta is located at IBB Boulevard, Kobape Road, Adjacent Federal Secretariat, Oke-Mosan, Ogun.\r\n\r\nThis was established in 1973.\r\nThis is a premier court of the first instance, which is generally a court of original jurisdiction. Headquartered in Abuja, this is the Ogun state division of the court and it is presided over by a Chief Judge who is assisted by other Judges.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nIf you must take it, put your phone on Silent Mode while court is in session\r\n\r\nAll mobile phones must be switched off or put in a silent mode when the court is in session\r\n\r\nWhat To Bring\r\nBefore heading to Federal High Court, Abeokuta, here are some helpful things to take along with you:\r\n\r\nYour Wig and Black Gown if you are a practising Lawyer.\r\n\r\nAll documents relating to your case.\r\n\r\nBest Features\r\nIt was originally known as the Federal Revenue Court before it was renamed in 1979\\. It deals and determines causes and matters within the Federal Legislative competence. It is recognizable from the big structure of Lady Justice wielding a sword and a scale that is visible from any part of the court.\r\n\r\nMost common visitors\r\nLegal practitioners, petitioners, and journalists are some of the people that frequent this location.","contentgroup":"Court","travel":"0","favourite":"0"},
{"id":"55","title":"Ogun State Government Secretariat","content":"Ogun State Government Secretariat is located at IBB Boulevard Road, Oke Mosan, Ogun.\r\n\r\nThis is the permanent administrative office of the Ogun State Government. Here, all state agencies and parastatals are quartered. As such, this is one of the most important places in the state.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Ogun State Government Secretariat, here are some helpful things to take along with you:\r\n\r\nA means of identification.\r\n\r\nWriter's Review\r\nMany, if not all government ministries and agencies operate from this imposing complex. If you have any business with the government, you will most likely find yourself here.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"56","title":"NYSC Permanent Orientation Camp, Ogun","content":"NYSC Permanent Orientation Camp, Ogun is located at Ikenne Road, Sagamu, Ogun.\r\nThis campground is where the 3 weeks NYSC Orientation Course takes place. It involves physical drills, lectures and training, and social activities intended to foster interactions among Corpers.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to NYSC Permanent Orientation Camp, Ogun, here are some helpful things to take along with you:\r\n\r\nYour required documents such as Call-up letter, Statement of Result, Student ID Card, etc.\r\n\r\nPassport photographs\r\n\r\nA waist pouch\r\n\r\nWhite tees and shorts\r\n\r\nCash\r\n\r\nHousing necessities\r\n\r\nBest Features\r\nThe camp ground features structures and facilities for paramilitary drills, accommodation rooms, lecture halls, open field for sports and assembly and many of such. There are military personnel who train Corpers on appropriate military ceremonial matching, sports, as well as Man-O-War physical drills. There is a large market operated by the locals popularly called \"Mami Market\" where all camp needs are sold, including food and drinks.\r\n\r\nWriter's Review\r\nIt is said that Orientation Camp is the best part of NYSC, and it is somewhat true. Here, you meet people from all parts of the country and learn and accept local customs and different cultures, make new friends, build camaraderie and learn what to expect during your service year. All through your stay in the camp, except Sunday worship mornings, you will wear your all-white tees, shorts and shoes. You will be served meals thrice daily but most Corpers prefer eating at the Mami Market where the choice and quality of food is better. There is always an activity for each time of the day, with brief moments in the evening allowed for personal use. Go camping with an open mind and a thirst for adventure and you will enjoy it to the fullest.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"57","title":"Ogun High Court, Isabo","content":"Ogun High Court, Isabo is located at Kuto Road, Isabo, Abeokuta, Ogun.\r\n\r\nThis is the High Court for Ogun. It attends to civil and criminal cases. It also attends to appeals from lower courts like the magistrate and district courts.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nIf you must take it, put your phone on Silent Mode while court is in session\r\n\r\nWhat To Bring\r\nBefore heading to Ogun High Court, Isabo, here are some helpful things to take along with you:\r\n\r\nYour Wig and Black Gown if you are a practicing Lawyer\r\n\r\nAll documents relating to your case\r\n\r\nCopies of your passport photograph\r\n\r\nBest Features\r\nIt is one of the Judicial bodies of the Ogun Judiciary. The highest-ranking court in the State Judiciary, it has under it the Magistrate Courts, the Customary Courts, and the Customary Court of Appeal. It is headed by the Honorable Chief Judge and a team of Judges.\r\n\r\nMost common visitors\r\nLaw practitioners, clerical staff, and Journalists.","contentgroup":"Court","travel":"0","favourite":"0"},
{"id":"58","title":"Borstal Training Institution, Abeokuta","content":"Borstal Training Institution, Abeokuta is located at Next to Navy Boys Secondary School, Adigbe, Abeokuta, Ogun.\r\nThis is a place where juvenile offenders are remanded and given both educational and vocational training to rehabilitate and reform them before reintegration into society.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nOne, of the three borstal institutions in Nigeria, and the only one in the South-Western region, this is a known juvenile remand center that has successfully trained and graduated thousands of young people. They offer education in a number of subjects including science and social science courses, with the students participating in the JSSCE, SSCE, JAMB and NECO examinations. Under the vocational programs, the school has tailoring\/dressmaking, brick-laying\/masonry, construction, electrical installation, welding and fabrication, carpentry, photography\/video coverage, plumbing\/ pipe-fitting, painting\/signwriting, and air-conditioning\/refrigeration.\r\n\r\nWriter's Review\r\nIt designed to offer education, regular work and discipline, and separate youths from other convicts. As most public institutions are known to become, the institute has a dilapidated look, with peeled off painted walls, substandard and outdated education materials and equipment, and the general disorderliness of the place. Private individuals and NGOs do what they can to keep it still running as intended.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"59","title":"Alamala Barracks","content":"Alamala Barracks is located at Abeokuta-Idofa Road, Abeokuta, Ogun.\r\nAs a military barrack, this camp is a place where troops of various size and complexity in the Nigerian Military and their families are quartered.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nUnnecessary wandering is highly frowned at in and around this place. However, visitors must be absolutely sure of where they are going to avoid the prospect of loitering.\r\n\r\nWhat To Bring\r\nBefore heading to Alamala Barracks, here are some helpful things to take along with you:\r\n\r\nA means of identification in case one is on official duty.\r\n\r\nBest Features\r\nIt features housing accommodations for the various military personnel and their families. It also features large open spaces for military drills, a healthcare center, religious centers and educational centers for the residents in the barracks.\r\n\r\nWriter's Review\r\nIt is a serene and quiet place. Apart from the guarantee of safety, one also enjoys the abundant military etiquette displayed in the camp. It is kept clean and noise is kept at a bare minimum. One can also befriend a soldier and get fit under military supervision.\r\n\r\nMost common visitors\r\nMembers of the Nigerian army and their families","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"60","title":"Federal Medical Centre, Abeokuta","content":"Federal Medical Centre, Abeokuta is located at Olabisi Onabanjo Way, Idi-Aba, Abeokuta, Ogun.\r\n\r\nThis was established in 1983.\r\n\r\nFormerly the State Hospital, Idi-Aba, this is a tertiary health institution providing qualitative, innovative, and community-based all-round health care.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Federal Medical Centre, Abeokuta, here are some helpful things to take along with you:\r\n\r\nYour medical reports and documents\r\n\r\nAn overnight bag in case you get admitted\r\n\r\nEducational materials as needed.\r\n\r\nBest Features\r\nThis is a 250-bedded regional specialist hospital originally providing medical services, but which over the years, has expanded to providing excellent training and research. The hospital has recorded feats such as separation of Siamese twins, performing the very first trans-oesophageal echocardiography in Nigeria and playing leading roles in a number of local and international collaborative research programs. Serving as a hub to about 16 primary care centers, it has over 50 specialists in various fields of Medicine offering quality and affordable health solutions.\r\n\r\nMost common visitors\r\nHealthcare workers, Medical students, and Patients.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"61","title":"Neuropsychiatric Hospital, Aro","content":"Neuropsychiatric Hospital, Aro is located at Old Lagos Road, Ita-Oshin, Aro, Abeokuta, Ogun.\r\n\r\nThis was established in 1944.\r\n\r\nIn 2015, it was ranked the best hospital in Nigeria by the research group Cybermetrics Lab\r\n\r\nAlso known as \"Aro\", this is a hospital for mental medical issues and the mentally challenged. It is a national and regional mental health resource centre known as the apex centre for Psychiatry in Nigeria.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Neuropsychiatric Hospital, Aro, here are some helpful things to take along with you:\r\n\r\nMedical reports and documents\r\n\r\nEducation materials if you are a medical student\r\n\r\nBest Features\r\nIt offers such medical services like Occupational Therapy, Drug Addiction Treatment, Adolescent Mental Health, Physiotherapy, Forensic Psychiatry, Electroencephalography (EEG), Radio-Diagnostics, in addition to its School of Psychiatric Nursing, Clinical Nursing, and Psychiatry Residency Training.\r\n\r\nWriter's Review\r\nAlthough run by the Federal Government, it is manned with qualified and experienced medical doctors, pharmacists, nurses, and other medical practitioners.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"62","title":"Olabisi Onabanjo University Teaching Hospital","content":"Olabisi Onabanjo University Teaching Hospital is located at Hospital Road, Sagamu, Ogun.\r\nThis was established in 1986.\r\nFormerly known as Ogun State University Teaching Hospital, this is a tertiary health facility that provides secondary and tertiary medical care and is also involved in the training of high and middle-level manpower for the health industry.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Olabisi Onabanjo University Teaching Hospital, here are some helpful things to take along with you:\r\n\r\nYour medical reports and documents\r\n\r\nAn overnight bag in case you get admitted\r\n\r\nEducation materials if you are a medical student\r\n\r\nBest Features\r\nIt was established to provide clinical facilities for the training of medical students in conjunction with the Obafemi Awolowo College of Health Sciences (OACHS), Olabisi Onabanjo University (OOU), and for the provision of tertiary health care services for the indigene of Ogun. It serves as the last port of call for expert management of the most diseased conditions, offering a wide range of medical services. Besides offering medical services, the hospital also provides clinical education and training to students, nurses, and other healthcare professionals.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"63","title":"Abeokuta Grammar School","content":"Abeokuta Grammar School is located at Olabisi Onabanjo Way, Idi-Aba, Abeokuta, Ogun.\r\nThis was established in 1908.\r\n\r\nThe first secondary school established outside Lagos, this is a popular school known for its history, academy excellence and producing some of Nigeria's finest.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Abeokuta Grammar School, here are some helpful things to take along with you:\r\n\r\nEducational materials\r\n\r\nAn ID Card to identify yourself if you are a visitor\r\n\r\nBest Features\r\nThis is a public co-educational Junior and Senior secondary school. Recording success in all areas including education, competitions, social events, and even on the international scene, the prestigious school has continually remained one of the brightest secondary schools. As the oldest secondary school in Ogun State, it has a very proud history. In fact, it produced the likes of the Nobel Laureate winner Prof. Wole Soyinka, Music Legend Fela Anikulapo-Kuti, Film Director Tunde Kelani, among a host of other prominent Nigerians. It boasts of a magnificent Stadium and an ultra-modern sports facility within its compound.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"64","title":"Alake of Egbaland Palace","content":"Alake of Egbaland Palace is located at Ake Road, Abeokuta, Ogun.\r\nThis is home to the traditional ruler of the Egba clan, whose title is Alake of Egbaland. The present ruler built a new palace behind the old palace, and so one first goes through the period of old mortar and bricks with its history, onto this modern period of advanced technology.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Alake of Egbaland Palace, here are some helpful things to take along with you:\r\n\r\nCamera to capture the sights and take selfies with\r\n\r\nA local guide to help you navigate the Do's and Don't's\r\n\r\nBest Features\r\nWhen the palace comes into view, the first things you notice are the two magnificent pillars that anchor the gate. They are decorated with the Alake's emblem and a bar connects them together. Inscribed on the bar are the Yoruba words, \"Aafin Alake Ti Ile Egba\" which translates to \"Alake of Egbaland Palace\". Walking inside, one immediately sees the old palace. It is still well maintained and one can see its majesty and the awe it inspired in visitors of old. There are statues, busts and figurines adorning the compound, each telling its own tale. Asides the palaces, there is an ICT center, a squash court, and an office for the Egba Traditional Council.\r\n\r\nWriter's Review\r\nThe palace is rich in art, culture, history and the tradition of the Egba clan. Everything about it boastfully displays the pride of the Egba people. There are palace staff who will take you on a tour of the palace but unless you have a royal appointment, you may not enter the palace chambers itself nor see the Alake. However, there are a lot of intriguing sights to grip your fancy.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"65","title":"Kemta Adire Market","content":"Kemta Adire Market is located at Asero Road, Abeokuta, Ogun.\r\nA distinctive cultural product of women of the Egba land, Adire is an exotic fabric made in the Tie-and-Dye industry that is loved and coveted for its intricate designs as well as the process involved in making it. This market is seen as the largest Adire market in Africa. It is also called Kampala so sometimes, the market is referred to as Kampala Market.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Kemta Adire Market, here are some helpful things to take along with you:\r\n\r\nCash only as it is operated by local clothing vendors\r\n\r\nShopping List\r\n\r\nCamera to capture the sights and experience\r\n\r\nBest Features\r\nOne of the biggest commodity exported from Abeokuta, Adire, which means 'Tied and Dyed' attracts thousands of traders and tourists alike on a daily basis who come to patronize the women traders, order batches, learn from them or simply marvel at the art involved. The market was built by the then Governor, Chief Olusegun Osoba. There are stalls sprawling the market with the fabrics of different African designs displayed.\r\n\r\nWriter's Review\r\nMost of the women converse in the local language Yoruba, and some in Pidgin English. Therefore,if you understand neither, you should take a local along for communicating. The market is rowdy and not well maintained so come along with durable footwear and clothes. If you are visiting Abeokuta, a trip to the market is a must as there is no better proof of your visit than wearing an Adire fabric.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"66","title":"The Bells University of Technology  (The Bells)","content":"The Bells University of Technology is located at Kilometer 8, Idiroko Road, Ota, Ogun State., Ogun.\r\nBells University of Technology is the first private university of technology established in Nigeria. It was established in 2004.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"67","title":"Rubee Medical Center Ltd  (Rubee Hospital)","content":"Rubee Medical Center Ltd is located at Km 38, Abeokuta Expressway, Sango Ota, Ogun.\r\n24\/7 privately ran hospital with quality service\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"68","title":"Justrite Superstores, Ota  (Justrite)","content":"Justrite Superstores, Ota is located at Kilometer 4, Idiroko Road, Sango Ota, Ogun State, Ogun.\r\nJustrite Superstore, Ota is the head office of the Justrite superstore's retail chain, It prides itself as the biggest and the best retail store in Ota with strong market acceptance and equally enjoys strong brand equity. Justrite Super Store is an ultra-modern mega store well-stocked with a wide variety of goods.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Justrite Superstores, Ota, here are some helpful things to take along with you:\r\n\r\nMoney for purchase, the ATM card is also useful in lieu of cash as the POS terminal is active.\r\n\r\nMost common visitors\r\nShoppers","contentgroup":"Shop","travel":"0","favourite":"0"},
{"id":"69","title":"Tantalizers, Ota","content":"Tantalizers, Ota is located at By Former Toll Gate, Abeokuta Expressway, Ota, Ogun.\r\nTantalizers offers a wide array of quality product offerings for Eat-in and Take-away. This includes sumptuous oven-baked pastries and different types of choice continental meals. Tantalizers are also tested and trusted professionals in Outdoor Catering, they relish serving clients and guests sumptuous, healthy meals at your convenience, in a stress-free manner.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Tantalizers, Ota, here are some helpful things to take along with you:\r\n\r\nMoney for the purchase of drinks and food, the ATM card is also useful in lieu of cash as the POS terminal is active.\r\n\r\nBest Features\r\nit's very easy to locate\r\n\r\nMost common visitors\r\nFood enthusiasts, the staff of companies who show up during lunch breaks, people on dates, teenagers too.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"70","title":"The Palms Shopping Mall, Ota  (Palms.)","content":"The Palms Shopping Mall, Ota is located at Gateway Hotel, Lagos - Abeokuta Express Way, Sango Ota Ogun, Nigeria., Ogun.\r\n\r\nThis was built in 2016The Palms was built to provide a world-class retail environment and set the benchmark for retail, not only in Nigeria but throughout West Africa.\r\nThe Palms shopping mall, Sango Ota, is easily accessible and strategically located at the commercial nerve of the city. It is designed to be a one-point shopping center, providing shoppers access to a wide range of local and international brands, products in contemporary and easy to navigate the environment.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nThings to do while at The Palms Shopping Mall, Ota\r\nThese are the following things you can do while you're here:\r\n\r\nShopping for groceries and other household products.\r\n\r\nBest Features\r\nThe calm and organized environment afforded to shoppers to go about their respective businesses.\r\n\r\nWriter's Review\r\nA wide range of commercial products are available here, and at considerably cheap prices too!\r\n\r\nMost common visitors\r\nShoppers.","contentgroup":"Mall","travel":"0","favourite":"0"},
{"id":"71","title":"Faith Academy, Ota","content":"Faith Academy, Ota is located at KM 10, Idiroko Ota, Canaanland., Ogun.\r\nThis was built in 1999\r\nFaith Academy boarding school was established in 1999, The first of the Faith Academy group of secondary schools. Academic excellence, spiritual prowess, and creativity is the motto of the school. The school has continued to shine bright in more than 15 years with success stories from parents and children as they work towards the development of a total child.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Faith Academy, Ota, here are some helpful things to take along with you:\r\n\r\nWriting materials, textbooks.\r\n\r\nBest Features\r\nThe cool serene environment provided for the students to learn coupled with the top quality standard of education.\r\n\r\nMost common visitors\r\nPeople from different works of life but preferably prospective students and scholars.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"72","title":"Mayflower School, Ikenne","content":"Mayflower School, Ikenne is located at Mayflower School, Ikenne, Ogun.\r\n\r\nThis was built in 1956for academic purposes.\r\nMayflower School's vision entails returning to the core values that Tai and Sheila Solarin dedicated their lives to which are honesty, hard work, self-reliance and service to humanity. Mayflower preaches a very strong educational philosophy grounded in self-reliance, self-sacrifice, public service, and physical toughness. In Solarin's words, the students must be \"rugged.\" And these methods have led to the building of many great individuals.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Mayflower School, Ikenne, here are some helpful things to take along with you:\r\n\r\nbooks and writing materials.\r\n\r\nMost common visitors\r\npupils, parents, and teachers. There are a handful of tourists who throng to the school too.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"73","title":"Oba Ademola II Maternity Hospital Abeokuta","content":"Oba Ademola II Maternity Hospital Abeokuta is located at Ake Road, Ijemo, Abeokuta, Ogun.\r\nThis was built to cater for the health needs of the state and also to ensure affordable and accessible healthcare services to women\r\nOba Ademola II Maternity Hospital Abeokuta is a government-owned Specialised Service in Abeokuta South local government area of Ogun State, Nigeria. It caters for antenatal needs, medical check-ups, and treatments.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nHands must be properly sanitized before leaving the maternity premises.\r\n\r\nThings to do while at Oba Ademola II Maternity Hospital Abeokuta\r\nThese are the following things you can do while you're here:\r\n\r\nnew patients must go through a registration process where they will be issued a card for their subsequent visits. However, registered patients must secure their cards in order to ensure a quick consultation.\r\n\r\nMost common visitors\r\nPregnant women, women who just delivered a baby, the aged, sick toddlers, and infants too","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"74","title":"Evans Pharmaceutical","content":"Evans Pharmaceutical is located at Km 32, Lagos-Badagry Expressway, Agbara Industrial Estate, Agbara, Ogun.\r\nThis was built in 1954for the purpose of ensuring Research, Development, and Manufacturing of safe and effective medicines and nutraceuticals of highest standards.\r\n\r\nManufacturing facility located at Agbara for Evans Medical Plc drug productions and testing, Evans Medical Plc is one of Nigeria’s largest Pharmaceutical Manufacturing Company, It started business in Nigeria in 1954 and has since then been committed to the health of the Nation\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nSafety boots must be worn in and around the processing area as well as the lab coat and the lab cap. Also, hands must be properly sanitized before leaving the premises.\r\n\r\nMost common visitors\r\nChemists, pharmacists, and researchers too.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"75","title":"Central Bank of Nigeria, Abeokuta  (CBN, Abeokuta)","content":"Central Bank of Nigeria, Abeokuta is located at Ibrahim Babangida Boulevard, Oke-Ilewo, Abeokuta, Ogun.\r\n\r\nThis is the sole branch of the CBN in Ogun State. It is responsible for the effective, efficient and transparent implementation of monetary and exchange rate policy and management of the Nigerian financial sector.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Central Bank of Nigeria, Abeokuta, here are some helpful things to take along with you:\r\n\r\nID Card\r\n\r\nBest Features\r\nThis is where all financial decisions concerning the country are carried out, at least in the State level.\r\n\r\nMost common visitors\r\nMerchants and representatives of financial institutions are the type of people you are sure to meet here.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"76","title":"Mr. Bigg's - Abeokuta","content":"Mr. Bigg's - Abeokuta is located at Plot No. 2, Obafemi Awolowo Way, Ibara - Abeokuta, Ogun.\r\n\r\nMr. Bigg's offers a wide array of quality product offerings for Eat-in and Take-away. This includes sumptuous oven-baked pastries and different types of choice continental meals.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"77","title":"SOS Children's Village Owu-Ijebu","content":"SOS Children's Village Owu-Ijebu is located at Odo Lewu-Isonyin-Ijebu Ode Road, Owu-Ijebu, Ogun.\r\n\r\nThe SOS Social Centre Owu-Ijebu started to operate in 2004. It provides assistance to children from families affected by HIV\/Aids by paying school fees and unsettled rents, donating cloths and foodstuff. At the same time, it focuses on family strengthening programs, counseling and medical care for families in need in cooperation with the local authorities and other NGOs.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"78","title":"Promise Hospital, Sango","content":"Promise Hospital, Sango is located at 19, Plaza Road, Sango-Ota, Ogun.\r\nPromise Medical Centre Ltd. has been in existence for more than a decade with a commitment towards the establishment of a first-class, diversified medical service; providing innovative, technology-driven services to individuals, family, and corporate patients while demonstrating a high sense of social responsibility in all their activities with specialists in all fields of medicine, makes Promise medical center a guaranteed answer to all your medical questions.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nMost common visitors\r\npatients, the aged as well as medical practitioners","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"79","title":"Kings and Queens Fast Food","content":"Kings and Queens Fast Food is located at 175, Lagos-Abeokuta Expressway, Sango-Ota, Ado-Odo\/Ota, Ogun.\r\n\r\nPreviously known as Chicken Lovers, The Eatery has been re-branded and improved with better services and quality meals. The Eatery is second to none on the Abeokuta expressway as it has been a regular stop for travelers.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Kings and Queens Fast Food, here are some helpful things to take along with you:\r\n\r\nMoney for the purchase of drinks and food, the ATM card is also useful in lieu of cash as the POS terminal is active.\r\n\r\nBest Features\r\neasy to locate\r\n\r\nMost common visitors\r\nFood enthusiasts especially chicken lovers.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"80","title":"Planet Ventures","content":"Planet Ventures is located at Idiroko Road, Ota, Sango-Ota, Ogun.\r\nNeed a gift item, silverware, packaged clothing or kitchenware? Planet ventures is a surefire fix to get your desired item. The store also sells in wholesale and retail and its highly frequented by residents of Sango Ota.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Shop","travel":"0","favourite":"0"},
{"id":"81","title":"May and Baker Nigeria Plc, Ota","content":"May and Baker Nigeria Plc, Ota is located at Km 48, Lagos-Abeokuta Exp way. Idiroko Road, Ota, Ogun.\r\nThis was built to ensure an adequate pasta production in pursuance of a strong financial base for the company.\r\nMay and Baker Ota is the Pasta producing branch of the May and Baker Nigeria group. With over 70 years in the market, May and Baker products have gone from just concentration on human pharmaceuticals and human vaccines to diversification into consumer products like table water and Pasta production. Its authenticity and reliability have continued to strengthen its hold on the market for every commodity they sell.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nMost common visitors\r\nFactory workers, food and science technologists, school children on an excursion, engineers on research","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"82","title":"Grail Centre, Abeokuta","content":"Grail Centre, Abeokuta is located at 50 Quary Road Ibara, Abeokuta, Ogun.\r\nThis was built to further expand the doctrines of the grail movement.\r\nThe Grail Movement is an organization that originated in Germany in the late 1940s, inspired by the work of Oskar Ernst Bernhardt (also known by his pen name Abd-ru-shin), principally In the Light of Truth: The Grail Message. The movement is present in over 50 countries worldwide and has a decent following in Nigeria.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nMost common visitors\r\nAdherents of the grail movement and humanists in general","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"83","title":"Slot, Abeokuta","content":"Slot, Abeokuta is located at 10 Lalubu Street, Oke-Ilewo, Abeokuta., Ogun.\r\nOver the years, Slot has been the first to announce new phones, new functions, features, and upgrades in the Nigerian society. Slot Systems made a priceless contribution in providing personal computers (PCs) in virtually every house and office in the late 90s. With the ability of its dynamic leadership in 2001 Slot switched over to mobile telecommunication services and since then it has kept the flag flying high.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nMost common visitors\r\nGadget buyers mostly","contentgroup":"Shop","travel":"0","favourite":"0"},
{"id":"84","title":"Abeokuta Railway Station","content":"Abeokuta Railway Station is located at A 5, Abeokuta, Ogun.\r\nThis was built in 1896For for easy connection between the south and northern part of the country.\r\nThis is an inter-state train station. If you plan on journeying by rail to Lagos, Port Harcourt, and other parts of the country, this is your starting point.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nMost common visitors\r\nRail travelers as well as a handful of ware sellers by the rail side.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"85","title":"Jextoban Secondary School, Ibafo","content":"Jextoban Secondary School, Ibafo is located at Ibafo, Lagos - Ibadan Expressway, Ogun State, Ogun.JEXTOBAN Secondary School, established on 9th January 1995 is a dream that came true for Pastor and Mrs E. A. Ojo, who had since 1988 been longing to positively influence the standard of education in Nigeria. Jextoban provides a very conducive CHRISTIAN learning environment with an excellent teaching faculty that enables her students to be well-balanced, highly skilled and articulate. Jextoban operates as a co-educational institution and runs a boarding house system that enhances its pastoral ideals in moral training.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Jextoban Secondary School, Ibafo, here are some helpful things to take along with you:\r\n\r\nbooks and writing materials.\r\n\r\nMost common visitors\r\nPupils, parents, and teachers","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"86","title":"PEP Stores, Sango","content":"PEP Stores, Sango is located at 16 Idi Oroko Road, Sango Ota, Ogun.\r\nPep is the largest single-brand retailer across Africa with a footprint in 11 African Countries and a vast number of stores where it often provides a lifeline to local people with affordable, good quality merchandise.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to PEP Stores, Sango, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nA Shopping List\r\n\r\nThings to do while at PEP Stores, Sango\r\nThese are the following things you can do while you're here:\r\n\r\nEnjoy a lovely time checking out what the stores have to offer and buying as you fancy\r\n\r\nBest Features\r\nPEP product offerings include Clothing, Footwear, Textiles, Homewares as well as a wide range of FMCG Products (Fast Moving Consumer Goods) for convenience shopping.\r\n\r\nWriter's Review\r\nA unique offering from PEP is its Money Back guarantee if a customer is not 100% satisfied with the purchase that was made.","contentgroup":"Shop","travel":"0","favourite":"0"},
{"id":"87","title":"Topmost College, Sagamu","content":"Topmost College, Sagamu is located at 15, Efusoju Street, Off Ayepe Road, Sagamu, Ogun.\r\nTopmost College is a co-educational institution founded on 26th October 1998 in Sagamu, Ogun State Nigeria. The college is approved by the government and also by both The West African Examination Council (WAEC) and The National Examination Council (NECO). Located in a serene environment, the college boasts of most modern learning facilities and deeply rooted in computer-based education.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"88","title":"Federal Government Science and Technical College","content":"Federal Government Science and Technical College is located at Ijebu Imushin, Ogun state, Ogun.\r\nThe Federal Government Science and Technical College Ijebu Imusin is a co-educational day and boarding, basic and post-basic institution owned by the Federal Ministry of Education. The College is located in Ijebu Imusin area of Ogun state, over the years has been in the forefront of academic excellence within the geographical region. The college has outstanding performances in various Educational, Social and Sporting activities.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Federal Government Science and Technical College, here are some helpful things to take along with you:\r\n\r\nEducational Materials\r\n\r\nStationery\r\n\r\nIdentification Card(I.D)\r\n\r\nHousing Essentials - If you're a student\r\n\r\nBest Features\r\nThe operative curriculum is diversified and geared towards meeting the needs of every learner’s aptitude and ability as well as the developmental needs of the country. Their alumni are found all over the globe, excelling, competing and contributing to the development of Nigeria.\r\n\r\nWriter's Review\r\nExcelling in both academic and co-curricular competitions, it is a serene learning environment with highly qualified staff to give the students the good education needed for a sound all-round development.\r\n\r\nMost common visitors\r\nStudents, Parents, and Teachers","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"89","title":"Federal Government Girls College Sagamu","content":"Federal Government Girls College Sagamu is located at Off Sagamu-Benin expressway, Sagamu, Ogun State, Ogun.\r\n\r\nFederal Government Girls College Sagamu is a Nigerian girl's institution. It is located in sagamu Ogun State, which is in the southwestern region of Nigeria, West Africa. It is considered within its peer group as a model secondary school for girls from all over the country. The college was founded in 1978, The college strives to maintain a fine balance between high academic standards, and encouraging the personal development of the individuals, through interaction with others and through their participation in a wide range of extracurricular activities including the Annual House Festival of Arts and Inter-House Sports Games.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Federal Government Girls College Sagamu, here are some helpful things to take along with you:\r\n\r\nEducational Materials\r\n\r\nStationery\r\n\r\nIdentification Card(I.D)\r\n\r\nHousing Essentials - If you're a student\r\n\r\nThings to do while at Federal Government Girls College Sagamu\r\nThese are the following things you can do while you're here:\r\n\r\nVisit the Students if you're a parent or guardian\r\n\r\nStudy\r\n\r\nBest Features\r\nThe operative curriculum is diversified and geared towards meeting the needs of every learner’s aptitude and ability as well as the developmental needs of the country. Their alumni are found all over the globe, excelling, competing and contributing to the development of Nigeria.\r\n\r\nWriter's Review\r\nExcelling in both academic and co-curricular competitions, it is a serene learning environment with highly qualified staff to give the students the good education needed for a sound all-round development.\r\n\r\nMost common visitors\r\nStudents, Teachers, and Parents","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"90","title":"The Federal Government College, Odogbolu","content":"The Federal Government College, Odogbolu is located at Odogbolu, Odogbolu LGA, Ogun State, Ogun.\r\nThe Federal Government College, Odogbolu was established on the 25th of January 1973, The college is situated in Odogbolu Town, by the Sagamu\/Benin Express Way, mid-way between Sagamu and Ijebu-Ode. Odogbolu is the Headquarter of Odogbolu Local Government Area. The College is accessible at all seasons from two major routes: Ikenne Road and the Expressway. The College spans over an area of 557.5 acres. The College took off on a temporary site, and students were moved from one part of Odogbolu to another for lectures. The college finally moved to its permanent site in 1977.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to The Federal Government College, Odogbolu, here are some helpful things to take along with you:\r\n\r\nEducational Materials\r\n\r\nStationery\r\n\r\nIdentification Card(I.D)\r\n\r\nHousing Essentials - If you're a student\r\n\r\nThings to do while at The Federal Government College, Odogbolu\r\nThese are the following things you can do while you're here:\r\n\r\nVisit the Students if you're a parent or guardian\r\n\r\nStudy\r\n\r\nBest Features\r\nThe college operates day and boarding systems. The operative curriculum is diversified and geared towards meeting the needs of every learner’s aptitude and ability as well as the developmental needs of the country. Their alumni are found all over the globe, excelling, competing and contributing to the development of Nigeria.\r\n\r\nWriter's Review\r\nThis is a quality secondary school proven to provide the best in terms of secondary education and discipline. It is the only co-ed federal college in Ogun State.\r\n\r\nMost common visitors\r\nParents, Students, Teachers","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"91","title":"Allover Central Polytechnic","content":"Allover Central Polytechnic is located at Allover Road, Ota, Nigeria, Ogun.\r\nAllover Central Polytechnic came into being at the time when the Federal Government of Nigeria was trying to liberalize education, taking a special interest in technological education. This policy is based on the fact that technological education is the basis of economic and social transformation. Allover Central Polytechnic currently has nine departments which are: Business Administration and Management, Accountancy, Computer Science, Computer Engineering, Electrical \/Electronic Engineering, Estate Management, Statistics, Urban and Regional Planning, Criminology and Legal Studies.\r\n\r\n\r\nSafety\r\nAllover Central Polytechnic is very safe. But visitors are advised not to keep late hours.\r\n\r\nThings To Do\r\n\r\nAllover Central Polytechnic is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nThe academic policy of Allover Central Polytechnic is to ensure consistency in the academic calendar in order to ensure that students achieve high level of professional training and expertise.\r\n\r\nBest Time to Visit Allover Central Polytechnic\r\n\r\nAllover Central Polytechnic is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Allover Central Polytechnic\r\n\r\nMatriculation and Convocation. They both happen yearly. Matriculation is one of the popular events in school for freshers because that's when they get to wear and snap long living memory pictures and the get to celebrate they been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in Allover Central Polytechnic are the students and the lecturer's friends and family. Also, researchers visit.\r\n\r\nWeather at Allover Central Polytechnic\r\n\r\nAllover Central Polytechnic is located in the South-West part of Nigeria. This region has just two seasons which is the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan come along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"92","title":"Gateway Polytechnic, Saapade  (GAPOSA)","content":"Gateway Polytechnic, Saapade is located at Ishara, Nigeria, Ogun.\r\n\r\nGateway Polytechnic is a State-Government owned tertiary institution located at, Saapade, Ogun State, Nigeria. It currently has two faculties which are: School of Science and Technology and Management and Liberal Studies. These two faculties are further divided into various departments. Currently, Gateway Polytechnic has fifteen departments.\r\nSafety\r\n\r\nGateway Polytechnic Saapade is very safe. But visitors are advised not to keep late hours.\r\n\r\nThings To Do\r\n\r\nGateway Polytechnic, Saapade is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nGateway Polytechnic, Saapade aims to promote ICT as an instrument of mass education, provide ICT driven quality education and to empower the individual to be competent and reasonable citizens who value education as a life-long process.\r\n\r\nBest Time to Visit Gateway Polytechnic, Saapade\r\n\r\nGateway Polytechnic, Saapade is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Gateway Polytechnic, Saapade\r\nThe most popular events in school are Matriculation and Convocation which comes up yearly. Matriculation is one of the popular events in school for freshers because that's when they get to wear and snap long living memory pictures and the get to celebrate their been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in Gateway Polytechnic, Saapade are the students and the lecturer's friends and family. Also, researchers visits.\r\n\r\nWhy You Should Visit\r\n\r\nGateway ICT Polytechnic, Saapade, a fully-fledged government-owned tertiary institution in Remo Zone. It has received some notable awards over the years which are; Best Instructor Award of CISCO 2008, Best Student Award of CISCO in Africa 2009, Best Communicating Academy Award 2009, Best Success Story Award CISCO 2009, Best Communicating Academy Award 2010, Best Local Academy Award CISCO 2010.\r\n\r\nWeather at Gateway Polytechnic, Saapade\r\n\r\nGateway Polytechnic, Saapade is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season.The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"93","title":"Nigeria Agricultural Quarantine Service  (NAQS)","content":"Nigeria Agricultural Quarantine Service is located at FAAN Complex, Opposite Murtala Mohammed Airport Terminal 2, Ikeja Lagos, Ogun\r\n\r\nThe Nigeria Agricultural Quarantine Service is divided into the Animal veterinary arm which performs health inspections of live animals for both import and export, authenticates international veterinary certificate accompanying imported animals and their products and other preventive functions. There is also a Plant arm that seeks to protect cultivated crops and natural flora from destructive foreign plant pests. It also ensures that agricultural exports meet international standards set by IPPC and WTO\/SPS Agreement and specific requirements of countries importing plants and plant products from Nigeria.\r\n\r\nSafety\r\nThe NAQS is located in a very safe place, there is not a threat to security here.\r\n\r\nBest Time to Visit The Nigeria Agricultural Quarantine Service\r\nIt is best to Visit NAQS during working hours when corporate activities take place.  \r\n\r\nMost Common Visitors\r\nStaff, researchers, and government officials are the most common visitors to the Quarantine service offices.\r\n\r\nWeather at The Nigeria Agricultural Quarantine Service\r\nNigeria Agricultural Quarantine Service is located at the South-West part of Nigeria. This region has just two seasons which is the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan come along.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"94","title":"Abraham Adesanya Polytechnic  (AAPoly)","content":"Abraham Adesanya Polytechnic is located at Atikori, Ijebu ode Ogun state, Ogun.\r\n\r\nAbraham Adesanya Polytechnic is a State-Government owned tertiary institution located at Ijebu Igbo, Ogun State, Nigeria. It currently has five faculties which are: School of Management and Business Studies, School of Management and Business Studies, School of Science, School of Engineering and Directorate of General Studies.\r\n\r\nSafety\r\nAbraham Adesanya Polytechnic is very safe. But visitors are advised not to keep late hours.\r\n\r\nThings To Do\r\n\r\nAbraham Adesanya Polytechnic is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\nAbraham Adesanya Polytechnic wants to promote the advancement of knowledge and its practical application to the need of the community, through teaching, research and other means.\r\n\r\nBest Time to Visit Abraham Adesanya Polytechnic\r\n\r\nAbraham Adesanya Polytechnic is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Abraham Adesanya Polytechnic\r\n\r\nConvocation and Matriculation is a yearly event that is held for both incoming and outgoing students. Matriculation is one of the popular events in school for freshers because that's when they get to wear and snap long living memory pictures and the get to celebrate they been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\nMost common visitors in Abraham Adesanya Polytechnic are the student's and lecturer's friends and family. Also, researchers to visits.\r\nWhy You Should Visit\r\nWeather at Abraham Adesanya Polytechnic\r\n\r\nAbraham Adesanya Polytechnic is located in the South-West part of Nigeria. This region has just two season which is the dry and rainy season.The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan come along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"95","title":"Federal Polytechnic, Ilaro","content":"Federal Polytechnic, Ilaro is located at Ilaro, Nigeria, Ogun.\r\n\r\nFederal Polytechnic, Ilaro is a Federal-Government owned tertiary institution located at Illaro,Ogun State, Nigeria. It currently has five faculties which are: School of Engineering, School of Environmental Studies, School of Communication and Information Technology, School of Management Studies and School of Pure and Applied Sciences.\r\n\r\nSafety\r\n\r\nFederal Polytechnic, Ilaro is very safe. But visitors are advised not to keep late hours.\r\n\r\nThings To Do\r\n\r\nFederal Polytechnic, Ilaro is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nFederal Polytechnic, Ilaro wants to provide opportunities of qualitative technical education in a serene and conducive learning environment to all eligible Nigerian who would drive the national industrial economy.\r\n\r\nBest Time to Visit Federal Polytechnic, Ilaro\r\n\r\nFederal Polytechnic, Ilaro is best visited during when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Federal Polytechnic, Ilaro\r\n\r\nThe most popular events in the school are Matriculation and Convocation which comes up yearly. Matriculation is one of the popular events in school for freshers because that's when they get to wear and snap long living memory pictures and the get to celebrate their being in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and their is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in Federal Polytechnic, Ilaro are the student's and lecturer's friends and family. Also, researchers visit.\r\n\r\nWhy You Should Visit\r\n\r\nAlways a strict and well-disciplined school\r\n\r\nWeather at Federal Polytechnic, Ilaro\r\n\r\nFederal Polytechnic, Ilaro is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan come along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"96","title":"Ogun State College of Health Technology  (OSCOHTECH ILESE)","content":"Ogun State College of Health Technology is located at Old Ondo-Bennin Road, Ijebu-Ode, Nigeria, Ogun.\r\n\r\nOgun State College of Health Technology is a State-Government owned tertiary institution located at, Ilese-Ijebu, Ogun State, Nigeria. It currently has seven departments which are; Public Health, School of Public Health, Environmental Health, Community Health, Pharmacy and Med. Diagnostic Science, Health Information Management and Dental Health Sciences.\r\n\r\nSafety\r\n\r\nFederal Polytechnic, Ilaro is very safe. But visitors are advised not to keep late hours.\r\n\r\nThings To Do\r\n\r\nFederal Polytechnic, Ilaro is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nOgun State College of Health Technology aims to create, preserve and communicate knowledge in Health Science, Technology, behavioural and Management Sciences.\r\n\r\nBest Time to Visit Ogun State College of Health Technology\r\n\r\nFederal Polytechnic, Ilaro is best visited when it's in session as it's when the school is lively and alive.\r\nPopular Events at Ogun State College of Health Technology\r\nThe most popular events in school are Matriculation and Convocation which comes up yearly. Matriculation is one of the popular events in school for freshers because that's when they get to wear and snap long living memory pictures and the get to celebrate their been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in Ogun State College of Health Technology are the student's and lecturer's friends and family. Also, researchers visit.\r\n\r\nWhy You Should Visit\r\n\r\nProducing community health officers and many other related.\r\n\r\nWeather at Ogun State College of Health Technology\r\n\r\nOgun State College of Health Technology is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"97","title":"National Emergency Management Agency  (NEMA)","content":"National Emergency Management Agency is located at Powa Market, 57 Mobolaji Bank Anthony Way, Ikeja, Ogun.\r\n\r\nNational Emergency Management Agency is located at Powa Market, 57 Mobolaji Bank Anthony Way, Ikeja. Its function includes tackling disaster in the country. The agency is charged with being prepared to provide a swift response to disasters whenever and wherever they might occur.\r\n\r\nSafety\r\nNEMA is relatively safe.\r\n\r\nThings To Do\r\nReport any case of an imminent disaster or a disaster that has already occurred. Also, see case files of the Agency when there for sight-seeing.  \r\n\r\nBest Time to Visit the National Emergency Management Agency\r\nThe best time to visit NEMA is during working hours when emergencies will be appropriately attended to.\r\n\r\nMost Common Visitors\r\nThe most common visitors are government officials, people who have come to report one emergency or the other.\r\n\r\nWhy You Should Visit\r\nTo report emergency cases and make sure it is resolved by NEMA appropriately.\r\n\r\nWeather at The National Emergency Management Agency\r\nNational Emergency Management Agency is located in the South-West part of Nigeria. This region has two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"98","title":"Orona statue","content":"The shrine is located at ilaro, it was named after a great warrior who defended the town and the people from the intertribal wars that was ravaging the Yoruba kingdom of old. During his lifetime, no enemy dare challenge Ilaro to war. There was much peace all around. Oronna pledge that even in death, he should be called up to defend the town of Ilaro with appropriate sacrifices at his shrine.\r\n\r\nThe point through which he disappeared into the earth, leaving the tail of the long chain tied to his waist is still there up till now.\r\n\r\nHistory had it that anytime there was a threat of war, the legendary Oronna would be called upon and he would emerge from the earth and drive away such invaders.\r\n\r\nHe continually do this until when a false call was made to him, on detecting this, he became furious and invoked a thick smoke at the spot where he went underground again, leaving behind on the surface a measure of his waist chain at the shrine. The spot is now used for installation of new kings (OLU) after the traditional three months Ipebi. Oronna has since then became a deity of Ilaro people.\r\n\r\nOronna festival is celebrated by the people of Ilaro. Oronna was believed to be a brave and strong warrior who fought for the people of Ilaro during the inter-tribal war in the olden days. The people of Ilaro celebrated Oronna festival every November.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"99","title":"Madam Tinubu Shrine","content":"This shrine was built in respect of the first female high chief in all of Yoruba Land. She, the Iyalode of Egba land is still regarded as one of the richest women in African history till date. Born Efunporoye Osuntinubu, she lived from 1810 – 1887 and in that time, she traded in Arms and supplied Abeokuta warriors with arms necessary to win their war with the Dahomey people.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"100","title":"Palace of the Olowu of Owu","content":"Although the Owu people are originally from Oyo, they migrated to Abeokuta ad made it their ancestral home. The Palace of the Olowu of Owu is a monument that holds so many historical artefacts and relics of past Olowus.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"101","title":"Yemoji Natural Swimming Pool","content":"This swimming pool is located in the Yemoji Tourist Centre which is situated a few kilometres from Ijebu Ode Township. The pool is a very refreshing place to take a dip after a long day. It is one of nature’s wonders that are situated in Ogun State.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"102","title":"Iwopin Boat Regatta","content":"Some festivals are celebrated at this boat regatta. It is an interesting spot to visit and take boat rides. It is located at Iwopin, Ogun Waterside, Ogun State.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"103","title":"Celia’s Suites: Hotel in Abeokuta","content":"Featuring free wifi, a restaurant and a barbecue. Celia’s suites offers accomodaton in Abeokuta. The hotel has a hot spring bath and fitness centre, and guests can enjoy a drink at the bar. Avg.price\/night: N13,500.","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"104","title":"Park Inn by Radisson Abeokuta","content":"Park inn by Radisson offers accommodation in abeokuta. Each room at the hotel is airconditioned and is equipped with a flat screen TV. Avg,price\/night: N41,577.","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"105","title":"IBD international hotel Abeokuta","content":"IBD International Hotel is a high-class hotel found at 10, Phayi Ijado Odundimun Street, M.K.O. Abiola Way, Leme, Abeokuta, Ogun, Nigeria. It is located in a serene environment and gives guests a unique lodging experience. Categories of rooms at IBD International Hotel include the Standard, Deluxe, Executive and Presidential. These rooms are uniquely designed with wall arts and feature modern amenities such as full air-conditioning, a fridge, a telephone and an en-suite bathroom. IBD International Hotel has made a couple of awesome facilities available to its guests to ensure maximum comfortability. These facilities include: free Wi-Fi, 24 hours power supply, a swimming pool, free and adequate parking space, a fitness centre\/gym for guests to engage in workout sessions, a restaurant that serves a wide range of delicacies from which guests can order from, and a bar that is well-stocked with both alcoholic and non-alcoholic drinks. Security is top notch at the hotel. A couple of additional services like laundry\/dry cleaning, 24-hour room service and airport shuttle are also available. AVG PRICE\/NIGHT:N28875","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"106","title":"Havillah Cottage: Hotel in Ilishan","content":"Havillah cottage in Ilishan provides accommodation with a shared lounge, a garden and a terrace. Featuring a restaurant, this 3-star hotel has air conditioned rooms with a private bathroom. Avg.prive\/night: N9700","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"107","title":"Conference hotel and suites Sagamu","content":"Conference hotel and suites Sagamu has a restaurant, bar, a shared lounge and garden in sagamu. The 4-star hotel has air-conditioned rooms with a private bathroom and free wifi. Avg.price\/night: N22,500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"108","title":"Ceasars court hotel and suites Abeokuta","content":"Ceasars Court Hotel and Suites is an architectural masterpiece and epitome of hospitality in the ancient city of Abeokuta. This 3-Star hotel is situated at 7, Koye Majekodunmi Street, Abeokuta, Nigeria in a serene environment. It is well suited for leisure and business travellers. Guests can make their selection from several rooms in 3 categories – Standard, Deluxe and Presidential Suites. While some rooms could offer extra comfort based on category, all rooms feature air conditioners, reading tables, sofas, an intercom system, refrigerators, king-sized beds and en-suite bathrooms fitted with bathtubs. All guests are entitled to complimentary breakfast. Modern facilities are put in place to ensure maximum comfort. These include an outdoor swimming pool, a gym, ample parking space, Wi-Fi internet access, event hall, round-the-clock security supported by CCTV cameras, an on-site bar, and a restaurant where local, Chinese and Continental cuisines can be accessed. Ceasars Court Hotel offers additional services to guests on request such as room service, laundry\/dry cleaning and ironing services. AVG PRICE\/NIGHT:N18000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"109","title":"Upright hotel Abeokuta","content":"The Upright Hotel is located at No 14\/18 Demola Olanrewaju street, Agbeloba roundabout, off Quarry Road, Abeokuta, Ogun State. The Upright Hotel showcases rooms grouped into the categories of Classic, Executive, Classic Plus, Corporate, Royale, Executive Suite, Classic Plus, Corporate, Royale, Executive Suite, Classic Plus, and the Diplomatic Suite. These rooms feature facilities such as refrigerators, flat-screen television stations, air conditioning, work desks and chairs, private bathrooms with shower facilities, king-size beds, bedside drawers and premium sized mirrors. An array of hotel facilities are made available to guests at the Upright Hotel and these include a well-designed meeting room, a standard gym with an instructor, a restaurant with a menu of expertly prepared dishes plus complimentary breakfast and dining facilities, outdoor pool, event hall designed to host a wide variety of events, laundry services plus a well-stocked bar\/lounge. AVG PRICE\/NIGHT:N8500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"110","title":"Green legacy resort Abeokuta","content":"The Green Legacy Resort is located near the Olusegun Obasanjo Presidential Library complex along the Presidential Boulevard Way, NNPC Bus stop, Oke Mosa, Abeokuta, Ogun state. This luxurious 4-Star resort offers breathtaking scenery with world-class facilities over a large expanse of land; it is ideal for both business and pleasure.\r\nThe Green Legacy Resort boasts over 100 rooms that come in the categories of Standard rooms, Deluxe, Superior Double, Easter package, Family Connecting room, Standard Suite, Diplomatic Suite, and the Ambassadorial Suite. Each of these rooms comes with excellent facilities which include luxurious king-size beds, intercom system, air conditioning, sofa and center table, study desk and chair, wireless internet access, flat-screen television set with access to a plethora of local and international television channels, en-suite bathroom with state-of-the-art bathtub and shower facilities, hairdryer and refrigerator. The Green Legacy Resort offers a wide variety of top-class hospitality facilities which include grand outdoor pools, a bar stocked with the finest wines and spirits with an ultra-comfortable lounge, a restaurant that offers diverse exotic cuisines from the local and intercontinental spheres with the additional service of daily complimentary breakfast, top-class security arrangements supplemented by the use of surveillance cameras and well-trained security personnel, round-the-clock electric power supply, adequate car parking spaces, excellent fitness facilities complemented by a well-equipped standard gym, event hosting facilities, and a tastefully furnished conference room. The Green Legacy Resort also provides guests with a multitude of awesome services such as spa and sauna services, beauty salon, luggage storage, business centre, dry cleaning, and lawn tennis facilities. AVG PRICE\/NIGHT:N30000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"111","title":"Maria E guest Inn Abeokuta","content":"Maria E Guest Inn is a budget hotel situated at 12, Wole Ogundimu Street, Amolaso, Ibara, Abeokuta, Nigeria. It is renowned for its exquisite facilities as well as impeccable hospitality services offered consistently to customers. Located within a distance of about 3.1km from the famous Centenary Hall, Maria E Guest Inn provides a perfectly tranquil environment for a memorable lodging experience. Maria E Guest Inn offers exquisite selections of Classic, Executive and Royal Executive Suites to cater for all preferences and guarantee a comfortable lodging experience. All en-suite rooms are well-furnished with cable flat-screen TV sets, air-conditioners, fans, intercom telephones, reading tables and refrigerators. Guests are treated to a complimentary breakfast with buffet and menu options on a daily basis. Facilities at Maria E Guest Inn include a gourmet restaurant, an exotic bar and adequate parking space. Guests are also offered supplementary services such as laundry services and 24-hour room service.  AVG PRICE\/NIGHT: N7500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"112","title":"Richton hotel and suites Abeokuta","content":"Welcome to Richton Hotel and Suites. Our hotel is a very big and luxurious hotel with the right facilities and amenities that guests would love. Our hotel is a very nice and comfortable place to stay in. We have a set of wonderful staffs that are friendly and eager to please our guests. Our hotel is also very convenient and in a very good location. We offer guests a good service and a great place to stay in. Book a room with us soon. Richton Hotel and Suites is a budget hotel in Abeokuta, Ogun. AVG PRICE\/NIGHT: N13000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"113","title":"House 56 hotel and suite Abeokuta","content":"Located in a serene and quiet environment in the beautiful city of Abeokuta known for its historical and cultural heritage, House 56 offers excellent customer service and sits at 2, Ope Kujore Street, Obasanjo Hilltop Extension, Abeokuta, Ogun State, Nigeria. It has exquisitely designed rooms that are categorised into Executive, Deluxe and Premium Executive Rooms. Each room features air-conditioning units, cable TV, king-size bed, a telephoning system, wardrobe and an en-suite bathroom with a shower. House 56 Hotel offers a complimentary breakfast. The swimming pool is accessible for guests who would like to enjoy a relaxing dip; the on-site restaurant serves a wide menu option of exquisite meals and the bar is available for guests to enjoy a variety of alcoholic and non-alcoholic drinks and light snacks while relaxing at the lounge. Free Parking is available within the complex which is always guarded by security personnel. A meeting facility is available for various kinds of seminars and meetings. Laundry\/dry cleaning services are made available on request.  AVG PRICE\/NIGHT: N15750","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"114","title":"Rock city hotel Abeokuta","content":"Rockcity  Hotel is located in the city of Abeokuta, Ogun State. The hotel is suitable for business and leisure. The room facilities include free Wifi, air conditioner, TV with satellite channels. Guests can order for drinks at the bar. The restaurant serves African and continental dishes. Rock City Hotel is an affordable hotel in Abeokuta, Ogun. AVG PRICE\/NIGHT: N5200","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"115","title":"Pacific hotels and suites Alakuko","content":"Located at 105, Baale Animashaun Road, Dalemo B\/Stop, Alakuko, Lagos, Nigeria, Pacific Hotel and Suites 2 is an exquisite budget hotel furnished in a way to make guests feel at home. It is a brand that stands out for its quality service delivery in guests' treatment.\r\nRooms available at Pacific Hotel and Suites 2 are of varying categories. These categories include Standard, Deluxe Room, Mini and Executive Suite. These rooms are uniquely furnished with king-sized beds, work tables and chairs, air-conditioning, cable enabled TV sets and en-suite bathrooms.\r\nAt Pacific Hotel and Suites 2, a number of facilities have been put in place to fully satisfy the needs of its guests. These facilities include free Wi-Fi, 24-hour electricity, on-site restaurant and bar\/lounge. Guests can order from a list of meals and enjoy drinks, both alcoholic and non-alcoholic, from the bar.\r\nPacific Hotel and Suites 2 offers additional services on requests. These services are laundry\/dry cleaning services, 24-hour Room service, conference hall\/facilities and an on-site parking space guarded by security personnel round-the-clock. AVG PRICE\/NIGHT:N8000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"116","title":"Mokland hotels Ota","content":"Mokland Hotels Limited is a modern and affordable hotel suitable for business and leisure travellers. It offers clean, comfortable and spacious rooms to the satisfaction of guests. It is nestled in a serene environment at Ilo Awela road, off Sango-Toll Gate, Ogun, Nigeria which is a 2-minute drive from Shoprite. Mokland Hotels is acknowledged to be one of the biggest in size throughout Ogun State. Each room comes fitted with cubicle bathroom, water heater, intercom system, fridge, Wi-Fi Internet access, flat-screen LCD TV with international and local stations, air conditioners, safety deposit boxes, reading table and chair. Some rooms also come with a balcony city view and a VIP Guest room. The rooms are divided into categories: Super Double, Presidential Suite, Executive room, Executive Double, Deluxe Suite and Deluxe room. Adequate facilities are provided for by Mokland Hotels, like an outdoor pool ideal for total relaxation and a spa facility. Also available is the fitness centre which consists of a sauna, steam bath and a well-equipped gymnasium. The 24 hours restaurant offers a combination of fine, local freshly cooked meals with an abundance of liqueur, cocktail drinks, spirits, exotic wines and palm wine from the bar. Mokland Hotels provides excellent event facilities like projector and sound equipment. Other additional services include: adequate parking space, 24 hours electricity, laundry and dry cleaning services.  AVG PRICE\/NIGHT:N6500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"117","title":"PMC prestige hotels Ota","content":"PMC Prestige hotel is a budget hotel located at Km 8 Idiroko Road, Ado-Odo, Ota, Ogun State, Nigeria. It is centrally situated with convenient access to the prime business nodes in Abeokuta. \r\nPMC Prestige hotel has uniquely designed and furnished rooms that are of different categories. Categories of rooms available in this hotel are the Standard Rooms, Deluxe Rooms, Executive Rooms, Royal Suites and Presidential Suites. These rooms have air-conditioners with TV sets, big and comfortable bed, bedside cabinets, a bedside lamp, wardrobe, refrigerator and en-suite bathrooms. A couple of facilities have been put in place at PMC Prestige hotel to adequately satisfy the needs of guests. These facilities include free Wi-Fi, 24-hour front desk service, restaurant and bar\/lounge where guests can select from a variety of local and continental meals while sipping from a glass of alcoholic or non-alcoholic drinks, 24-hour power supply and an adequate parking space. It offers additional services to its guests, such as 24-hours housekeeping\/room services, car hire, medical services, concierge, meeting rooms and an event hall. At PMC Prestige hotel security personnel are available to ensure the safety of its guests. AVG PRICE\/NIGHT:N5250","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"118","title":"Grand-bank link hotels Bell Ota","content":"Boasting contemporary luxury styling and high-quality personnel, Grand-Bank Link Hotel is located in Ota, the third-largest concentration of industries in Nigeria. It is situated at Km 9, Idiroko Road, Ota, Ogun State, Nigeria.\r\nRooms at the hotel are in varying categories. These categories are Standard, Deluxe and Executive Rooms. Each room is designated non-smoking areas and it's fitted with modern in-room equipment such as air-conditioning, a flat-screen TV, a well-polished work table and an en-suite bathroom.\r\nGrand-Bank Link Hotel has a couple of facilities, which include: 24 hours electricity, free Wi-Fi, swimming pool, a fitness centre\/gym, free ample parking space, a restaurant that serves a variety of delicacies and a bar where guests can order from a list of both alcoholic and non-alcoholic beverages. The on-site restaurant serves breakfast, lunch and dinner at a surcharge. The premises is guarded by security personnel to ensure the safety of guests and their properties. It also has event facilities. Grand-Bank Link Hotels offers additional services to its guests on request including laundry\/dry cleaning services, 24 hours room service, ironing and concierge service.","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"119","title":"Cityhill international hotel OTA","content":"City Hill International Hotel with its friendly, courteous and helpful staff offers budget and comfortable accommodations to guests at KM 7 Idiroko road, Iyesi, Ota in Ogun State, Nigeria. This affordable hotel with good facilities offers a serene and relaxing environment for its guests. Cityhill International Hotel offers two categories of room and 3 types of suites namely: Single Standard, Double Standard, Studio Suite, Royal Suite and King Suite. Each room is furnished and fitted with a refrigerator, intercom system, cooling system, bedside table, work desk and table, television, king-size bed, sofa and a private bathroom. The on-site restaurant and bar\/lounge provides a variety of dishes and drinks for the comfort of guests.\r\nCityhill International Hotel has a private parking space, 24 hours security and electricity. AVG PRICE\/NIGHT:N7500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"120","title":"Leksokky Hotel and Suites","content":"Leksokky Hotel and Suites provides free WiFi and rooms with air conditioning in Ijoko. Offering a restaurant, the property also has a bar. The accommodation offers a 24-hour front desk and room service for guests.\r\nAt the hotel, every room has a desk. The private bathroom is equipped with a shower. The rooms in Leksokky Hotel and Suites are fitted with a flat-screen TV and free toiletries.\r\nWe speak your language! AVG PRICE\/NIGHT:N7500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"121","title":"Bezer Hall and Hotel","content":"Km 37 Lagos - Abeokuta Expressway Adalemo\r\nSituated close to Covenant and Bells University respectively, BEZER HALL AND HOTEL is sited at Km 37 Lagos - Abeokuta Expressway Adalemo, Ota, Ogun state. This hotel offers guests modern and comfortable accommodation. \r\nEvery room is furnished with an air conditioner, refrigerator, flat-screen TV with cable connection, work desk, in-room safe, sofa, king-sized bed, and tea\/coffee maker. The ensuite bathroom is equipped with a bathtub\/Jacuzzi and complimentary toiletries. The hotel rooms are categorized into standard, deluxe and twin rooms.\r\n\r\nThe restaurant serves local and international cuisines, there is an option of room service. The bar is well stocked with varieties of beverages. This hotel is equipped with an ultra-modern event hall and conference center.\r\n\r\nDry cleaning, airport pickup, car hire, and concierge are additional services available at a surcharge fee. Onsite parking space is ample. The premises are guarded by highly trained security men and CCTV cameras are installed at strategic positions to ensure maximum security.\r\n\r\nOther Terms and Conditions\r\nCheck-In- 14:00 pm (ID Required)\r\nCheck Out- 12:00 pm\r\nPayments- cash, visa and master card\r\nChildren- kids are welcome to stay at no extra cost.\r\nBezer Hall and Hotel is hotel in Ota, Ogun.\r\nAVG PRICE\/NIGHT:N7500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"122","title":"Sifaz Hotel and Suites","content":"1, Orowadayo Close, Owode Ijako, Ogun State. AVG PRICE\/NIGHT:N5250","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"123","title":"OSOUSI FESTIVAL, AGO IWOYE","content":"Osousi festival is celebrated amongst the people of Ikija and Ago-iwoye in Ogun state, Western Nigeria. It is believed that the festival first began thousands of years ago in Ejigbo Ile ife in osun state, and as the pioneers of the festival migrated to the present-day Ogun state, they continued holding the festival yearly.\r\n\r\nThe Osuosi festival centers around a powerful warlord, called Oso, whom during his lifetime, was known to be an avenger for the oppressed, he fought and won several wars both for his community and for people of other communities, he was very famous and loved by all.\r\n\r\nOn the conquest of a particular kingdom, whose warriors were known to be very powerful as well, Oso became even more popular amongst kingdoms and was nicknamed Osogbusi (abbreviated as            Osousi) which means Oso conquered or Oso the conqueror. After his death, the people deified him, carved out a wooden image of his replica, and started worshiping him as a deity and held the Osousi festival yearly in celebration of his good deeds.\r\n\r\nThe festival is a fourteen (14) daylong event, consisting of many different activities of rites, rituals, which include the killing of goats, fowls, incantations, divination, visits to the stream(In honor of one of his many wives- Oluweri, who was also deified as the goddess of the river), soothsaying, praise-singing, evocations etc.\r\n\r\nThese activities then culminate in celebrations where certain kinds of foods like Ikokoreolori (local yam pasta cooked with sheer butter), Boiled maize and coconut, Akara (Bean cake) are served, and finally, the two dances that emanated from and are particular to the Osousi festival are performed.\r\n\r\nThey are the Ijootun and Yengbe dance","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"124","title":"OJUDE –OBA FESTIVAL, IJEBU- ODE","content":"The Ojude-Oba festival is known to the Ijebus as a major festival that brings them together.\r\n\r\nThe native age grades (Regberegbe) converge at the Awujale’s palace to pay homage to the Royal Majesty, the Awujale of Ijebuland and to seek the peace and progress of Ijebuland.\r\n\r\nThe festival is celebrated on the 3rd day after Id-El-Kabir. Ojude Oba festival is celebrated amidst pomp and pageantry.\r\n\r\nIt attracts all Ijebus both at home and abroad. International tourists do come to witness the colorful festival that entails booming of guns and horse riding by the Balogun's and Olorogu.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"125","title":"EGUNGUN FESTIVAL, OTA","content":"The history of Egungun is traceable to the then Alaafin Sango in the old Oyo Empire. Basically, Alaafin Sango did not want to lose contact with his dead maternal lineage in Tapa land when he became the Alaafin.\r\n\r\nThe thought of symbolic representation of the dead via a social costumed dressing to protect the identities of the people from his mother’s Tapa home came to him. This Egungun was adopted by various Yoruba sub-ethnic groups as an avenue to communicate with the spirit of their dead ones.\r\n\r\nThe Aworis see the Egungun as their deity and as such worship Egungun. Women are not allowed to put on the Egungun regalia although they constitute an important aspect of the Egungun group preparing the celebration of Egungun festivals.\r\n\r\nThey sing, clap and chorus the traditional songs. The women constitute a formidable team in the group. They are Iya agba oje. The elders of the ‘Oje’ while the young ones are known as Ode-Oje (The youthful Oje). Oloponda is the traditional head of all Egunguns in Ota.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"126","title":"ORONNA DAY FESTIVAL, ILARO","content":"The strength of a community lies in its heritage, thus the need to preserve and sustain; the people of the ancient city of Ilaro in Yewaland, in their resolve not to neglect what makes up the very fabric of their society, created this one of a kind festival–Oronna festival. Oronna was the mythological hero of Ilaro who distinguished himself in battles against the Dahomeans who were a scourge to the area. He promised that even after his death if any war should come against Ilaro, his people should call him at his shrine, where he is said to have disappeared in the earth leaving a long chain tied around his waist.\r\n\r\nOronna Ilaro Festival is an annual festival primarily conceived to preserve, uphold and celebrate the rich cultural heritage of Ilaro.\r\n\r\nThis socio cultural festival whose cultural antecedence has placed Ilaro on the map of the world. It was officially inaugurated in1992. Another vision is to bring together annually all the sons and daughters of Ilaro within and outside the Diaspora with a view to reminding and instilling in them the spirit of brotherhood and having a sense of belonging towards promoting the rich cultural heritage of Ilaro land.\r\n\r\nOn May 24, 1992 when the first Oronna day central planning committee was inaugurated it was headed by the late Prof. Afolabi Olabuntan highly referred scholar and elder statesman.\r\n\r\nThis committee was also saddled with the mandate to make Ilaro and Yewa land the most secure and conducive community in the whole country in terms of infrastructure, social amenities, enabling business environment and human resources.\r\n\r\nOronna Ilaro festival is a week-long program, featuring all aspects of Ilaro culture, traditional and social life. As a mark of communal bond that was established two (2) decades ago, the descendants of Ilaro will gather again all over the world to celebrate one of the largest cultural festivals in the southwest region of Nigeria.\r\n\r\nOver the years, this festival in its unique colors and splendors has drawn thousands of sons and daughters of Ilaro. Traditional cultural enthusiasts and international tourists from both inside and outside the country.\r\n\r\nOronna Ilaro festival, with its status, has beyond doubts become a major tourist attraction and destination for all in Nigeria and around the world.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"127","title":"IZANGBETO EGUN FESTIVAL, IMEKO","content":"When we talk about Izangbeto, we cannot but speak about Hogbonu in Ajase, Benin republic. There lived a famous warrior called TeAgbanlin who settled at Hogbonu. The town was then a thick forest with different wild animals and other mysterious elements in Hogbonu.\r\n\r\nIn other to make the forest habitable, TeAgbanlin, used Izangbeto to scare away the wild animals and other mysterious elements that were disturbing the peace of the town.\r\n\r\nThrough his effort, TeAgbani became more famous; hence, he and his family settled in Hogbonu. Furthermore, TeAgbanlin had a brother called Djegbe in Owhe-daho-gbe in Antingbasa in Porto novo called the ‘big house’. There you find the first Izangbeto used by TeeAgbanlin. Henceforth, Izangbeto became a revered cult in Dahormey.\r\n\r\nIzangbeto is celebrated amongst the egun people. During the Izangbeto festival, there are special cuisines prepared – Ewa Adalualasepo and Iyenfun Tuwo (Beans and Cornflour) called ‘TUTU’ which is called Sanpiti by the Eguns. This delicacy is eaten with Eko and ObeElede, Ewure and Ohunmimu (pap with pork or goat stew and drinks). Izangbeto usually comes out in the night. The most popular Izangbeto is called Kitikori.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"128","title":"LISABI FESTIVAL, ABEOKUTA","content":"The Lisabi festival commemorates the celebration of the Egba hero called Lisabi. Lisabi is known as a great warrior who fought assiduously for the peaceful settlement of the Egba people during the intertribal wars around the 1930.\r\n\r\nHistory has revealed that Lisabi, the great Egba hero, did not die but intentionally vanished into the earth in a forest between Maroko and Abatan villages in Obafemi Owode Local Government Area; the place is now known as Lisabi forest.\r\n\r\nThe forest is bounded in the west of the Ogun River and in the south of Tegbelu stream. Lisabi festival is an annual event held in the month of March amidst pomp and pageantry. The festival attracts visitors and tourists from far and near.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"129","title":"IGUNNUKO FESTIVAL, IFO","content":"Igunnuko festival at Ifonla usually falls on the third day of Id-El-Kabir and lasts for seven days. On the seventh day, very important personalities are invited for the celebration.\r\n\r\nIgunnuko masquerades occasionally come out to display at important functions but not outside IfoNla village.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"130","title":"AGEMO FESTIVAL, IJEBU ODE","content":"Agemo is an unforeseen phenomenon, a supreme deity and high god (orisa) among the Ijebu people of Yoruba land. The Pre-obanta era connotes the existence of some priest who brought Agemo cult into existence in Ijebu land.\r\n\r\nIt was believed that the deity migrated from Arab Nation of Waddai. Agemo deity comprises of sixteen priests that form sixteen towns within Ijebu land.\r\n\r\nThe music played during Agemo festival, the Agemo costume and the chameleon is a simple representation of the power of the Agemo high god to assume any color that pleases him. The English interpretation of Agemo is chameleon.\r\n\r\nAs a deity and unseen god, it dishes out instruction to the custodian (The Oloja) and the like OLUGBON ASE (TAMI) to be carried out. The festival comes up on every July and August (Osu Agemo) calendar year. Sacrifices and prayers are offered to the Agemo deity to ensure peace and harmony.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"131","title":"AYEE UGBOROWO FESTIVAL, ODOGBOLU","content":"The cultural heritage of the people can never be overemphasized. Nigeria are well known for their customs and traditional values even with advent Western education, the way of life of the people has never change, rather, it has been well modified.\r\n\r\nAaye is a goddess of Uren River located along Ayepe Odogbolu which is celebrated once in two years on Good Fridays “Aaye Ugborowo” is one of the\r\n\r\nThe earliest deity of the people of Ubu homestead, Agada, Odogbolu in Odogbolu Local Government area of Ogun State. As a result of many historical movements, it has been had to say the actual origin of “Aaye Ugborowo” but research revealed that Aaye both male and female are visitors from Ile-Ife to Ilisan Remo. They both migrated from Ilisan through Ikenne to Odogbolu when they were denied water. After due consultation and pleading for water for their children to drink, the female Aaye was annoyed and turned to the river for her children to drink because they were in need of water.\r\n\r\nOn getting to Ubo homestead, Odogbolu, the male resided in the bush, while the female was well received by the people of Odogbolu because of her kindness. Hence, the Aaye became the goddess of “Uren River” located along Odogbolu Aiyepe road, Ubu homestead, Agada Odogbolu.\r\n\r\nSince then, Aaye deity attracts a large crowd of both indigenes and non-indigenes who come to worship the goddess and solicit its favor in one form or the other.\r\n\r\nThe deity is of paramount importance in the social lives of the people of Odogbolu and its environs. “Aaye Ugborowo” festival is celebrated once in three years, always on Good Fridays.\r\n\r\nThe festival is a period of re-union amongst friends, families and relations who are scattered all over the country and beyond that might have not been seen or heard from each other for long. What is so special about the festival is that cow or sheep given for sacrifice is not usually slaughtered; rather it is often tied and thrown inside the river or buried as directed.\r\n\r\nOn Good Friday mid-night, the Aaye deity move round the town for “Peace and Unity” but she is forbidden to see her shadow. Both males and females follow her with prayers. The following day, the “Agbos and Okoro” round off the festival.\r\n\r\n“Aaye Ugborowo” is as old as the Ijebu people of Odogbolu who according to history have settled in the present place as far back as the 15th century.\r\n\r\nAaye is a deity like other deities; it is well accepted, not only among the people of Odogbolu, but among other communities among them. This festival has a great impact on the lives of the Odogbolu people, no matter where you come from. The people always look forward to the extent because of the excitement and glamour in it.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"132","title":"Ogun Festival","content":"Ogun festival is a popular festival observed by the Yoruba people of Ondo state. It is an annual festival in honor of Ogun, a warrior and powerful spirit of metal work believed by the Yoruba to be the first god to arrive on earth. The festival is done to commemorate the life of the warrior.\r\n\r\nHISTORY\r\nAccording to Yoruba mythology, Ogun was a king and the father of Oranmiyan. He was believed by the Yoruba to be the first person to arrive at earth; he uses a cutlass and a dog to clear the road for the arrival of other deities. Ogun is said to have given the finishing touches to the first set of human-created by Obatala, the god of creation. This festival is usually held around August or September in Ondo State (especially Ondo Town) and parts of Ekiti State.\r\nBEFORE THE FESTIVAL\r\nPreparation for the festival begins 17 days in advance. The chief priest announces the sighting of the new moon (which must be sighted before beginning the festival) by blowing a local trumpet called \"ude\" for seven days. Nine days after the moon has been seen, the king sends an emissary to officially announce the ceremony. The people prepare for the festival by repairing bridges and clearing of footpaths. Preparation for the festival continues with a vigil called Ilagun\/Asoro\/Aisun Ogun which takes place three days before the Ogun day. Cutlasses, hoes, and bell gongs are donated, and the shrine is beautified with palm fronds, cowries, and other items. Libation is then poured, a ritual dance is conducted around the shrine, and prayers are offered. Dog, which is an important part of this festival, is used as a sacrifice.\r\n\r\nTHE MAIN FESTIVAL\r\nThe festival heats up during the last three days. A dog is been slaughtered on the first of the three days. It is killed in a slow and painful way but sometimes the High priest kills the dog by striking it with a machete before it actually dies. The dog’s blood is mixed with salt, kola nut, palm wine, and palm oil. The mixture is then poured over all the metalworking tools of the worshippers which are gathered in a bowl. It is the people’s belief that they are being protected from trouble and it also brings about abundant profits. Ogun is believed to be the patron of those who makes use of metals in their everyday work such as blacksmith, drivers, mechanics, and surgeons. The festival can also be held anywhere without the usual 17 days order.\r\n\r\nDuring this festival, drivers are seen with powder and blue-dye poured on their heads and faces to celebrate the god of iron. In some places, dogs on sight are been killed by the worshippers. There is always a great joy during these three days festival as sons and daughters of the land wine and dine.","contentgroup":"Festivals","travel":"0","favourite":"0"}
]