[
{"id":"1","title":"International Institute of Tropical Agriculture  (IITA)","content":"International Institute of Tropical Agriculture is located at Located at KM 40 Along The Old Oyo Road, PMB 5320, Oyo.\r\n\r\nInterested in Agricultural research? Or fun seeking? The international institute of Tropical Agriculture provides an avenue for those seeking to have fun or for those interested in Agricultural research.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\n    Before heading to International Institute of Tropical Agriculture, here are some helpful things to take along with you:\r\n        Camera\r\n        Swimming gear\r\n\r\nThings to do while at International Institute of Tropical Agriculture\r\n    These are the following things you can do while you're here:\r\n        Bird watching\r\n        Walking with the wild","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"2","title":"National Library of Nigeria, Ibadan","content":"National Library of Nigeria, Ibadan is located at Iyaganaku, Oyo.\r\n\r\nThe national library is a local repository of knowledge created by the government to allow accessibility of educational materials to Nigerians.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to National Library of Nigeria, Ibadan, here are some helpful things to take along with you:\r\n\r\nlibrary card.\r\n\r\nThings to do while at National Library of Nigeria, Ibadan\r\nThese are the following things you can do while you're here:\r\n\r\nBorrow a book.\r\n\r\nRead a book.\r\n\r\nDonate a book or books to the library.\r\n\r\nBest Features\r\nIt is a knowledge bank.\r\n\r\nWriter's Review\r\nTo go and search there for old, rare copies of books.\r\n\r\nMost common visitors\r\nHistorians, Librarians, Researchers.\r\n\r\nIf you are ever looking for a copy of any book published in the 60's, the national library is your best bet- Chief librarian of the national library.","contentgroup":"Library","travel":"0","favourite":"0"},
{"id":"3","title":"IITA Forest","content":"IITA Forest is located at Oyo Road, Ibadan, Oyo.\r\nFamous as a birds watchers paradise, it is located inside the International Institute of Tropical Agriculture Ibadan campus. The forest, along with a nearby lake, makes this an area of outstanding natural beauty\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to IITA Forest, here are some helpful things to take along with you:\r\n\r\nCamera\r\n\r\nHiking boots\r\n\r\nWater bottle\r\n\r\nGloves\r\n\r\nThings to do while at IITA Forest\r\nThese are the following things you can do while you're here:\r\n\r\nTake pictures of nature\r\n\r\nSail the nearby lake\r\n\r\nWatch exotic and rare birds during migration\r\n\r\nMost common visitors\r\nStudents,researchers, campers, bird watchers and adventurous people are always present here","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"4","title":"Agodi Park  (Agodi Resort and Conferences)","content":"Agodi Park is located at Parliament Road, Oyo.\r\nHistory of Agodi Park\r\nThis was built in 2014. It is notable as the crown of the Senator Abiola Ajimobi administration\r\n\r\nBuilt in 2014.\r\nBoasting of a water park, zoo, playgrounds, picnic open grounds and a restaurant, this is a beautiful haven tucked in the ancient city of Ibadan with one word in mind; Leisure\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Agodi Park , here are some helpful things to take along with you:\r\n\r\nCamera\r\n\r\nDebit\/Credit Card\r\n\r\nSwimming suits\r\n\r\nPicnic bag\r\n\r\nChange of clothes\r\n\r\nThings to do while at Agodi Park\r\nThese are the following things you can do while you're here:\r\n\r\nGo sight seeing\r\n\r\nHave a picnic\r\n\r\nTake a dip in the pool\r\n\r\nLet your kids play in the equipped playground\r\n\r\nGrab a meal in the restaurant or surrounding food vendor stands\r\n\r\nBest Features\r\nThis is a paradise where nature soothes its visitors","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"5","title":"Old Oyo National Park","content":"Old Oyo National Park is located in , Oyo.\r\nHistory of Old Oyo National Park\r\nThis was built. It is notable as a habitat for rare plant species and wildlife.\r\n\r\nThe Old Oyo National Park was previously habitat for the endangered West African wild dog (Lycaon pictus manguensis).\r\nDerived from Oyo-lle (Old Oyo), the ancient political capital of Oyo Empire of the Yoruba people, the old Oyo city is home to the national park with its variety of wildlife and rare plant species.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Old Oyo National Park, here are some helpful things to take along with you:\r\n\r\nClimbing shoes.\r\n\r\nHiking gear.\r\n\r\nSun screen.\r\n\r\nThings to do while at Old Oyo National Park\r\nThese are the following things you can do while you're here:\r\n\r\nBird watching.\r\n\r\nTake a landscape shot.\r\n\r\nTake picture of the wild life.\r\n\r\nBest Features\r\nIt is a good place to get in touch with nature, meditate or just enjoy the scenery.\r\n\r\nWriter's Review\r\nTo go and get in touch with nature.\r\n\r\nMost common visitors\r\nTourists, Historians, Curators.\r\n\r\nOld Oyo Park: Where history blends with nature - Vanguard news, August 2014.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"6","title":"Cocoa House","content":"Cocoa House is located at Dugbe business district, Oyo.\r\nHistory of Cocoa House\r\nThis was built on July 30, 1965... It is notable as the first sky scrapper in tropical Africa.\r\nBuilt by Cappa and D’Alberto company on July 30, 1965.\r\n\r\nThe cocoa house was engulfed by fire on January 9, 1985\r\n\r\nCocoa house is a testament to the once-lucrative cash crop era of Nigerian history. It was built from the revenue from cocoa, timber, rubber production and was the first sky scraper to be built in tropical Africa.<\/p>\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nThings to do while at Cocoa House\r\n\r\nThese are the following things you can do while you're here:\r\n\r\nSee a movie at the cocoa mall.\r\n\r\nVisit the Odu'a musuem.\r\n\r\nVisit the Kokodome restaurant.\r\n\r\nBest Features\r\n\r\nIt is a historical site.\r\n\r\nWriter's Review\r\n\r\nTo go and see the first sky scrapper in tropical Africa.\r\n\r\nMost common visitors\r\n\r\nHistorians, Shoppers, Tourists.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"7","title":"University of Ibadan  (U.I)","content":"University of Ibadan is located at the center of Ibadan, Oyo.\r\n\r\nThe University of Ibadan, popularly known as UI was founded in 1948 and is widely referred to as the first University in Nigeria. The University of Ibadan has its origin from the Yaba College which was founded in 1932. UI initially took off with academic programs in Arts, Science, and Medicine, but is now a comprehensive citadel of learning with academic programs in over thirteen faculties. The faculties of the Basic Medical Science, Clinical Science, Public Health, and Dentistry are organized as a College of Medicine. The main thrust of UI for the 21st Century is “to be a world-class institution for academic excellence geared towards meeting societal needs”. Today, the University is consistently ranked among the prestigious Universities in the World, with a reported figure of over 3,500 matriculating yearly.\r\n\r\nUI is located five miles (8 kilometers) from the center of the major city of Ibadan, Oyo State.\r\nNotable alumni of the University of Ibadan includes J.P Clark, Wole Soyinka, Ken Saro-Wiwa, Chinua Achebe, Christopher Okigbo, Elechi Amadi, Sophie Oluwole, Michael Omolewa, Niyi Osundare, Femi Osofian, Chukwuemeka Ike, and a host of others.  \r\n\r\nFacilities At The University Of Ibadan\r\nFacilities at the University of Ibadan include lecture halls, halls of residence, academic and staff units, library.\r\n\r\nUI is also home to the following:\r\n\r\nRadio Station, DIAMOND 101.1 FM\r\nBotanical Garden\r\nZoological Garden\r\nUniversity of Ibadan Press\r\nUI Servicom\r\nWorks and Maintenance Unit\r\nThe Bookshop\r\nThe Sports Council\r\nThe Computing Centre;\r\nAnd a host of other facilities.\r\n\r\nOther Noteworthy Attractions At UI\r\nFor travelers who intend to visit UI or for prospective students, here are some things to know about the institution.\r\nSafety\/Security\r\nThe University of Ibadan offers 24 hours security in the vicinity and the halls of residence.\r\n\r\nWhat To Bring\r\nBefore heading to the University of Lagos, here are some helpful things to take along with you:\r\nBooks and other educational materials.\r\nA camera for taking fun pictures.\r\n\r\nThings To Do While At UI\r\nThese are some of the things you can do while you’re here:\r\nEnroll for a full time or part-time program.\r\nWrite Admission examination into various programs.\r\nSightseeing.\r\nRecreational activities.\r\nMake inquiries.\r\n\r\nBest Features At UI\r\nUI houses over twelve (12) Halls of residence.\r\nIt is a historical landmark.\r\nThe Zoological Garden.\r\nThe Botanical Garden.\r\nMost Common Visitors\r\nLecturers, students, researchers, and tourists are the people you will see at the University.\r\n\r\nWeather At The University Of Ibadan\r\nThe atmosphere at UI is quite serene and calm. The University is Located in the Western region of Nigeria, where there are two seasons; the dry and rainy season, which come at a different time.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"8","title":"National Museum of National Unity","content":"National Museum of National Unity is located at Alesinloye Area, Oyo.\r\n\r\nThis was built. It is notable as a center for the preservation and celebration of Nigerian culture.\r\n\r\nThe National museum of unity is home to priceless historical artifacts that celebrate the rich historical culture of the Nigerian people. It is divided into four sections namely, uniity gallery, masquerade gallery, pottery gallery and Yoruba gallery.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to National Museum of National Unity, here are some helpful things to take along with you:\r\n\r\nA camera or camera phone.\r\n\r\nThings to do while at National Museum of National Unity\r\nThese are the following things you can do while you're here:\r\n\r\nVisit the art galleries.\r\n\r\nLearn about the rich history.\r\n\r\nAppreciate the various pottery work.\r\n\r\nBest Features\r\nIt celebrates the rich diverse history of Nigeria and the Nigerian people.\r\n\r\nMost common visitors\r\nCurators, Historians, Tourists are the most common visitors here.\r\n\r\nThe masquerade gallery celebrates various spirits and exotic masks used by them-Ibinu, my tour guide.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"9","title":"Mapo Hall","content":"Mapo Hall is located at Old Quarter, Oyo.\r\n\r\nThis was built in October 5, 1929.. It is notable as a center for social events in Ibadan.\r\n\r\nIt was refurbished during the administration of Governor Alao Akala in 2008.\r\n\r\nBuilt by Engineer Robert Taffy Jones in October 5, 1929..\r\nMapo Hall is a colonial styled building located atop Mapo hill in Ibadan, Nigeria. It is said that no political rally is complete without a stop at Mapo hall.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Mapo Hall, here are some helpful things to take along with you:\r\n\r\nYour Yoruba demon attire ( Agbada or other native).\r\n\r\nThings to do while at Mapo Hall\r\nThese are the following things you can do while you're here:\r\n\r\nAttend a wedding\r\n\r\nOrganize a wedding.\r\n\r\nTake beautiful pictures or selfies.\r\n\r\nBest Features\r\nIt is a place for social events.\r\n\r\nWriter's Review\r\nTo go for Saturday owambe!\r\n\r\nMost common visitors\r\nCaterers, Wedding guests, Politicians are the usual faces here.\r\n\r\nIf your wedding is not at Mapo hall, it is not a wedding- Nancy, an event planner.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"10","title":"Bower's Tower","content":"Bower's Tower is located in , Oyo.\r\nThis was built in 1930.\r\n\r\nIt is said that from the top of the Bower's tower, one can see all of Ibadan.\r\n\r\nBuilt by Ibadan Native Authority. in 1930.\r\n\r\nThe Bower's tower is the highest hilltop in Ibadan giving a panoramic view of the city and important points in the city like University College Hospital (UCH), University of Ibadan, Adebayo, Cocoa House, Dugbe Market, Agodi Gardens, Iwo Road, Ife Road, Olorunsogo and the defunct Lagos \/Ibadan Toll Gate and guess what? It is the perfect spot for that sweet selfie!\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Bower's Tower, here are some helpful things to take along with you:\r\n\r\nA digital camera or a nice camera phone.\r\n\r\nThings to do while at Bower's Tower\r\nThese are the following things you can do while you're here:\r\n\r\nEnjoy the view.\r\n\r\nTake a landscape shot.\r\n\r\nBest Features\r\nThe view from here is priceless.\r\n\r\nWriter's Review\r\nTo go and see the city of Ibadan from a different angle.\r\n\r\nMost common visitors\r\nPhotographers, Tourists.\r\n\r\nThe view from here is unrivaled!- Muhammed, a photographer.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"11","title":"University of Ibadan Zoological garden  (U.I Zoological garden)","content":"University of Ibadan Zoological garden is located in, Oyo.\r\n\r\nThis was built in 1948. It is notable as a place for education, conservation, and fun.\r\n\r\nIn 2013, two lions were rumored to have escaped from the Ibadan zoo.\r\n\r\nBuilt by the Department of Zoology in 1948.\r\n\r\nThe Zoological garden at the University of Ibadan is home to a variety of endangered animals and plant species. It was built as a conservation center and also for educational purposes. Visitors and tourists are also welcome.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the University of Ibadan Zoological garden, here are some helpful things to take along with you:\r\n\r\nFace cap or hat\r\n\r\nThings to do while at University of Ibadan Zoological garden\r\nThese are the following things you can do while you're here:\r\n\r\nSee lions!\r\n\r\nVisit the baboons!\r\n\r\nTake pictures of wildlife.\r\n\r\nBest Features\r\nIt is a place where man meets nature.\r\n\r\nWriter's Review\r\nTo go and see and appreciate the variety of wildlife on offer.\r\n\r\nMost common visitors\r\nPhotographers, Tourists. Nature enthusiasts.\r\n\r\nWhen the lion roared, I felt something move in me- Kunle, a first-year veterinary medicine student.","contentgroup":"Zoo","travel":"0","favourite":"0"},
{"id":"12","title":"Pete's Bar","content":"Pete's Bar is located at Trans Amusement Park, Bodija, Oyo.\r\nIt is notable as a fun center to relax and unwind. After a hard at work, Pete's bar and lounge are the perfect place to kick it back with a bottle of your favorite drink in one hand, grilled meat on the other and sweet music to serenade your soul.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Pete's Bar and Lounge, here are some helpful things to take along with you:\r\n\r\n1.Cash.\r\n\r\n2.A friend or group of friends.\r\n\r\nThings to do while at Pete's Bar and Lounge\r\nThese are the following things you can do while you're here:\r\n\r\n1. Enjoy your favorite drink.\r\n\r\n2. Gyrate to good music.\r\n\r\n3. Bust a move or two.\r\n\r\nBest Features\r\nIt is a place to unwind after honest day work.\r\n\r\nWriter's Review\r\nTo go and unwind and relax.\r\n\r\nMost common visitors\r\nLeisure seekers, Students are the type of people to find here.\r\n\r\nPete's bar is the happening place in Ibadan- Tony, a friend.","contentgroup":"Lounge","travel":"0","favourite":"0"},
{"id":"13","title":"Heritage Mall","content":"Heritage Mall is located at Cocoa House Complex, Oba Adebimpe Road, Dugbe, Oyo.\r\n\r\nThis was built in 2013. It is notable as a shopping and relaxation destination.\r\n\r\nIt is reputed to be the largest mall in the SouthWest.\r\n\r\nBuilt by Messr L’Dalberto in 2013.\r\n\r\nThe largest shopping mall in southwest Nigeria is a shoppers delight offering the best in food, electronics, movies and lifestyle products.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Heritage Mall, here are some helpful things to take along with you:\r\n\r\nThe whole family.\r\n\r\nShopping list.\r\n\r\nThings to do while at Heritage Mall\r\nThese are the following things you can do while you're here:\r\n\r\nGrab a bite at the food court.\r\n\r\nGo window shopping.\r\n\r\nTake a shop rite selfie.\r\n\r\nBest Features\r\nIt offers a wide range of products ranging from food to electronics to lifestyle products.\r\n\r\nMost common visitors\r\nShoppers, Families. Fun lovers are the most common people to find here.\r\n\r\nHeritage mall is one of the hotspots in Ibadan- Ope, a resident of Ibadan.","contentgroup":"Mall","travel":"0","favourite":"0"},
{"id":"14","title":"Koko Dome Restaurant and Nite Club  (Koko Dome)","content":"Koko Dome Restaurant and Nite Club is located at Liebu Bypass, Dugbe, Ibadan, Oyo.\r\n\r\nThis was established in 1989. It is notable as the oldest night club in Ibadan\r\n\r\nIt played host to the touring 'The Hennessy Beat Bar Crawl' party\r\n\r\nBuilt-in 1989.\r\nCentralized in the heart of Ibadan’s business district center, Koko Dome is a household name that has retained its unique spot as a premier entertainment center over the decades.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Koko Dome Restaurant and Nite Club, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nSwimming suit(s)\r\n\r\nThings to do while at Koko Dome Restaurant and Nite Club\r\nThese are the following things you can do while you're here:\r\n\r\nDine at the restaurant\r\n\r\nTake a swim in the pool\r\n\r\nHit the club with pals\r\n\r\nBest Features\r\nComprising a club for the nightcrawlers, a pool for families and recreation seekers, and a restaurant that offers a wide range of Lebanese dishes on the menu, Koko Dome is a suitable center that aims to bring fun and entertainment to Ibadan residents.\r\n\r\nWriter's Review\r\nVisiting Ibadan for business or pleasure? Make a stop at this landmark and enjoy the hospitality Mario and his staff has set for you at Koko Dome.\r\n\r\nAs a child, I used to come here for swimming lessons. To my surprise and delight, it is still a lively place.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"15","title":"The Ventura Mall","content":"The Ventura Mall is located at Plot 5\/6 Old Aerodrome Road, Off Sango-Odoo Road, Samonda GRA, Ibadan, Oyo.\r\nA perfect location in a serene environment delivering unlimited fun opportunities, The Ventura Mall remains a one-stop spot in 'IB City' for unwinding and merrymaking.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nThis is an ultra-modern shopping mall offering a place for relaxation and entertainment. There are facilities in places such as shopping complex, children game arcade, film house, and food courts to guarantee all-round access to fun.\r\n\r\nI have never experienced a better level of ecstasy until I visited The Ventura Mall. Everything there just wonderful - Olaoluwa Olatoye\r\n\r\nA good place for relaxing and entertainment after the stress of the day. the weekend is always fun. My favorite is bowling. I can play it 24\/7 - Tolu Olude","contentgroup":"Mall","travel":"0","favourite":"0"},
{"id":"16","title":"Ibadan Recreation Club","content":"Ibadan Recreation Club is located at Onireke GRA, Ibadan North, Oyo.\r\nThis was established in 1902.\r\n\r\nIn 1950, the Ibadan European Club became the Ibadan Recreation Club\r\nFormerly known as Ibadan European Club, this former all-British club has been a silent observer and witness to a lot of Ibadan's history.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nThings to do while at Ibadan Recreation Club\r\nThese are the following things you can do while you're here:\r\n\r\nTake full advantage of the many facilities in the center\r\n\r\nSocialize and network\r\n\r\nBest Features\r\nEquipped with tar and sand tennis courts, a large swimming pool furnished with pool-beds, an indoor squash court and a billiards table, Ibadan Recreation Club offers some quality good-for-your-health fun.\r\n\r\nWriter's Review\r\nThere is also a large variety of drinks both alcoholic and non-alcoholic provided by the mini-restaurant and bar by the poolside. There is also more than one grill set aside for Barbeque and 'Suya' lovers to order to their satisfaction. Enjoy all of this while you admire the beautiful view of the water’s surface\r\n\r\nRelax, have a good time and just generally enjoy yourself in good company - Paul Winston","contentgroup":"Club","travel":"0","favourite":"0"},
{"id":"17","title":"Ibadan Golf Club","content":"Ibadan Golf Club is located at Onireke Reservation Area, Ibadan North, Oyo.\r\n\r\nThis was established in 1990.\r\n\r\nIbadan Golf Club hosted the Fourth Eponymous Open Golf Tournament by Sovereign Trust Insurance (STI) Plc in March 2016\r\n\r\nIt also hosts the MTN World Golfers Championship Western Region Qualifiers\r\n \r\nOne thing that marks the ancient city of Ibadan as a converging spot for adventurers and tourists from far and wide is this grand-scale and beautiful golf club.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Ibadan Golf Club, here are some helpful things to take along with you:\r\n\r\nYour lucky golf set\r\n\r\nA hat for the sunny day\r\n\r\nBest Features\r\nThis is a private membership club that hosts an average of seven major competitions yearly. Previously the golf section of the famous Ibadan Recreation Club, the founding members decided to establish an independent golf club after a lock-out by the management of the Recreation Club.\r\n\r\nWriter's Review\r\nIt features a perfectly groomed and well-maintained lush golf course consisting of six par 3 holes, eight par 4 holes and five par 5 holes. Aside from the 18 holes green golf course, the golf club also owns a lounge for members in an elegantly built clubhouse, a golf shop that provides all golfing needs, a bar to hang out and enjoy the evening breeze after a long game, and a restaurant that serves mouth-watering intercontinental dishes.\r\n\r\nEverything is good here and for networking opportunities, it is highly recommended - Folashade Folabi","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"18","title":"GQ Lounge, Ibadan","content":"GQ Lounge, Ibadan is located at 26 Awolowo Road, Bodija Estate, Ibadan , Oyo.\r\nThis was established in 2012.\r\n \r\nIn Ibadan and seeking a wild and electric night to celebrate? Or you want to immerse yourself and experience the nightlife IB City has to offer its residents? No better place to get the night started than GQ Lounge.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to GQ Lounge, Ibadan, here are some helpful things to take along with you:\r\n\r\nCamera to capture the memorable night you are sure to have\r\n\r\nCash or Credit\/Debit Cards\r\n\r\nThings to do while at GQ Lounge, Ibadan\r\nThese are the following things you can do while you're here:\r\n\r\nHit the dance floor\r\n\r\nHave a meal with friends and families\r\n\r\ndo not drink and drive\r\n\r\nBest Features\r\nThis is the perfect 17:59 chill-out zone. GQ lounge offers an unbelievable thrill in the nightlife experience. There are an outdoor bar and a club space, with perfect lighting, great music, and an ample dance floor.","contentgroup":"Lounge","travel":"0","favourite":"0"},
{"id":"19","title":"Apollo's Lounge and Bar","content":"Apollo's Lounge and Bar is located at Palms Shopping Mall, Liberty Road, New GRA, Ibadan, Oyo.\r\n\r\nThis was established in 2014.\r\n \r\nLooking for a cool place to relax with excellent food and chilled drinks? This elitist lounge attracts a mixed clientele with their great wine list, cocktails, special offers and snacks throughout the day. Give it a try!\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nExceeding expectations in services, atmosphere, food and drink quality, customer service and overall customer experience, Apollo's Lounge offers a classy, premium and luxurious experience to its customers at an affordable rate.\r\n\r\nWriter's Review\r\nA place to see, mingle and network with Ibadan's socialites, Apollo's Lounge is a recommended hangout spot if you fancy an exclusive and classy chilling experience in this history-rich and cultural town.","contentgroup":"Lounge","travel":"0","favourite":"0"},
{"id":"20","title":"Club Laurel","content":"Club Laurel is located at Dikat Bus-Stop, Ring Road, Ibadan, Oyo.\r\nThis was established in 2014.\r\n\r\nRelaunched and shot into the limelight by Hennessy Nite, Club Laurel has grown to be one of the bubbling clubs in Ibadan\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nDo not drink if you're going to drive\r\n\r\nWhat To Bring\r\nBefore heading to Club Laurel, here are some helpful things to take along with you:\r\n\r\nSelfie stick to take those nice Insta pictures\r\n\r\nThings to do while at Club Laurel\r\nThese are the following things you can do while you're here:\r\n\r\nHave a group dinner\r\n\r\nBest Features\r\nClub Laurel is a wild, loud and fun club that attracts the revelers every time and guarantees a fun night.\r\n\r\nWriter's Review\r\nDon't be left out of the vibe. Grab a friend and go have fun.","contentgroup":"Club","travel":"0","favourite":"0"},
{"id":"21","title":"Palms Shopping Mall, Ibadan","content":"Palms Shopping Mall, Ibadan is located at Corner Of Liberty Road, Oyo.\r\nThis cosmopolitan edifice has established itself as one of the premier shopping and leisure destinations for families in Ibadan.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Palms Shopping Mall, Ibadan, here are some helpful things to take along with you:\r\n\r\nShopping list\r\n\r\nCamera to capture the lovely sights\r\n\r\nCash or Credit\/Debit Card\r\n\r\nThings to do while at Palms Shopping Mall, Ibadan\r\nThese are the following things you can do while you're here:\r\n\r\nGrab a bite at the food court\r\n\r\nShop at the various stores\r\n\r\nBest Features\r\nThis one-stop shopping center with a total of 21,000-metre square retail space presents a high-quality family-friendly environment for major branded outlets, food, fashion, and entertainment.\r\n\r\nWriter's Review\r\nSitting on an 18 acres land with its large well-lit parking space, its beauty and aesthetics is something to behold.","contentgroup":"Mall","travel":"0","favourite":"0"},
{"id":"22","title":"Club E-Bevande","content":"Club E-Bevande is located at 76, Abiodun Way, Off Ring Road, Ibadan, Oyo.\r\nThis was established in 2011.\r\n \r\nKick back on a lovely day and party the night away with nightcrawlers and socialites alike in this club regarded by many as one of the best clubs in Ibadan.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Club E-Bevande, here are some helpful things to take along with you:\r\n\r\nCamera to capture the memorable night you are sure to have\r\n\r\nYour squad and pals!\r\n\r\nBest Features\r\nA unique spot bringing a rare mix of classiness and revelry, Club E-Bevande is an elegant club located on the popular Ring Road.\r\n\r\nWriter's Review\r\nWhether in town for business or leisure, if you are nostalgic for a night of pure unadulterated fun, Club E-Bevande is a recommended spot for you.","contentgroup":"Club","travel":"0","favourite":"0"},
{"id":"23","title":"Irefin Palace","content":"Irefin Palace is located in, Oyo.\r\n\r\nThis was built 200 years ago.\r\n\r\nNaija treks, a popular travel blog visited here and wrote an extensive piece about the state of the palace.\r\n\r\nIn recent times, the palace was renovated\/redesigned.\r\n\r\nBuilt by Ba’ale Irefin in 200 years ago.\r\n\r\nIt is said that the Irefin clan was one full of powerful warriors and the Irefin palace was the abode of one of such powerful warriors.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Irefin Palace, here are some helpful things to take along with you:\r\n\r\nWalking gear.\r\n\r\nFace cap or hat- to help against the sun rays.\r\n\r\nA digital camera or a good phone camera.\r\n\r\nInternet-enabled device for upload on the go.\r\n\r\nThings to do while at Irefin Palace\r\nThese are the following things you can do while you're here:\r\n\r\nTake pictures of the architectural designs.\r\n\r\nLearn about Irefin history.\r\n\r\nEnjoy a local meal.\r\n\r\nBest Features\r\nThis is a historical monument that reminds us of a portion of Ibadan's history.\r\n\r\nWriter's Review\r\nTo go learn about a portion of ancient Ibadan history.\r\n\r\nMost common visitors\r\nCurators, Historians are common faces here.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"24","title":"Café Chrysalis","content":"Café Chrysalis is located at 23, Ilaro Street, off Alabiyamo Street, Old Bodija, Ibadan, Oyo.\r\n\r\nThe Cafe Chrysalis is a restaurant located at 23, Ilaro Street, Off Alabiyamo Street Ibadan city. It has a nice serene environment suitable for private and romantic getaways as well as for business meetings. Its friendly and efficient staff and great food just make it all the most interesting place to be.\r\n\r\nSafety\r\nIt is a relatively safe place to be.\r\n\r\nThings To Do\r\nEnjoy a sumptuous meal, relax, hang out with friends and have fun.\r\n\r\nBest Features\r\nIts cool and serene environment gives it a private feeling perfect for a quiet and relaxing getaway, also its great meals make it all the better.\r\n\r\nBest Time to Visit Cafe Chrysalis\r\nThe best time to visit would be around 8 AM to 10 PM Monday to Saturday and 12 pm to 10 pm on Sunday.  \r\n\r\nMost Common Visitors\r\nIts most common visitors are couples, families, and singles out to relax.","contentgroup":"Lounge","travel":"0","favourite":"0"},
{"id":"25","title":"Fun Factory, Ibadan","content":"Fun Factory, Ibadan is located at 15\/17 Oshuntokun Avenue, Old Bodija, Ibadan, Oyo.\r\nFun Factory is a family recreational and entertainment center that offers a wide range of facilities from amusement park to event center and summer school ideal for children's parties, reunions or just relaxing.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"26","title":"Obafemi Awolowo Stadium","content":"Obafemi Awolowo Stadium is located at Liberty Road, Off MKO Abiola Way, Ibadan, Oyo.\r\n\r\nThis was built in 1960.\r\n\r\nIn 1980, the stadium hosted several matches during the African Cup of Nations, including a semi-final between Algeria and Egypt\r\n\r\nThis stadium was formerly known as Liberty Stadium until 2010 when the then President Goodluck Jonathan renamed it in honor of the late Premier of the Western Region.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"27","title":"Mauve Lounge","content":"Mauve Lounge is located at Adeoyo Junction, MKO Abiola Way (Ring Road), Ibadan, Oyo.\r\n\r\nMauve Lounge is one of the unofficial 'Big Boys' abodes in Ibadan.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nThis is an elegant and stunning lounge for mature minds with a stage for live performances and music to complement your dining and relaxing mood.\r\n\r\nWriter's Review\r\nIts bar has a reputation for its wickedly good cocktails, great music and its unique decor.","contentgroup":"Lounge","travel":"0","favourite":"0"},
{"id":"28","title":"Jade's Cuisine","content":"Jade's Cuisine is located at 96 Gbadebo Street, Off Queen Elizabeth Road, Mokola Hill, Ibadan, Oyo.\r\n\r\nStarving and looking for a joint to grab a quick lunch before your next appointment? Jade's Cuisine is a quick-service restaurant with sit-in options especially for you.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Jade's Cuisine, here are some helpful things to take along with you:\r\n\r\nCash (to avoid difficulty in payments if their POS is unavailable)\r\n\r\nBest Features\r\nSometimes called \"The Green and Pink Place\", Jade' Cuisine is a cozy eatery in Mokala Hill that offers a great place to have get a quick meal, have a chat with a friend and meet exciting people.\r\n\r\nWriter's Review\r\nThey serve a variety of affordable mouth-watering dishes that go down with your choice beer or soft drink. Their staff is really warm and accommodating also.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"29","title":"Martha's Kitchen","content":"Martha's Kitchen is located at 129, Railway Siding Jericho, Magazine Road, (Opposite Rehoboth Plaza), Ibadan, Oyo.\r\n\r\nWith over 12 years of experience, Martha's Kitchen is like the Grandmum who knows all the tricks to prepare all meals to perfection.\r\n\r\nLocal Foods to eat at Martha's Kitchen\r\nFood to try at the include;\r\n\r\nYanky Breakfast\r\n\r\nFish Panel in Tartar Sauce\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Martha's Kitchen, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nDining companion(s)\r\n\r\nThings to do while at Martha's Kitchen\r\nThese are the following things you can do while you're here:\r\n\r\nHost your small events here\r\n\r\nBest Features\r\nFrom its humble beginnings of 2 staff members, Martha's Kitchen has grown to include over 30 staff members all working to provide a memorable dining experience for you.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"30","title":"Le Reseau","content":"Le Reseau is located at Heritage Mall, Dugbe, Ibadan, Oyo.\r\n\r\nBoasting an extensive variety of meals and a bubbly bar, this is one of the major attractions of Heritage Mall\r\n\r\nLocal Foods to eat at Le Reseau\r\nFood to try at the include;\r\n\r\nJumbo Prawns with Vegetable\r\n\r\nGrilled Fillet Steak with Garlic Butter Sauce\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Le Reseau, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nColleagues and Friends\r\n\r\nBest Features\r\nLe Reseau features a restaurant and a bar that creates a unique experience right from when you step in through the doors. Everything here is ruled by class and taste as is evident from the interior decor that spots a cosmopolitan look with the serenading soulful songs that warms up into a foot-tapping tune.\r\n\r\nWriter's Review\r\nA great meal deserves a dedicated bartender spinning you incredible drinks to get the party started. As the lounge fills up, you might be privileged to see your boss being very unboss-like on the dance floor. Le Reseau is one spot that knows its business in mixing up Class and Fun.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"31","title":"D-Ril Spa","content":"D-Ril Spa is located at Magnet House, 23\/25 Hassan Street, Imalefalafia, Oke-Ado, Ibadan, Oyo.\r\n\r\nWith a mission to give an all-natural Spa experience for a healthier and happier look, D-Ril Spa has amassed a steadily growing clientele because of its bespoke services.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to D-Ril Spa, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nBest Features\r\nOffering different wellness experiences categorized as the rejuvenation program, detoxification program, weight management, and anti-stress program, they provide beauty and wellness services using ayurvedic science, aromatherapy, hydrotherapy, and magnet therapy.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"32","title":"Kabachi Chinese Fusion Bistro","content":"Kabachi Chinese Fusion Bistro is located at Ventura Mall, Plot 5\/6 Old Aerodrome Road, Samonda GRA, Ibadan, Oyo.\r\n\r\nOriental Cuisine? Western Cooking? African Ambiance? Kabachi Chinese Fusion Bistro is where you need to be.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Kabachi Chinese Fusion Bistro, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nCamera for those Insta selfies and food Snaps\r\n\r\nBest Features\r\nKabachi Chinese Fusion Bistro possesses all the qualities of a perfect exotic Hibachi dining experience. Come enjoy the finest in steak, chicken, and seafood skillfully prepared and presented with great flair by the Teppanyaki chefs on your tabletop grill.\r\n\r\nA wonderful place to be. Nice service and large meals. Really, the servings are large and enjoyable to the last bite-Oluwatosin Khadeejah Salau\r\n\r\nGenuine Chinese food guaranteed! hey definitely satisfied my craving for authentic, tasty Chinese food. The ambiance is very delightful; decorations and furnishings are impeccable. I must say, they have a regular customer-Aderonke Sijuwade","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"33","title":"Lead City University  (LCU)","content":"Lead City University is located at Toll Gate, Ibadan, Oyo.\r\nFondly called LCU by students and staff alike, the University was established in 2005 by Eduserve Consult, an organization that has recorded remarkable achievements in promoting educational development at both tertiary and non-tertiary levels. As a Private University under the approval of the Federal Government and full accreditation by the National Universities Commission, LCU offers various programs suitable for the young and adult working class, as it recognizes the time constraints of different individuals, and therefore seeks to provide flexibility by allowing for a choice between part-time and full-time study schemes. The programs at the institution are offered by specialized faculties and lead to officially recognized degrees.\r\n\r\nFun Facts About LCU\r\n70:30% female\/male student ratio.\r\n\r\n$40 million in financial aid available.\r\n\r\n99% of incoming freshmen receive financial aid.\r\n\r\nApproximately 2000 undergraduates and 500 graduate students.\r\n\r\n80% of students live on campus.\r\n\r\n14:1 student\/faculty ratio.\r\n\r\nThe University promises a real-world hands-on experience.\r\n\r\n90+ clubs and organizations.\r\n\r\n12 Division II athletic teams, plus cheerleading, intramural and sports club.\r\n\r\nAdequate security with mounted CCTV cameras.\r\n\r\nState of the art academic facilities.\r\n\r\nRelatively affordable tuition fees.\r\n\r\nGoing by its close proximity to the University of Ibadan, it enjoys first-hand collaborations and partnerships.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"34","title":"Ibadan Polo Club","content":"Ibadan Polo Club is located at 1, Leutemock Cantonment Close, off Eleyele Road, Oyo.\r\n\r\nAt the Ibadan Polo Club, you can relax, watch or play any number of Polo games in the ancient city of Ibadan. It is also a socialization hub as many important personalities are often spotted playing or watching the sport in the hot afternoons.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Ibadan Polo Club, here are some helpful things to take along with you:\r\n\r\nPolo Clubs\r\n\r\nThings to do while at Ibadan Polo Club\r\nThese are the following things you can do while you're here:\r\n\r\nPlay Polo\r\n\r\nWatch a game of polo\r\n\r\nBest Features\r\nA game of polo is sure to be played every afternoon during the weekends. These games are exciting events which are bound to keep on the edge of your seat.\r\n\r\nMost common visitors\r\nPolo players, Enthusiasts, Dignitaries","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"35","title":"Agbele Rock, Igbeti","content":"Agbele Rock, Igbeti is located at Igbeti Town, Oyo.\r\n\r\nExperience a bit of Yoruba folklore at Agbele Rock, Igbeti. This is a naturally occurring rock formation which resembles a woman with a basket on her head and a child on her back. Legend has it that this rock formation was formed when a woman stole some yam from a rocky part of the village which was being dried in the sunlight. And like Lot's wife, she became a permanent fixture there.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nThings to do while at Agbele Rock, Igbeti\r\nThese are the following things you can do while you're here:\r\n\r\nA camera\r\n\r\nBest Features\r\nThe myth about the story is an interesting backdrop to this wonder of geology.\r\n\r\nMost common visitors\r\nTourists, Geologists","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"36","title":"Ajayi Crowther University  (A.C.U)","content":"Ajayi Crowther University is located at Oyo, Oyo.\r\n\r\nACU as the University is fondly called is a private university in Oyo State. It was established by the Supra Diocesan Board (West) of the church of Nigeria and has its origins in the defunct CMS training institution, Abeokuta and the defunct St Andrews College, Oyo. In 1999, the request to establish the university was granted by the church of Nigeria and after satisfying rigorous criteria prescribed by the National Universities Commission (NUC), the university was granted the license to operate as a private University in Nigeria on 7 January 2005. The University is named after Late Samuel Ajayi Crowther, the first African Bishop who first translated the bible in Yoruba, and seeks to be a top-class institution in the pursuit of knowledge and scholarship through teaching and exemplary service to humanity.\r\n\r\nThings To Know About Ajayi Crowther University\r\nFor travelers who intend to visit and for prospective students, here are a few awesome things to know:\r\n\r\n\r\nSecurity\r\nACU is situated in a secure location with seasoned security personnel.\r\n\r\n\r\nBest Time To Visit\r\nDuring office hours on weekdays, the University is open to inquiries and studies.\r\n\r\nWhat To Bring\r\nBefore heading to ACU, here are some things to bring along:\r\n\r\nBooks\r\n\r\nEducational Materials\r\n\r\nA valid means of identification.\r\n\r\nMost Common Visitors\r\nBe sure to find staff, students and education enthusiasts at the University.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"37","title":"Lifeforte International School","content":"Lifeforte International School is located at 1 Lifeforte Boulevard, Awotan GRA, Ibadan, Oyo.\r\nThis is an academic institution recognized as one of Africa's foremost private school establishments offering the Nigerian, British and American curricula for a world-class, afro-centric education that would place children on a platform to achieve great heights.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Lifeforte International School, here are some helpful things to take along with you:\r\n\r\nEducational materials if you are a new or returning student\r\n\r\nHousing necessities if you are a new or returning student\r\n\r\nAn ID Card to identify yourself if you are a visitor\r\n\r\nBest Features\r\nSituated on an expansive 25-acre estate, the ultra-modern campus contains well-equipped classrooms, science laboratories, state of the art ICT facilities, an art studio, an extensive library, ‘home-away-from-home' hostels, gymnasium, and a world-class sports complex, providing students with a best-in-class holistic educational experience. The faculty and staff team consist of a diverse group of seasoned academicians, chief examiners, and leading professionals, many of whom are leading educational authorities in their different fields of discipline.\r\n\r\nWriter's Review\r\nExtra-curricular activities such as leadership training skills, human rights skills, moral instruction, societal ethics, public speaking, sportsmanship, and community development contribute to the wholesome development of Lifeforte students. This coupled with a strong academic tradition makes Lifeforte students rank among the top 1% of African school children. It is not surprising that yearly, Lifeforte students gain admission into top League universities in the UK, USA, and Canada.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"38","title":"African Heritage Research Library and Cultural Center  (AHRLC)","content":"African Heritage Research Library and Cultural Center are located at Akobo Oju-Irin, Adeyipo Village, Ibadan, Oyo.\r\n\r\nThis was established in 1989 It was established with the mind of meeting the educational needs of scholars, researchers and students, and, the non-educated indigenes – farmers, petty traders and artisans. It is notable as an addition to arts, its serene environment has continued to inspire filmmakers, writers and musicians, serving as a setting for literary, artistic works and films. The novel, The Virgin by Bayo Adebowale, which Tunde Kelani’s adapted in his film The Narrow Path, is set in the village.\r\n\r\nThe African Heritage Research Library and Cultural Center offers insightful information on all things relating to African ways, culture and tradition.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the African Heritage Research Library and Cultural Center, here are some helpful things to take along with you:\r\n\r\nWriting materials, cameras, and tape recorders in case of oral interviews\r\n\r\nBest Features\r\nAfrican Heritage Research Library and Cultural Center is a document repository, where one can research. Researchers on any subject relating to Africa will find the place helpful.\r\n\r\nMost common visitors\r\nscholars, researchers and students, and non-educated indigenes","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"39","title":"Oyo State Library","content":"Oyo State Library is located at Opposite Cocoa House, Dugbe, Ibadan, Oyo.","contentgroup":"Library","travel":"0","favourite":"0"},
{"id":"40","title":"Colours-in-Africa, Ibadan","content":"Colours-in-Africa, Ibadan is located at Former Crown Trust Building, J. Allen Junction, Dugbe, Ibadan, Oyo.\r\nThis is a foremost Nigerian furniture design destination known for their wide array of unique product range including outdoor and patio furniture, indoor furniture, hotel furniture, construction furniture, and office furniture. It is regarded as a furniture hub in Nigeria because over 60% of the items the company produces have Afro handcraft design content while the rest are contemporary or classic designs.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Colours-in-Africa, Ibadan, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit Card.\r\n\r\nBest Features\r\nDealers in luxury furniture, they produce and sell furniture, including sofas, dining sets, tables (coffee tables, nested tables, and side tables), beds, consoles, carved wooden works, wall panels, and ornamental mirrors. They fit kitchens and cabinets for apartments and homes as well. Their unique selling point is their Outdoor and Patio furniture range though. They are the only company in West Africa producing this kind of furniture made from aluminum and polyethylene fibers. Others include artworks, lamps, gift items, tableware, and accessories. Most of these items are produced locally in the company’s factory with the rest imported from across Africa.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"41","title":"Ladoke Akintola University of Technology  (LAUTECH)","content":"Ladoke Akintola University of Technology is located at Ladoke Akintola University of Technology, P.M.B 4000, Ogbomoso, Oyo.\r\n\r\nThe university enrolls nearly 20,000 students in six faculties and a college.For two consecutive seasons, in 2003 and 2004, the Nigerian Universities Commission (NUC) rated LAUTECH as the best state university in Nigeria\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Ladoke Akintola University of Technology, here are some helpful things to take along with you:\r\n\r\nAcademic documents\r\n\r\nCash\r\n\r\nValid Identification\r\n\r\nBest Features\r\nI love this place because it is a center of academic excellence and a training ground for productive, self employable, self sustaining and self reliant individuals passing through it; and to combine the ideas of excellence in learning and research with a large dose of practical application in development.\r\n\r\nWriter's Review\r\nI would recommend this school because it aims to work towards the social, cultural and technological needs of the funding states i.e Osun and Oyo, in particular and Nigeria in general.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"42","title":"Alliance Française Ibadan","content":"Alliance Française Ibadan is located at 7th Day Adventist Road. Beside Magistrate Court. Iyaganku, Ibadan, Oyo.\r\n\r\nThis is a non-profit French language and cultural centre with a goal to teach French in Ibadan, publicize the French culture in Ibadan and foster cultural diversity through the promotion of all cultures.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Alliance Française Ibadan, here are some helpful things to take along with you:\r\n\r\nAn English-to-French Dictionary if you plan on conversing in the French language\r\n\r\nYour passport and ID Card if your trip is an official one\r\n\r\nBest Features\r\nOne of the oldest Alliances Françaises in Nigeria, they provide a range of services to promote cultural diversity in Ibadan such as organization of cultural events, provision of resources about France and the French speaking community, and aid in trips to France. It is also a training centre for French teachers of the South-West Region of Nigeria, that is, Centre for French Teaching and Documentation.\r\n\r\nWriter's Review\r\nIt features a resource center which has all the documents needed for learning outside the classroom. They also organize platforms for rising and upcoming artists and performers to showcase their talents with an aim to stimulate the cultural scene in Ibadan.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"43","title":"Lekan Salami Stadium","content":"Lekan Salami Stadium is located at Adamashingba Road, Mokola, Ibadan, Oyo.\r\n\r\nNamed after the football administrator and founder of the club, this is a multi-purpose stadium that is the home ground to the Nigerian Premier League team Shooting Stars F.C.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nMostly used for football matches, this is a stadium in Mokola with an 18,000 seating capacity. Also called Adamasingba Stadium, it used for sporting activities and social events, and it is a notable landmark. It is also used for athletics and features an indoor sports hall for indoor games.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"44","title":"Ibadan Civil Centre","content":"Ibadan Civil Centre is located at Agodi Gate, Iwo Road, Ibadan, Oyo.\r\nThis was established in 2009.\r\n\r\nBuilt by Chief Daisi in 2009.\r\nSearching for that perfect event place in Ibadan? Come check out this major landmark and beautiful premier event centre adorning Ibadan's landscape.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nDress according to the occassion\r\n\r\nWhat To Bring\r\nBefore heading to Ibadan Civil Centre, here are some helpful things to take along with you:\r\n\r\nIf you are a guest, bring along your Invitation Card\r\n\r\nCome along with a Camera to capture the event and lovely sights\r\n\r\nBest Features\r\nThe first world-class civic centre within Ibadan city, the architectural uniqueness of this edifice was drawn from Roman-styled designs with columns and chandeliers all in white that gives a majestic look to the centre. It features four main halls including the famous Agbeke Hall which is on the ground floor and consists of a 2,000-seater venue that is exquisitely decorated for high class events. It comes with banquet chairs and tables with a stage. There is also the 3 other 400-seater conference rooms on the upper floor. These are ideal for smaller crowd functions like engagement parties and others. The centre also boasts of a car park space for about 500 cars inside the premises with armed and private security round the clock.\r\n\r\nWriter's Review\r\nThe centre is beautiful, easily accessible, and manned by well trained and courteous staff adept at the business at hand and concerned mainly with customer satisfaction.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"45","title":"Ibadan Airport","content":"Ibadan Airport is located at Airport Road, Off Old Ife Road, Oyo.\r\n\r\nLocated in one of the largest and most populous city in Nigeria, Ibadan Airport services more than its fair share of travelers yearly. This is the main airport servicing the Ibadan presently.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nbe cautious of your possessions as pick-pockets look for easy targets\r\n\r\nWhat To Bring\r\nBefore heading to Ibadan Airport, here are some helpful things to take along with you:\r\n\r\nYour flight document: passport, flight ticket, booking confirmation.\r\n\r\nYour luggage.\r\n\r\nMusic player or a good book to keep you company as you await your flight.\r\n\r\nWriter's Review\r\nFlights here are not daily. Call ahead to know the week's schedule before you make your bookings and arrangements.\r\n\r\nMost common visitors\r\nTravelers, air force personnel, pilots and aviation officers frequent this location.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"46","title":"Oyo State Government Secretariat","content":"Oyo State Government Secretariat is located at Secretariat Road, Off Parliament Road, Mokola, Oyo.\r\n\r\nThis is the permanent administrative office of the Oyo State Government. Here, all state agencies and parastatals are quartered. As such, this is one of the most important place in the state.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Oyo State Government Secretariat, here are some helpful things to take along with you:\r\n\r\nA means of identification.\r\n\r\nWriter's Review\r\nMany, if not all government ministries and agencies operate from this imposing complex. If you have any business with the government, you will most likely find yourself here.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"47","title":"University College Hospital, Ibadan","content":"University College Hospital, Ibadan is located at Queen Elizabeth Road, Oritamefa, Ibadan, Oyo.\r\nThis was built in 1953. It is notable in response to the need for the training of medical personnel and other healthcare professionals for the country and the West African Sub-Region.\r\n\r\nThis is a federal government-owned teaching hospital attached to the University of Ibadan. Primarily a tertiary institution, it also offers primary and secondary health care services to the neighboring communities.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to University College Hospital, Ibadan, here are some helpful things to take along with you:\r\n\r\nMedical files and records.\r\n\r\nAn overnight bag with an extra set of clothes in case you are admitted.\r\n\r\nEducational materials as needed if you're a medical student.\r\n\r\nBest Features\r\nCurrently, the hospital has 850-bed spaces and 163 examination couches. In addition to the undergraduate medical program, the UCH also provides for Postgraduate Residency Training Programmes. Due to the many modern facilities, manpower and track records, the Hospital enjoys wide patronage of both national and international clientele.\r\n\r\nMost common visitors\r\nFor the hospital will be a consultant medical center for the whole country and from the hospital, will go out highly qualified doctors for the service throughout Nigeria-Sir Sydney Phillipson C.M.G","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"48","title":"Federal High Court, Ibadan","content":"Federal High Court, Ibadan is located at New Adeoyo Hospital Road, Off Ring Road, Oyo.\r\n\r\nThis is a premier court of first instance, that is generally a court of original jurisdiction. Headquartered in Abuja, this is the Oyo state division of the court and it is presided over by a Chief Judge who is assisted by other Judges.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nIf you must take it, put your phone on Silent Mode while court is in session\r\n\r\nWhat To Bring\r\nBefore heading to Federal High Court, Ibadan, here are some helpful things to take along with you:\r\n\r\nYour Wig and Black Gown if you are a practicing Lawyer.\r\n\r\nAll documents relating to your case.\r\n\r\nBest Features\r\nIt was originally known as the Federal Revenue Court before it was renamed in 1979\\. It deals and determines causes and matters within the Federal Legislative competence. It is recognizable from the big structure of Lady Justice wielding a sword and a scale that is visible from any part of the court.\r\n\r\nMost common visitors\r\nLegal practitioners, petitioners, and journalists are some of the people that frequent this location.","contentgroup":"Court","travel":"0","favourite":"0"},
{"id":"49","title":"Oyo State NYSC Secretariat","content":"Oyo State NYSC Secretariat is located at Agodi Gate Road, Ibadan, Oyo.\r\n\r\nThis is the administrative office of the National Youth Service Corps in Oyo. It oversees the welfare, documentation and the general affairs of youth corpers in the state.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nAlways come in your NYSC uniform or you won't be attended to\r\n\r\nWhat To Bring\r\nBefore heading to Oyo State NYSC Secretariat, here are some helpful things to take along with you:\r\n\r\nAll documents regarding NYSC including; Call-up letter, Registration documents, School's Certificate, Green Card and Student ID Card\r\n\r\nCopies of Passport Photographs\r\n\r\nYour NYSC ID Card\r\n\r\nBest Features\r\nWhile there are secretariats in all local governments in the state, this is the headquarters and so houses the State Coordinator, along with other high ranking state officials. It is here to report to after your 21 days at the Orientation Camp to get assigned to your Place of Primary Assignment (PPA). Weekly Community Development Service (CDS) are also held here, along with the NYSC sponsored Skills Acquisition Entrepreneurship Development program. This is also where to go if you have inquiries about the NYSC scheme in Oyo State.\r\n\r\nWriter's Review\r\nAs long as you are fully kitted in your NYSC uniform, you have no fear of being turned away. Different people have different tales of how they interacted with the officials and staff but I have found that a smile, knowledge of the local language, and an appealing face helps for a positive interaction. It will be wise to befriend one of the staff as you never know when an inside-ear will be needed.\r\n\r\nMost common visitors\r\nYou will see a lot of Corps members, NYSC staff, SAED Instructors and hawkers here.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"50","title":"Nigerian Institute Of Social And Economic Research  (NISER)","content":"Nigerian Institute Of Social And Economic Research is located at Off Oyo Road, Ibadan, Oyo.\r\n\r\nHistory of Nigerian Institute Of Social And Economic Research\r\nThis was built in 1986.\r\n\r\nFollowing the dissolution of the West African Institute of Social and Economic Research (WAISER), which was established to serve as a Think Tank in the field of social and economic development for the then British West Africa territory, this institute was birthed to constantly monitor development in agriculture, economic, social, governance, physical, human resources and business, and technological aspects of Nigerian society.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"51","title":"Catholic Church of Ascension","content":"Catholic Church of Ascension is located at 1A Paul Hendricks Aare Avenue, New Bodija, Ibadan, Oyo.\r\nThis was built in 1991.\r\n\r\nThere is a great peace that comes with stepping into God's presence in reverence and humility. Here is a Catholic church that transforms one into God's Grace whenever worshipers come together in Holy gathering.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the Catholic Church of Ascension, here are some helpful things to take along with you:\r\n\r\nHoly Bible and Hymn Book\r\n\r\nYour Rosary\r\n\r\nOfferings and Tithes\r\n\r\nThings to do while at Catholic Church of Ascension\r\nThese are the following things you can do while you're here:\r\n\r\nGo for confession\r\n\r\nPartake in Communion service\r\n\r\nBest Features\r\nFeaturing the distinctive elements of a Catholic church's architecture and furnishings, it suffuses one with reverence and humility as you enter. A joyful church where God is exalted and revered, it has a choir that always transports one into the realms of the divine. You can come for the morning and evening mass all through the week. There are specific days for Confessions and Communion. It also has ample parking space for car convenience.\r\n\r\nMost common visitors\r\nIt is a frequented and sacred place of worship for Christians, majorly those of the Catholic faith.","contentgroup":"Religion","travel":"0","favourite":"0"},
{"id":"52","title":"Onigambari Forest Reserve","content":"Onigambari Forest Reserve is located at Ijebu Ode-Idi Ayunre Road, Oyo.\r\n\r\nThis is a forest reserve known for its untamed wildness and the abundance of nature. A place that holds interest because of the different species of trees and plants, it is a great place for nature daredevils who seek a thrilling adventure exploring the wonders of a forest untainted by man.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Onigambari Forest Reserve, here are some helpful things to take along with you:\r\n\r\nCamera to capture the lovely sights.\r\n\r\nIf you're exploring, make sure you take water, compass and mosquito repellents.\r\n\r\nMost common visitors\r\nPhotographers, naure enthusiasts, traditional doctors, farmers, researchers and explorers can be found here.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"53","title":"NYSC Permanent Orientation Camp, Oyo","content":"NYSC Permanent Orientation Camp, Oyo is located at Government Technical College, Iseyin, Oyo\r\n\r\nThis camp ground is where the 3 weeks NYSC Orientation Course takes place. It involves physical drills, lectures and training, and social activities intended to foster interactions among Corpers.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to NYSC Permanent Orientation Camp, Oyo, here are some helpful things to take along with you:\r\n\r\nYour required documents such as Call-up letter, Statement of Result, Student ID Card, etc.\r\n\r\nPassport photographs\r\n\r\nA waist pouch\r\n\r\nWhite tees and shorts\r\n\r\nCash\r\n\r\nHousing necessities\r\n\r\nBest Features\r\nThe camp ground features structures and facilities for paramilitary drills, accommodation rooms, lecture halls, open field for sports and assembly and many of such. There are military personnel who train Corpers on appropriate military ceremonial matching, sports, as well as Man-O-War physical drills. There is the large market operated by the locals popularly called \"Mami Market\" where all camp needs are sold, including food and drinks.\r\n\r\nWriter's Review\r\nIt is said that Orientation Camp is the best part of NYSC, and it is somewhat true. Here, you meet people from all parts of the country and learn and accept local customs and different cultures, make new friends, build camaraderie and learn what to expect during your service year. All through your stay in the camp, except Sunday worship mornings, you will wear your all-white tees, shorts and shoes. You will be served meals thrice daily but most Corpers prefer eating at the Mami Market where the choice and quality of food is better. There is always an activity for each time of the day, with brief moments in the evening allowed for personal use. Go to camp with an open mind and a thirst for adventure and you will enjoy it to the fullest.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"54","title":"Ibadan Home For Motherless Babies","content":"Ibadan Home For Motherless Babies is located at Omolewa Avenue, Dugbe, Ibadan, Oyo.\r\nAiming to prevent infant mortality among children from impoverished homes and motherless children, this is a centre that caters to these children for the first two years of their lives, giving them much needed maternal care and love.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Ibadan Home For Motherless Babies, here are some helpful things to take along with you:\r\n\r\nGifts and donations\r\n\r\nA camera or camera phone if you'll like to capture your time with the kids\r\n\r\nBest Features\r\nTaking note of the special care needed to raise babies, this home is spacious and well-ventilated. It features child wards\/dormitories, kitchen facilities, milk preparation room, a multipurpose hall and an isolation room for children with suspected infectious diseases. A daycare centre was also built in 1995 for children with working mothers. The University College Hospital (UCH) immunizes the babies free, and residents doctors offer free medical inspections and treatment of minor ailments.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"55","title":"Adekunle Fajuyi Cantonment","content":"Adekunle Fajuyi Cantonment is located at Akobo Road, By Alaafia Estate, Ibadan, Oyo.\r\nFormerly known as Odogbo Cantonment, this military base is named after the first military governor of the former Western Region, Nigeria who was assassinated in Ibadan. The camp is a place where troops of various size and complexity in the Nigerian Military and their families live.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nBest Features\r\nIt features housing accommodations for the various military personnel and their families. It also features large open spaces for military drills, healthcare centres, religion centres and educational centres for the residents in the barracks.\r\n\r\nWriter's Review\r\nIt is a serene and quiet place. Apart from the guarantee of safety, one also enjoys the abundant military etiquette displayed in the camp. It is kept clean and noise is kept at a bare minimum. The health centres are also relatively cheaper and less crowded than private and public hospitals respectively. One can also befriend a soldier, enjoy their tales and company and even get fit under military supervision!\r\n\r\nMost common visitors\r\nMilitary personnel and their families mostly. Wandering is highly prohibited","contentgroup":"Government","travel":"0","favourite":"0"},
{"id":"56","title":"Iye Hospital","content":"Iye Hospital is located at 22 Osibodu Layout, Lagos-Ibadan Express, Challenge, Ibadan, Oyo.\r\nThis is a private hospital that provides top-class reproductive medical services to clients using the best professionals available, empowered with appropriate level of technology and continuous training.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Iye Hospital, here are some helpful things to take along with you:\r\n\r\nYour medical reports and documents\r\n\r\nAn overnight bag in case you get admitted\r\n\r\nBest Features\r\nThe hospital aims to become Nigeria's apex reproductive provider of choice by offering specialized and premium medical care in a number of services including Intra Uterine Insemination, In Vitro Fertilization, Ultrasonography, Immunization, Family Planning, Sperm and Egg Freezing, and Obstetrics, among others. With the aid of the most advanced and state-of-art medical equipment, well trained and experienced specialists, and a soothing environment conducive for recuperation, this is one premier hospital known as much for their success rates as their clientele.\r\n\r\nWriter's Review\r\nProviding one of the highest standards in patient care and surgical expertise nationally, they recruit the best hands around. The cheerfulness of the staff, as well as proper explanation for all questions asked builds one's confidence.","contentgroup":"Hospital","travel":"0","favourite":"0"},
{"id":"57","title":"Topside Lounge","content":"Topside Lounge is located at Behind Rehoboth Cathedral, Off Olubadan Avenue, Oluyole, Ibadan, Oyo.\r\nThis is one of the hottest spots in Ibadan where the fun-seekers and party people frequent to blow off some steam, celebrate, enjoy the nightlife and unwind in style.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Topside Lounge, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nCamera to capture the adventures of the night and lovely sights\r\n\r\nBest Features\r\nSelf-styled \"The Playboy's Place\", it is one of the rave spots featuring the best of facilities to attract and keep revelers. Featuring state-of-art sound systems with the perfect lightings, a well-stocked and manned bar that keep the choice drinks flowing, posh chairs and fittings that blends well with the mood of the lounge, a VIP section for the VIPs, and an open space dance floor that usually fills up as the music gets louder, it is no wonder Ibadan night crawlers flock to the lounge when the sun goes down.","contentgroup":"Lounge","travel":"0","favourite":"0"},
{"id":"58","title":"Dominican Institute","content":"Dominican Institute is located at Education Zone, Off Sango-Ojoo Road, Samonda, Ibadan, Oyo.\r\n\r\nA center for theological studies, this is an institution of tertiary education and the first school of higher learning in Nigeria to provide both ecclesiastical and secular education.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Dominican Institute, here are some helpful things to take along with you:\r\n\r\nHoly Bible\r\n\r\nEducation materials\r\n\r\nHousing necessities\r\n\r\nBest Features\r\nRooted in the Catholic tradition that not only recognizes but promotes the dignity and freedom of each human person, the Dominican Institute creates and sustains an ambient that stimulates and promotes growth in all dimensions of the human person. It houses the Dominican Chapel. Asides from promoting teaching and research in Philosophy and Theology, it also awards degrees in them.\r\n\r\nMost common visitors\r\nStudents, scholars, teachers and Christians frequent the institute.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"59","title":"Victory Int'l Church, Rehoboth Cathedral","content":"Victory Int'l Church, Rehoboth Cathedral is located at 1 Victory Avenue, Oluyole Extension, Ibadan, Oyo.\r\nShould you be visiting Ibadan and want to fellowship in a loving, warm and God-filled church, this is a nice Pentecostal church to worship in.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Victory Int'l Church, Rehoboth Cathedral, here are some helpful things to take along with you:\r\n\r\nHoly Bible and Hymn Book\r\n\r\nOfferings and tithes\r\n\r\nBest Features\r\nPulling large numbers of people during service hours, the church doors are wide open to people from all backgrounds, regardless of where they are on their spiritual journey. It is able to accommodate hundreds of worshipers comfortably, and their services are always spiritually uplifting and fulfilling.","contentgroup":"Religion","travel":"0","favourite":"0"},
{"id":"60","title":"The Jericho Mall","content":"The Jericho Mall is located at 20 Kudeti Avenue, Onireke GRA, Ibadan, Oyo.\r\nThis is a mid-size mall that offers prime retail shops and attractions aimed at creating a memorable shopping experience for customers and fun-seekers.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to The Jericho Mall, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nShopping List\r\n\r\nCamera to capture the sights and take selfies with\r\n\r\nBest Features\r\nBuilt with three floors and a basement floor, the mall has a total store number of 47\\. It has two entrances: one at the frontage and the other by the return frontages. It has an escalator that takes visitors effortlessly between floors, and with soft music playing in the background, the mall has the perfect ambient to make shopping with ease a reality. Several uses that range from the food court, restaurants, furniture stores, pharmacy, photo studio, telecom friendship centres, cocktail bar, cloth stores, supermarket, jewelry store, home décor and equipment ice cream parlour, e-banking centres and games arcade, make the mall a delight for every visitor.","contentgroup":"Mall","travel":"0","favourite":"0"},
{"id":"61","title":"Domino's Pizza, Bodija","content":"Domino's Pizza, Bodija is located at 36 Awolowo Avenue, Bodija, Ibadan, Oyo.\r\n\r\nThere are few pleasures that can compare to walking into your favorite restaurant, ordering your choice pizza and drink, and savoring the goodies right there in a warm and relaxing environment. These are what Domino's Pizza offer you and yours, and why they are a favorite in Ibadan.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Domino's Pizza, Bodija, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nCamera for those Insta selfies and food Snaps\r\n\r\nBest Features\r\nLoved around the world, Domino's Pizza is an international name that is synonymous with delicious, quality pizzas. Asides from pizzas, they also serve extras such as chicken, bread, drinks as sides.\r\n\r\nWriter's Review\r\nDomino's Pizza has become a household name in Nigeria, and its unique building design has become somewhat of a landmark. You can sit in and enjoy your goodies or take away. You can also call and order for your pizza and it is usually delivered within 40 minutes. They 'Nigerianized' some of their pizza offerings by creating and including such selections like the Suya Pizza that became instant favorites. It is a nice place to meet and catch up with friends, enjoy the delicious pizzas served and have a fab time.\r\n\r\nMost common visitors\r\nAnybody that likes pizza can be found here.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"62","title":"Domino's Pizza, Ring Road","content":"Domino's Pizza, Ring Road is located at 6 MKO Abiola Way, Ring Road, Ibadan, Oyo.\r\nThere are few pleasures that can compare to walking into your favorite restaurant, ordering your choice pizza and drink, and savoring the goodies right there in a warm and relaxing environment. These are what Domino's Pizza offers you and yours, and why they are a favorite in Ibadan.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nThings to do while at Domino's Pizza, Ring Road\r\nThese are the following things you can do while you're here:\r\n\r\nCash or Debit\/Credit card\r\n\r\nCamera for those Insta selfies and food Snaps\r\n\r\nBest Features\r\nLoved around the world, Domino's Pizza is an international name that is synonymous with delicious, quality pizzas. Asides from pizzas, they also serve extras such as chicken, bread, drinks as sides.\r\n\r\nWriter's Review\r\nDomino's Pizza has become a household name in Nigeria, and its unique building design has become somewhat of a landmark. You can sit in and enjoy your goodies or take away. You can also call and order for your pizza and it is usually delivered within 40 minutes. They 'Nigerianized' some of their pizza offerings by creating and including such selections like the Suya Pizza that became instant favorites. It is a nice place to meet and catch up with friends, enjoy the delicious pizzas served and have a fab time.\r\n\r\nMost common visitors\r\nAnybody that likes pizza can be found here.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"63","title":"Bamboo Towers","content":"Bamboo Towers is located at 1, Trans Amusement Park Road, Ibadan, Oyo.\r\nThis was built. It is notable as an age-long bar close to the University of Ibadan campus\r\n\r\nEnjoy barbecue chicken, Suya and assorted meat locally grilled to perfection. This has become a regular hangout for Ibadan residents. Formerly known as TinTin, its proximity to the university of Ibadan affects greatly the influx of fun lovers as well.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Bamboo Towers, here are some helpful things to take along with you:\r\n\r\nMoney for purchase of drinks and food, the ATM card is also useful in lieu of cash as the POS terminal is active.\r\n\r\nMost common visitors\r\nUniversity students, visitors to the nearby amusement park as well as fun lovers in general.","contentgroup":"Bar","travel":"0","favourite":"0"},
{"id":"64","title":"Kokodome, Ibadan","content":"Kokodome, Ibadan is located at Liebu Bypass, Ibadan, Oyo.\r\n\r\nKokodome runs an amazing nightclub, has a standard swimming pool and serves one of the best barbecue chicken in the state. All these add up to why the club is highly regarding in Ibadan\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Club","travel":"0","favourite":"0"},
{"id":"65","title":"National Archives of Nigeria Ibadan","content":"National Archives of Nigeria Ibadan is located at the Department of National Archives of Nigeria, University of Ibadan, Oyo.\r\n\r\nThis was built in 1954 for the preservation of historical documents.\r\n\r\nBuilt by the British colonial government in 1954.\r\n \r\nThe archive at Ibadan is housed in a large three-story pastel-colored building set in three acres of grounds within the campus area of the University of Ibadan. This is a place for Historians who want to learn more about the history of Oyo state and Nigeria in general, dating back to the colonial period and post-colonial era too, learning more about the wars, heroes of the state and also the history of the great country Nigeria. There is a huge collection of colonial documents as well as a large deposit of official government records in the National Archives, Ibadan.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to the National Archives of Nigeria Ibadan, here are some helpful things to take along with you:\r\n\r\nA jotting note, a camera and possibly a tape recorder in case of interviews\r\n\r\nWriter's Review\r\nit has a large deposit of materials that could help foster one's intellectual capabilities.\r\n\r\nMost common visitors\r\nHistorians, students, and researchers in general.","contentgroup":"Library","travel":"0","favourite":"0"},
{"id":"66","title":"Providence Arena","content":"Providence Arena is located at Joseph Ayoade Avenue By Providence Bus Stop, Off Alao Akala Way, Akobo Ojurin, Ibadan, Oyo.\r\nProvidence is a fully-equipped fitness center with equipment that will make fitness buffs comfortable and overwhelmed. With dedicated and highly experienced professional trainers to help and guide you as you stay fit, you are guaranteed to have your workout worth the while.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"67","title":"Ibadan Railway Station","content":"Ibadan Railway Station is located at Liebu Bypass, Ibadan, Oyo.\r\nThis is an inter-state train station. If you plan on journeying by rail to Lagos and other parts of the country, this is your starting point.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nmoving away from the rail track as far as possible\r\n\r\nMost common visitors\r\nRail Travelers. A handful of ware sellers are domiciled around this place too.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"68","title":"Coldstone Creamy, Ring Road","content":"Coldstone Creamy, Ring Road is located at 6, Ring Road (After Mobil), Ibadan, Oyo\r\n\r\nIf it has anything to do with ice cream, it has everything to do with Cold Stone Creamery. From unique ice cream creations to yogurt, smoothies, cakes, and shakes. Nobody serves up the ultimate indulgence like Cold Stone. It starts with using the highest quality ingredients and ends with their signature process for preparing your custom creation on a frozen granite stone.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Coldstone Creamy, Ring Road, here are some helpful things to take along with you:\r\n\r\nMoney for the purchase of ice cream, the ATM card is also useful in lieu of cash as the POS terminal is active.\r\n\r\nMost common visitors\r\nIce cream aficionados. There is usually a large presence of children and teens as well.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"69","title":"Coldstone Creamy, The Palms Ibadan","content":"Coldstone Creamy, The Palms Ibadan is located at 6, Ring Road (After Mobil), Ibadan, Oyo.\r\nIf it has anything to do with ice cream, it has everything to do with Cold Stone Creamery. From unique ice cream creations to yogurt, smoothies, cakes, and shakes. Nobody serves up the ultimate indulgence like Cold Stone. It starts with using the highest quality ingredients and ends with their signature process for preparing your custom creation on a frozen granite stone.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Restaurant","travel":"0","favourite":"0"},
{"id":"70","title":"Pandora, Ibadan","content":"Pandora, Ibadan is located at The Palms \/Shoprite, Corner of Liberty Stadium Road and Express Road, Ibadan, Oyo.\r\nPANDORA's feminine universe of jewelry is made for you to create and combine. Choose from a wealth of charms, bracelets, rings, earrings, necklaces, and pendants to express your personal style. Every facet and feature of its jewelry is carefully considered before it leaves the hands of the goldsmiths, and they use 14k and 18k gold, sterling silver and carefully selected gemstones, stones and cultured pearls when combining century-old craftsmanship with modern thinking and beautiful design.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to Pandora, Ibadan, here are some helpful things to take along with you:\r\n\r\nMoney for the purchase of jewelry, the ATM card is also useful in lieu of cash as the POS terminal is active.\r\n\r\nMost common visitors\r\njewelry buyers","contentgroup":"Shop","travel":"0","favourite":"0"},
{"id":"71","title":"Mr. Price, Ibadan","content":"Mr. Price, Ibadan is located at Liebu Bypass, Ibadan, Oyo.\r\nMr. Price is a unique shopping store in Nigeria with a huge online store. Although it's the first store opened in 1985 and it only began growing in the 1990s, the success story is much older. It is a story about a struggle against conventional thinking; about a dream to make a difference and a strong will to win against huge odds.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Shop","travel":"0","favourite":"0"},
{"id":"72","title":"PEP Stores, Ibadan Mall","content":"Pep is the largest single-brand retailer across Africa with a footprint in 11 African Countries and a vast number of stores where they often provide a lifeline to local people with affordable, good quality merchandise.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nWhat To Bring\r\nBefore heading to PEP Stores, Ibadan Mall, here are some helpful things to take along with you:\r\n\r\nCash or Debit\/Credit card\r\n\r\nThings to do while at PEP Stores, Ibadan Mall\r\nThese are the following things you can do while you're here:\r\n\r\nEnjoy a lovely time checking out what the stores have to offer and buying as you fancy\r\n\r\nBest Features\r\nPEP product offerings include Clothing, Footwear, Textiles, Homewares as well as a wide range of FMCG Products (Fast Moving Consumer Goods) for convenience shopping.\r\n\r\nWriter's Review\r\nA unique offering from PEP is its Money Back guarantee if a customer is not 100% satisfied with the purchase that was made.","contentgroup":"Shop","travel":"0","favourite":"0"},
{"id":"73","title":"Raypower 95.1, Ibadan","content":"Raypower 95.1, Ibadan is located at Cocoa House, Ibadan, Oyo.\r\nRaypower became an instant success pioneering live radio twenty-four hours a day, seven days a week interactive programming format that promoted immediate feedback on sensitive socio-political, economic and cultural issues. It was a radical departure from what the radio audience in Nigeria had been used to. Raypower is in twelve locations across Nigeria and remains the station of choice by radio listeners. Its \"infotainment\" theme is guided by its development philosophy which is helping to promote national unity and stability as well as foster global understanding.\r\n\r\nSafety\/Security\r\nThis is a very safe location.\r\n\r\nMost common visitors\r\nEntertainers who throng to the radio station for interviews, school children on an excursion, as well as media practitioners of sorts.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"74","title":"Federal College of Forestry, Ibadan  (FCFIbadan)","content":"Federal College of Forestry, Ibadan is located at Jericho, Ibadan, Nigeria, Oyo.\r\n\r\nFederal College of Forestry, Ibadan is a Federal Government-owned tertiary institution located at Ibadan State, Nigeria. It currently runs one program Forest Assistant program the program has been a two-level program, now designated the National Diploma (ND) and the Higher National Diploma (HND) programs, with students running each level of 2 academic years on full time and 3 academic years on part-time.\r\n\r\nSafety\r\n\r\nFederal College of Forestry, Ibadan is very safe.\r\n\r\nThings To Do\r\n\r\nFederal College of Forestry, Ibadan is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nFederal College of Forestry, Ibadan aims to be a foremost institution of distinction, prepared for meeting needs of forestry-related education and research\r\n\r\nBest Time to Visit Federal College of Forestry, Ibadan\r\n\r\nFederal College of Forestry, Ibadan is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Federal College of Forestry, Ibadan\r\nMatriculation is one of the popular events in school for freshers because that's when they get to snap long living memory pictures and the get to celebrate their been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in the Federal College of Forestry, Ibadan are the students and the lecturer's friends and family. Also, researchers visit.\r\n\r\nWhy You Should Visit\r\n\r\nIt is beyond comparison\r\n\r\nWeather at Federal College of Forestry, Ibadan\r\n\r\nFederal College of Forestry, Ibadan is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"75","title":"Federal school of statistics Ibadan  (FSS Ibadan)","content":"Federal school of statistics Ibadan is located at University Of Ibadan-Ajibode Road, Ibadan, Nigeria, Oyo.\r\n\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"76","title":"Ibarapa Polytechnic  (Ibarapa Poly)","content":"Ibarapa Polytechnic is located at Eruwa, Nigeria, Oyo.\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"77","title":"Federal College of Animal Health and Production Technology, Ibadan  (FCAHPT Ibadan)","content":"Federal College of Animal Health and Production Technology, Ibadan is located at Moor Plantation, Apata, Ibadan, Oyo.\r\n\r\nFederal College of Animal Health and Production Technology is a Federal-Government owned tertiary institution located at Moor Plantation, Apata, Ibadan, Nigeria. It offers both a National Diploma and Higher National Diploma. National Diploma has four departments which are: Computer Science, Fisheries Technology, Science Laboratory Technology, and Animal Health and Production Technology. And the Higher National Diploma has three departments which are; Agricultural Extension & Management, Animal Production Technology, and Animal Health Technology\r\n\r\nSafety\r\nFederal College of Animal Health and Production Technology, Ibadan is very safe.\r\n\r\nThings To Do\r\n\r\nFederal College of Animal Health and Production Technology, Ibadan so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nThe Vision of the Federal College of Animal Health and Production Technology, Ibadan is to be a world-class Training Institution in the area of Science and Modern Agricultural Development Technology in a changing environment.\r\n\r\nBest Time to Visit Federal College of Animal Health and Production Technology, Ibadan\r\n\r\nFederal College of Animal Health and Production Technology, Ibadan is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Federal College of Animal Health and Production Technology, Ibadan\r\n\r\nConvocation and Matriculation is a yearly event that is held for both incoming and outgoing students. Matriculation is one of the popular events in school for freshers because that's when they get to wear beautiful dresses and snap long living memory pictures and they get to celebrate their being in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in Federal College of Animal Health and Production Technology, Ibadan are the students and lecturer's friends and family. Also, researchers visit.\r\n\r\nWhy You Should Visit\r\nIt's okay and affordable\r\n\r\nWeather at Federal College of Animal Health and Production Technology, Ibadan\r\n\r\nFederal College of Animal Health and Production Technology, Ibadan is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"78","title":"The Polytechnic, Ibadan  (Ibadan Poly)","content":"The Polytechnic, Ibadan is located at Polytechnic Road, Sango, Ibadan, Nigeria, Oyo.\r\n\r\nThe Polytechnic Ibadan has been in the business of training, imparting knowledge and building a career and it is our joy that our products are holding key places in diverse sections all over the world. The primary function of the Polytechnic is to provide for students' training and development of techniques. It currently has five departments which are: Engineering, Science, Environmental Studies, Financial and Management Studies and Business and Communication Studies.\r\n\r\nSafety\r\nThe Polytechnic, Ibadan is very safe.\r\n\r\nThings To Do\r\n\r\nThe Polytechnic, Ibadan is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\nThe Polytechnic, Ibadan want to provide training and development of techniques for students.\r\n\r\nBest Time to Visit The Polytechnic, Ibadan\r\nThe Polytechnic, Ibadan is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at The Polytechnic, Ibadan\r\nMatriculation is one of the popular events in school for freshers because that's when they get to wear and snap long living memory pictures and the get to celebrate they been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in The Polytechnic, Ibadan are the students and the lecturer's friends and family. Also, researchers visit.\r\n\r\nWhy You Should Visit\r\nThis is one of the great citadels of education in Nigeria, with an organized body of lectures and lecturers. Students who hail from this school are likely to be the best in the job market. They teach great courses with very interesting topics and are practically inclined.\r\n\r\nWeather at The Polytechnic, Ibadan\r\n\r\nThe Polytechnic, Ibadan is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"79","title":"Ibadan City Polytechnic","content":"Ibadan City Polytechnic is located at Alakia Road, Egbeda, Ibadan, Oyo, Nigeria, Oyo.\r\nIbadan City Polytechnic is a privately-owned tertiary institution located in Oyo State, Nigeria. It currently has three faculties which are; School of Social Science and Management, School of Engineering Technology and School of Applied Science.\r\n\r\nSafety\r\n\r\nIbadan City Polytechnic is very safe.\r\n\r\nThings To Do\r\n\r\nIbadan City Polytechnic is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Time to Visit Ibadan City Polytechnic\r\n\r\nIbadan City Polytechnic is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Ibadan City Polytechnic\r\n\r\nMatriculation is one of the popular events in school for freshers because that's when they get to wear matriculation gowns and snap long living memory pictures and the get to celebrate their been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and their is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in Ibadan City Polytechnic are the students and the lecturer's friends and family. Also, researchers visit.\r\n\r\nWhy You Should Visit\r\n\r\nA private polytechnic to study\r\n\r\nWeather at Ibadan City Polytechnic\r\n\r\nIbadan City Polytechnic is located at Ibadan which is in the South-West region of the country. This region experiences two seasons which are the rainy and dry season. The rainy season come heavily from the month of May, June, July. While the dry season usually comes between the month of October up until April","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"80","title":"Tower Polytechnic, Ibadan  (Tower Poly)","content":"Tower Polytechnic, Ibadan is located at Ire Akari Estate, Off New Garage Expressway, Ibadan, Oyo.\r\nTower Polytechnic is a privately-owned tertiary institution located at Ibadan, Nigeria. It currently has three faculties which are: School of Management and Financial Studies, School of Applied Sciences and School of Engineering.\r\n\r\nSafety\r\n\r\nTower Polytechnic, Ibadan is very safe.\r\n\r\nThings To Do\r\n\r\nTower Polytechnic, Ibadan is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nOver the years, Tower Polytechnic has invested heavily in research, teaching and learning facilities, human resources development and establishing mutually beneficial relationships with industries.\r\n\r\nBest Time to Visit Tower Polytechnic\r\n\r\nTower Polytechnic, Ibadan is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at Tower Polytechnic\r\n\r\nThe most popular events in school are Matriculation and Convocation which comes up yearly. Matriculation is one of the popular events in school for freshers because that's when they get to wear beautiful dresses and snap long living memory pictures and the get to celebrate their being in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and there is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in Tower Polytechnic are the students and the lecturer's friends and family. Also, researchers visit.\r\n\r\nWeather at Tower Polytechnic\r\n\r\nTower Polytechnic is located in the South-West part of Nigeria. This region has just two seasons which are the dry and rainy season. The rainy season comes from the month of May till early August while the dry season comes from the month of October till April. Usually, between the month of December and February Harmattan comes along.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"81","title":"The Oke-Ogun Polytechnic, Saki  (TOPS)","content":"The Oke-Ogun Polytechnic, Saki is located at Along Agaw-Are Saki Road, Saki, Oyo.\r\n\r\nThe Oke-Ogun Polytechnic is a Federal-State owned tertiary institution located at Saki, Ibadan-State, Nigeria. It currently has twelve departments which are: Accountancy, Agricultural and Bio-Environmental Engineering \/ Technology, Agricultural Technology, Architectural Technology, Banking And Finance, Building Technology, Estate Management, And Valuation, Insurance, Public Administration, Quantity Surveying, Science Laboratory Technology, and Urban and Regional Planning.\r\n\r\nSafety\r\n\r\nThe Oke-Ogun Polytechnic, Saki is very safe.\r\n\r\nThings To Do\r\n\r\nThe Oke-Ogun Polytechnic, Saki is a learning institute so what you should bring along are your reading and writing materials to aid you academically.\r\n\r\nBest Features\r\n\r\nThe Oke-Ogun Polytechnic, Saki promotes technical, science, engineering and business education; training innovative, responsive, appoint-able and self-reliant middle-level manpower and technocrats.\r\n\r\nBest Time to Visit The Oke-Ogun Polytechnic, Saki\r\n\r\nThe Oke-Ogun Polytechnic, Saki is best visited when it's in session as it's when the school is lively and alive.\r\n\r\nPopular Events at The Oke-Ogun Polytechnic, Saki\r\n\r\nMatriculation is one of the popular events in school for freshers because that's when they get to wear matriculation gowns and snap long living memory pictures and the get to celebrate they been in school. Likewise, Convocation is one of a popular event in school where final year students final get their certificates and their is an award for the best graduating student.\r\n\r\nMost Common Visitors\r\n\r\nMost common visitors in The Oke-Ogun Polytechnic, Saki are the students and the lecturer's friends and family. Also, researchers visit.\r\n\r\nWhy You Should Visit\r\n\r\nOne of the best learning Institute in Nigeria\r\n\r\nWeather at The Oke-Ogun Polytechnic, Saki\r\n\r\nThe Oke-Ogun Polytechnic is located at Ibadan which is in the South-West region of the country. This region experiences two seasons which are the rainy and dry season. The rainy season comes heavily from the month of May, June, July. While the dry season usually comes between the month of October up until April","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"82","title":"Forestry Research Institute of Nigeria  (FRIN)","content":"Forestry Research Institute of Nigeria is located at Frin Road Jericho, Ibadan, Oyo.\r\n\r\nThe Federal Research Institute of Nigeria is responsible for ensuring sustainable forest resource management and production, food production\/security,forest-based industrial raw material provision, utilization, Bio-diversity conservation, self-employment opportunities and poverty alleviation through scientific means. It is located at Frin Road, Jericho Ibadan.\r\n\r\nSafety\r\nThere is no threat to security here.\r\n\r\nBest Time to Visit The Federal Research Institute of Nigeria\r\nThe best time to visit is during the afforestation.\r\n\r\nMost Common Visitors\r\nThe most common visitors are government officials.\r\n\r\nWeather at The Federal Research Institute of Nigeria\r\nForestry Research Institute of Nigeria is located in Oyo state which is in the South-West region of the country. This region experience two seasons which are the rainy and dry season. The rainy season come heavily from the month of May, June, July. While the dry season usually comes between the month of October up until April.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"83","title":"Command Secondary School Ibadan","content":"Command Secondary School Ibadan is located at Ibadan, Nigeria, Oyo.\r\nSafety\/Security\r\nThis is a very safe location.","contentgroup":"Education","travel":"0","favourite":"0"},
{"id":"84","title":"Trans Amusement Park","content":"Trans Amusement Park is located at Ibadan, Nigeria, Oyo.\r\n\r\nA fun place to be with loads and lots of activities to partake in. There is a lawn that is trimmed and taken care of regularly which has a sitting area where guests can relax and take in the ambiance of the surrounding. There are a lot of facilities here to make sure you have an unforgettable experience. There is the electronic car, dragon wheel, panoramic wheel to just mention a few. There is also an ice creamery on-site.\r\nSafety\r\nThere is no threat to safety here.\r\nThings to Bring\r\nBefore heading to Trans Amusement Park, here are a few things to take along; a good camera, cash or credit\/debit card.\r\nWhat to Do\r\nRide on the variety of joy rides at the park.\r\nBest Features\r\nVariety of rides to make the whole experience fun and the ice creamery on-site.\r\nBest Time to Visit Trans Amusement Park\r\nThe best time to visit the trans amusement park is during the weekends when there will be a lot of families at the park.\r\nMost Common Visitors\r\nThe most common visitors at the park are families, photographers and fun lovers.\r\nWhy You Should Visit\r\nTo have a good time with family and friends.\r\nWeather at Trans Amusement Park\r\nTrans Amusement Park is located in the South-West region of Nigeria usually has two kinds of seasons which is the dry which comes during the month of October right until April and the rainy season which comes during the month of May right until August. The place can be very cold during the harmattan period which comes during the dry season.","contentgroup":"Sport","travel":"0","favourite":"0"},
{"id":"85","title":"Ado Awaye Suspended Lake  (Iyake Lake)","content":"Ado Awaye Suspended Lake is located at ado-awaye, Iseyin, Oyo.\r\n\r\nEver heard of a suspended lake? The Iyake lake is only one of two suspended lakes in the world and the only of such in Africa, the other suspended lake is the 'Hanging Lake' in Colorado. Cool right? The Ado Awaye Lake is found at the top of the Oke-Ado mountain. To get to this lake, you have to climb 369 man-made steps. The lake is known for its spiritual importance, it is believed that whatever prayer that is done at the lake would be answered, it is also believed that any barren woman who drinks from the lake would immediately get fertile. Also, it is a taboo to swim or bathe in the lake as it is believed that whoever does this would find himself in another planet. \r\n\r\nSafety\r\n\r\nThis is a very safe location but guests are advised to not swim in the lake. There is popular folklore about a white man disobeying these orders and disappearing.\r\n\r\nThings to Do\r\n\r\nDrink from the lake, camping, hiking, sightseeing is just some of the things to do at the lake.\r\n\r\nWhat to Bring\r\n\r\nBefore heading to the Iyake Lake, here are some helpful things to take along with you; hiking boots, picnic set, bottle, food, and drinks - there might not be a place for you to get this around, camera to take amazing photos of the landscape and take selfies with.\r\n\r\nBest Features\r\n\r\nIt has a beautiful breathtaking landscape, the lake is clear and neat, there are other attractions like elephant tree and share rock and footprints of the elders.\r\nBest Time to Visit Ado Awaye Suspended Lake\r\nThe best time to visit Ado Awaye Lake is during the day when there are tour guides to take you around and tell you stories of the lake.\r\n\r\nMost Common Visitors\r\n\r\nThe most common visitors at the lake are villagers, researchers, fun lovers, nature enthusiasts. \r\n\r\nWhy You Should Visit\r\n\r\nTo get enlightened with the folklore of the lake and have fun.","contentgroup":"Places","travel":"0","favourite":"0"},
{"id":"86","title":"The Orchard Hotel (onireke, Ibadan.)","content":"The Orchard Hotel is a 3-Star hotel situated opposite NDLEA, by Golf Club, Onireke GRA, Ibadan, Oyo state. It provides a great place for rest considering that it is domiciled in the serene Government Residential Area of the State.Rooms at the Orchard Hotel are grouped into: Standard, Deluxe room and the Executive Suites. These rooms feature facilities such as: luxurious king-size beds, sofas and centre tables, refrigerators, Wireless internet connection, flat screen television sets, en-suite bathrooms with shower facilities and complimentary toiletries, telephone, air conditioning, work desks and tables, and wardrobes. Orchard Hotel also offers guests great hospitality services like: steady power supply, a restaurant with an array of excellent tasting dishes, bar\/lounge with a collection of choice beverages, ample parking space, top notch security facilities, and a well-equipped gym.\r\nExtra services like airport shuttle, car hire, Laundry and concierge services can also be facilitated at the Orchard Hotel.  AVG PRIICE\/NIGHT: N7000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"87","title":"Joybam hotel Ibadan","content":"Joybam Guest House is located at Second Gate, behind Liberty Stadium, Oke-Ado, Ibadan. It is well known to be in proximity to the Liberty Stadium. It provides a peaceful and serene environment where you can rest assured of a nice stay.\r\nThere are various categories of rooms offered by Joybam Guest House ranging from Single to Standard, Executive and Royal. The prices of each room vary according to the category it belongs to. The facilities offered By Joybam Guest House to its customers cover the following: a living room, a TV with satellite reception, a desk, a chair, a bedside fridge, a king-sized bed for comfort, a standing fan and an air conditioner to keep you cool. It has a balcony for each room from where you can view your surroundings while having a nice time.\r\nThe guest house offers a 24-hour power supply with a standby generator. It provides a restaurant and a bar in proximity to the restaurant; both will give you a deserved awesome time at an affordable price.\r\nJoybam Guest House provides free parking spaces and maximum security, with a 24-hour round-the-clock service and dry cleaning services which come at a fee. AVG PRICE\/NIGHT: N5000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"88","title":"LIVE OAK SUITES Ibadan","content":"Live Oak Suites is a 3-Star hotel located at 8, Alabiamo Street, off Awolowo Avenue, Old Bodija, Agodi, Ibadan, Oyo State. It is positioned just 45 minutes away from the popular University of Ibadan Zoo.Live Oak Suites has a variety of rooms: Luxury Single room, Deluxe Executive room, Royal suite, and the Supreme VIP room. Each room is furnished with a refrigerator, en-suite bathrooms, flat screen TV with cable TV, worktable, air-conditioner, and small wardrobes. The rooms have Wi-Fi internet connection. Some of the rooms have a sofa and a table for additional relaxation. Some of the facilities available at Live Oak Suites are: A restaurant, a bar and a gym. Live Oak Suites offers additional services on requests: Laundry service, airport shuttle, free parking, 24 hours front desk service, car hire service, and storage room. AVG PRICE\/NIGHT: N6000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"89","title":"Carlton gate hotel Ibadan.","content":"Located in the heart of Ibadan City at Quarters 860, Agodi GRA, Ibadan, Carlton Gate Hotel is a majestic establishment that houses a variety of top class facilities. It is ideal for leisure and business guests. All rooms at Carlton Gate Hotel Ibadan are spacious, painted in earth-toned colour, and fitted with modern interior decor. The room categories are: Superior Room, Executive Room, Deluxe Studio, Business Suite, Royal Suite and Presidential Suite. Each room features an air conditioner, a work desk with a chair, a cable flat-screen TV, wall paintings, a wardrobe, and an en-suite bathroom. The Presidential room has a separate living room designed with a plush sofa. All guests have access to a free Wi-Fi connection. At Carlton Gate Hotel Ibadan, complimentary breakfast is served daily. Guests can enjoy local and continental dishes at the onsite restaurant. Outdoor dining is available by the poolside. Guests can also order drinks from either the pool bar or the onsite bar. It also features a business centre, event facilities, and a banquet facility ideal for workshops and seminars.Laundry\/dry cleaning, ironing, babysitting, housekeeping, newspaper delivery, car hire, and airport pickup services are provided upon request. Guest may also make use of the storage room, safety and deposit boxes onsite. Nearby parking is available. The premises are guarded by trained security personnel. AVG PRICE\/NIGHT: N20700","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"90","title":"Ayotaz hotel Ibadan","content":"Ayotoz hotel is located at 3, Adegbite Street, opposite Kenny Gee Plaza, UI Gate, Oyo. Guests enjoy a blend of comfort and style in the affordable lodgings and services provided. Ayotoz Hotel is close to University Of Ibadan and the Ibadan Shoprite. Its lodgings are spacious and fitted with basic amenities. Depending on the room size and guests' needs, the rooms fall into Single Room (With A\/C) and Single Room (Without A\/C) categories. The private bathroom has a well-maintained shower and toilet. Toiletries are also provided. Guests can keep themselves entertained with the TV in the rooms. A fan or air conditioner is provided for guests to feel cool and refreshed. Guests can carry out their work using the reading table in the rooms. Tasty African delicacies can be ordered at the restaurant. Guests can make their occasions memorable by using the event facility. The bar is stocked with alcoholic and non-alcoholic drinks. Ayotoz Hotel renders laundry\/dry cleaning, car hire, room service, concierge, storage room and ironing services. A spacious parking space is available and guests enjoy a 24-hour power supply. The hotel premises are guarded by security personnel. AVG PRICE\/NIGHT: N3000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"91","title":"Capital Inn plus Ibadan","content":"Capital Inn Ibadan is a classy hotel located in 8-10 7th Ave, Oluyole Estate, Ring Road, Oyo, Nigeria. Free WiFi access, outdoor pool and a restaurant are all available. Each room here will provide you with a TV, air conditioning and a minibar. Complete with a refrigerator, the dining area also has a coffee machine. Featuring a spa bath, private bathroom also comes with a shower. Extras include an iPod dock, a seating area and satellite channels. At Capital Inn Ibadan you will find a fitness centre.Other facilities offered at the property include meeting facilities, a shared lounge and shops (on site). Additional services rendered at the hotel include car hire, laundry\/dry cleaning, luggage storage, car hire. Guests can park with ease at the parking space which is entirely free of charge. Capital Inn is always heavily guarded. AVG PRICE\/NIGHT: N20000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"92","title":"Travel house Ibadan","content":"Travel House Ibadan is situated at No 22A, block X, MKO Abiola way before access bank, Mobil ring road, Ibadan. It has Standard Double rooms that feature amenities such as: king-sized beds, flat-screen television sets with multi-channel satellite subscription, en-suite bathrooms with stand-in showers, wireless internet connectivity and writing desks and chairs. Travel House Ibadan also offers guests services like: a restaurant with a menu of local and international great tasting dishes plus complimentary breakfasts; bar\/lounge with an assortment of in-demand beverages; top security arrangement; regular power supply; ample parking space; conference facilities; a luggage storage; room service and in-house dining. AVG PRICE\/NIGHT:N15000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"93","title":"The SU guest house Ibadan.","content":"SU Guest House is a budget hotel located at Opposite Old Airport Road, Samonda, Ibadan, Oyo State, Nigeria. The hotel offers affordable accommodation to guests. The nearest airport is Ibadan Airport, 30-minutes drive away. Guests will enjoy an exclusive view of the hotel during their stay. Each room at SU Guest House has an air conditioner, quality bedding, an inter comm telephone, a ceiling fan, and a refrigerator. Also available at the hotel are wireless internet and in-house dining, as there is no restaurant on site. Services available include room service, concierge services, and laundry services In addition, guests can also enjoy 24-hour front desk, free parking, and shuttle services on request. AVG PRICE\/NIGHT: N5775","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"94","title":"77 PALMS HOTEL Ibadan","content":"A contemporary high-end boutique hotel, Palms 77 Hotel provides a standard accommodation for local and international visitor at 67\/68 adjacent Army Officers' Mess, Agodi- Ikolaba, Ibadan. As a new entrant with modern state-of-the-art facilities, it treats its guest to grand sweeping spaces with the bedroom, living area and an extravagant private infinity pool. Palms 77 Hotel Ibadan has a total 55 rooms in 7 categories, namely – Standard, Deluxe, British Standard, Studio, Superior, Twin Bed, Diplomatic Suite and the Presidential Suite. Each beautifully decorated room has a king-size bed, armchairs, writing desk and chair, air conditioner, Wi-Fi services, lamps, telephone, toiletries, an en-suite bathroom and flat screen TV with cable channels. Guests at Palms 77 Hotel also get a complimentary breakfast and newspaper. The restaurant and bar offer a comprehensive list of local and Intercontinental cuisines, alcoholic and non-alcoholic drinks at an affordable price. A lounge and the poolside bar are available for intimate gatherings and parties. The hotel also has a multipurpose hall and meeting room which is ideal for wedding receptions, conference, seminars and lectures. Other facilities and services at Palm 77 Hotel Ibadan include the swimming pool, gym, spa, salon, make-up studio, car rental, laundry services, room service, parking space and security. AVG PRICE\/NIGHT: N16560","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"95","title":"Kakanfo inn and conference centre Ibadan","content":"Located in a serene and quiet area, Kakanfo Inn and Conference Center is situated at 1 Nihinlola Street, Off Mobil Petrol Station, Off Joyce'B Area GPO 1783 Ring Road, Ibadan. This hotel is appropriate for mini vacations, business travels, and romantic getaway.Every room is furnished with an air conditioner, refrigerator, flat screen TV with cable connection, work desk, intercom and wall portrait. The en-suite bathroom is equipped with a shower and complimentary toiletries. The rooms can be classified into Regular room,Autograph superior,Autograph executive and Autograph suite.   The total number of rooms are ninety-three(93) Nigerian and international cuisines are available at the restaurant; the bar is well stocked with varieties of beverages. Guests can also take out time to enjoy an afternoon in the swimming pool or just relax by the poolside. At the cool of the day, the guests can use the nightclub. Dry cleaning, airport pickup, car hire, and concierge are additional services available at a surcharge fee. The event facility can be booked for both corporate and social functions. On-site parking space is ample. AVG PRICE\/NIGHT: N21840","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"96","title":"Babcock guest house llisha-remo","content":"Babcock Guest House Ogun is a 3-Star hotel located within the Babcock University Campus at Ikenne Isara Road, Ilishan Remo, Ogun State.  Babcock Guest House offers exquisitely furnished rooms with state-of-the-art facilities aimed at giving guests an excellent and refreshing experience. The rooms come in Standard, Junior Deluxe, Twin room, Senior Deluxe, Executive Deluxe, Kings deluxe, and the Imperial suite. Each room at Babcock Guest House comes with a coffee bar, air conditioning, free internet, flat screen television set with Dstv subscription, tastefully furnished bathroom, luxurious bedding, in-room safe and an electronic door. There is complimentary Babcock water for guests at check in. Other services available to guests at Babcock Guesthouse include: Gym facilities, swimming pool, cyber cafe, adequate security complimented by electric fencing, bar and lounge, restaurant, uninterrupted power supply, parking garage and laundry service. Babcock Guest House offers guests an array of extra services which include: 24-hour housekeeping service, taxi pick up, gift shop, car rental, live band entertainment, table tennis facilities, Karaoke, elevator, and spa treatment. AVG PRICE\/NIGHT: N15000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"97","title":"Remo Majestic hotel Sagamu, Ibadan","content":"Remo Majestic Hotel is a 2-Star hotel situated along Afolabi Kehinde Avenue, off Sagamu\/ Benin Expressway, Sagamu, Ogun State. The Remo Majestic Hotel offers rooms in the categories of Executive, Ambassador, Luxury, Atlantic Standard, Presidential Suite, Atlantic Superior, and Atlantic Suite. Rooms at Remo Majestic Hotel come with amenities such as flat screen television sets, sofa and centre table, arm chairs and desks, refrigerators, private bathrooms with stand-in shower facilities, intercom system, plush beds, and wireless internet access. Sufficient parking space, a restaurant with a menu of great tasting dishes, a bar\/lounge, fitness centre and gym, uninterrupted power supply, conference and event hall facilities, and adequate security are available to guests at the Remo Majestic Hotels. AVG PRICE\/NIGHT: N6000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"98","title":"Ladgate hotel Abeokuta","content":"Ladgate Hotel is located Plot 9, Kemta Igiaba Housing Estate, Abeokuta, Ogun, Nigeria. Located in the ancient yet beautiful city of Abeokuta, the hotel welcomes both residents and visitors. Equipped with adequate facilities for meeting basic leisure needs.  Ladgate Hotel has well-furnished rooms of varying categories and layouts. The categories of rooms are: Studio, Standard Studio, Standard Double Room and Executive Double. These rooms are exquisite, elegant and feature modern in-room amenities. They are fully air-conditioned with tiled floors, a king-size bed, a flat-screen TV with cable channels, a standing fan, work desk, fridge, armchairs as well as an en-suite bathroom with shower. Ladgate Hotel has put in place a number of facilities, which include: 24-hour hospitable front desk service, an ample parking lot, 24-hour electricity and security, restaurant where guests can order from a variety of both local and continental well-prepared delicacies and a bar where both alcoholic and non-alcoholic drinks are served. Ladgate Hotel offers special services upon requests: laundry\/dry cleaning services, ironing services, luggage storage and concierge services.","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"99","title":"Koltol guest house Ibadan","content":"Koltol Guest House is located in the heart of Ibadan city; a 5-minute drive from the Governor's House. Koltol Guest House guarantees a warm reception and excellent hospitality. It is situated at 13, Ajayi Oshungebkun Avenue, Agodi, GRA, Ibadan, Nigeria. Rooms available at the hotel are categorised into Standard Double, Executive Double, Super Executive Double, Super Executive Special, Royal Executive Double, Royal King Size and the Suite. Each room is well furnished, fitted with a cable enabled flat screen TV, refrigerator, a desk with chair and is fully air-conditioned with an en-suite bathroom with a shower. Guests can enjoy relaxing swimming sessions at the outdoor pool. You can also keep fit at the hotel's well-equipped fitness centre. Free Wi-Fi and on-site parking are also available. An array of traditional Nigerian meals and drinks can be ordered at the on-site restaurant and bar. To ensure maximum security, CCTV cameras are placed at strategic points. It has a fully equipped event hall which can be used for various occasions. Koltol Guest House offers uninterrupted power supply and 24-hour room service. Onsite parking is available. The hotel also renders laundry\/dry cleaning, ironing, indoor and outdoor catering services. AVG PRICE\/NIGHT: N9000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"100","title":"Golden Tulip Ibadan Ibadan","content":"Golden Tulip Ibadan is a top-class hotel located at Quarter 781, G.R.A, Jericho, Ibadan, Oyo State, Nigeria. The hotel offers classy accommodation to guests and is 1-hour drive from U.I Zoological Gardens. Guests will enjoy the culture, tourism and rich history of the people in Oyo. Each room at Golden Tulip Ibadan has a full work desk, an air conditioner, free wireless internet, a set of bathrobes, cable connected LCD TV sets, and 24 hours electricity.\r\nAlso available at the hotel are a gift shop, a restaurant, an elevator\/lift, business center, and an event hall. Guests can enjoy a variety of intercontinental and local cuisines. Services available include room service, luggage storage, free parking, concierge services, laundry and dry cleaning services.\r\nIn addition, guests can also enjoy Airport shuttle services on request. AVG PRICE\/NIGHT: N45000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"101","title":"Premier hotel Ibadan","content":"Elegantly perched atop the famous Mokola Hill is Premier Hotel, a subsidiary of the Odua Group. Its magnificent structure presents a good sight both day and night while the serene environment and comfortable lodgings are tailored to deliver maximum guests' satisfaction. This 3-Star hotel is strategically situated at Oremeji, Mokola Hill, Ibadan, Oyo, Nigeria, 14km away from Ibadan Airport. This hotel's location also provides easy access to major attractions and business districts in Ibadan, making it a good place to stay for tourists and business travellers. Premier Hotel's storeyed edifice has an elevator installed and houses spacious and well-furnished rooms. Room types are Classic, Deluxe, Executive Deluxe, Business Suites, Executive Suite B, Diplomatic Suite and Oduduwa Luxury Suite. All rooms are en-suite and equipped with smoke detectors, bedside tables, satellite TV sets and air conditioners. All suites have separate dining and TV lounge area. Complimentary breakfast is provided for 1 occupant. Wifi connectivity is available in all the rooms. Premier Hotel's in-house chefs ensure both local and continental culinary needs of guests are well attended to while the exotic bar has varieties of drinks stocked. The terrace garden also presents a perfect relaxation spot where guests can have snacks. Premier Hotel has a tea\/coffee shop and pastry shop open to guests. Other facilities include an outdoor swimming pool, a body spa and fitness centre. Banquet halls with different seating capacities are available at fixed rates. Airport shuttle, safety deposit, laundry, car hire, room service, concierge, storage room and business centre services are available on request. AVG PRICE\/NIGHT: N16560","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"102","title":"Leisure spring hotels Oshogbo","content":"For a budget hotel situated in a calm and serene environment, Leisure Spring Hotels provides quality hospitality services and ensures that guests get more than enough value for their money. Past guests have felt the need to prolong their stay because of the excellent services and facilities that the hotel has got to offer. It is situated at Km 5, Iwo Oshogbo Road, Oshogbo. The comfortable and affordable lodgings offered by Leisure Spring Hotels are categorised into Studio Room, Standard Single, Special Single, Executive Double, Kings Double, Mini Suite, Royal Deluxe, Business Suite, Presidential Suite, Leisure Suite, Pent House and Monarchial Suite. The rooms are beautifully designed and come with exotic paintings. The rooms are fitted with king-sized beds, safes, telephones, study desks, wardrobes, and air conditioning units. There are sofas in these rooms. A fridge and a TV with satellite reception are available in each of the rooms. Facilities that have been put in place to make guests have a memorable and relaxing stay include a swimming pool, a gym, a restaurant and a bar. A meeting hall is also available for holding training, presentations and seminars. Free Wi-Fi access is also provided for in the rooms so guests can stay connected to the internet at all times. Laundry\/dry cleaning services are available to guests who would like to get their laundry done on-site. 24 hours room service is available on request. Leisure Spring Hotels has made provisions for a free parking space on-site. A security guard is always on ground to guard the hotel premises. Effective measures such as a standby generator have been put in place so guests can enjoy 24 hours power supply. AVG PRICE\/NIGHT: N6500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"103","title":"Owu crown hotel Ibadan","content":"Laced with an alluring ambience and state-of-the-art facilities, Owu Crown Hotel offers a warm hospitality along Km 2 Monatan Iwo Road Dual Carriage, Ibadan, Oyo State. Owu Crown Hotel has 76 rooms which are categorised into Standard, Superior, Deluxe room, Suites, Apartment, Presidential and Royal Corner. Each of these tastefully furnished rooms is equipped with top class conveniences which include wireless Internet connectivity, a TV system which allows each guest on request to view particular films on their TV screens, air conditioning unit, lamps, chairs and tables, direct-dial telephone, mirror, kettle, hair dryer and private bathroom. The Presidential suite has a kitchenette en-suite and 2 bedrooms for children or aides. The on-site restaurant serves a wide variety of local and international dishes. Guests can order snacks, cocktails, and soft drinks at the poolside bar. It houses an outdoor pool which is flanked by recliner seats; it also has a well-equipped gym. Guests can also enjoy complimentary breakfast. Owu Crown Hotel boasts a well-furnished boardroom which can conveniently seat up to 20 people at a time and also a conference room that can seat up to 80 people. It is equipped with projector and whiteboard. Car hire, laundry, and parking services are available. Security personnel guard the hotel's premises round-the-clock. It has an adequate parking space. AVG PRICE\/NIGHT: N22500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"104","title":"Carlton gate xclusive Jericho GRA, Ibadan.","content":"Carlton Gate Xclusive Hotel is a top-class hotel located at 853 Beside Senior Citizen Club Secretariat Road, Ibadan, Oyo, Nigeria. Its location which is in close proximity to various leisure centres and business outlets. It is a top destination for business and leisure travelers and guests are offered free access to WiFi services at the hotel. Carlton Gate Xclusive Hotel has a lot of rooms all with modern furnishing. Room categories include the Business Mini Suite (Asiwaju Floor), Business Mini Suite (Exclusive Floor), Business Mini Suite with View (Asiwaju Floor), Business Mini Suite with View (Exclusive Floor), Royal Suite (Exclusive Floor) and Presidential Suite. Some rooms have a view as stated for overlooking the beautiful environment. Each room features a spacious bathroom, king-sized beds, cable connected LCD TV sets, refrigerators and air conditioners. A number of facilities are available Carlton Gate Xclusive Hotel. These include free WiFi, a swimming pool, Conference Hall, Event Centre, Gym, a restaurant and a bar. Guests at this hotel will have more time to enjoy their stay at the hotel. Guests can also take relaxing dips in the pool. The on-site restaurant at Carlton Gate Hotel offers a fantastic variety of meal options, at the best price. The restaurant is open all week to all guests. Lunch is served daily between 12 to 2.30 pm daily and 3pm on Sundays. You can enjoy the two or three course meal options, with evening meals starting at 6:30 pm. On weekend, special buffet breakfast service is provided. The hotel offers additional services on request such as 24-hour front desk, shuttle service, Luggage storage, Express check-in\/check-out, Cleaning services, Ironing service, Dry cleaning\/Laundry service and Conference Facilities. This is a popular destination families on vacation as well as men and women on official business in Nigeria. It is relatively cheaper than other Hotels in its category. AVG PRICE\/NIGHT: N24800","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"105","title":"Check-inn hotel Ibadan","content":"Check Inn Hotels is a traveller-friendly hotel situated in the lively downtown area of Check-Inn Close, behind Airtel head office, off Secretariat\/U.I Road, Bodija, Ibadan. It is close to Agodi Gardens, a tourist attraction -with diverse tropical trees- often visited by families during festive periods and leisure weekends to enjoy the cool ambience of its environs. There are a total of 35 suites in the hotel, all of them spacious, beautifully decorated and furnished. The room categories include: Executive Suites, Twin Bed Deluxe and Presidential Suites. The suites contain en-suite bathrooms, flat-screen TV with satellite receptions, two single-sitter sofa, mini bars, digital safes and an exclusive lounge for the presidential suites. Hotel facilities at Check Inn Hotel include: A modern events centre where parties and other occasions can be held; a comfortable conference and meeting room for business driven guests; swimming pools for relaxation and the additional perk of by-the-pool cocktails; a well-equipped gym; and a restaurant that offers beautiful dishes ranging from African delicacies to continental meals. At the request of guests, the hotel offers taxi and airport pickup services. Special on-site services include maid and dry cleaning services. AVG PRICE\/NIGHT: N25000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"106","title":"Right guest house Ibadan","content":"Right Guest House is an affordable mid class guest House  off Iwo Road Ojoo Expressway, we offer air conditioned rooms in a secured environment. Right Guest House is situated in Ibadan, capital city of Oyo State. The guest house has a restaurant and bar. Each room is fitted with a worktable, a TV, an en suite bathroom and a air conditioner. Guests can order for different delicacies and a variety of soft and alcoholic drinks at the onsite restaurant and bar for a fee. Room service can be arranged on request. There is onsite parking space at the guest house and the premise is guarded by security guards.  AVG PRICE\/NIGHT: N4000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"107","title":"Ashosh hotel and suite Ibadan","content":"Ashosh Hotel and Suite is an affordable hotel in Ibadan, Oyo state. Located at 5th Ashosh Avenue, By Felele Road, Felele, Ibadan, Oyo State.  It is about 21 minutes from the popular Agodi Park and Garden in Ibadan. Ashosh Hotel and Suite offers various categories of rooms, such as: Single Bed Room, Transit Budget Room, Transit Room, Standard Room, Executive Room, Super Executive Room and Presidential Room. Every room is made to every guest’s unique requirements. The Executive Suite is where guests can have more space and more privacy with their own en-suite bathroom plus the executive table and chairs. Other room types like the Transit Budget and the Standard Rooms also offer en-suite bathrooms. A number of facilities are available at Ashosh Hotel and Suite such as a restaurant, bar and an events centre. The restaurant is well renowned for its excellent food and service. Ashosh Hotels offers a unique dining experience that is sure to create memorable moments with friends and family. Also, at the on-site bar, guests can order from a list of choice beverages. The hotel features an event centre ideal for hosting business and informal meetings. On-site and nearby parking is allowed and the premises are well guarded by professional security personnel. AVG PRICE\/NIGHT: N5500","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"108","title":"Best Western Plus Ibadan","content":"25; Jibowu Crescent Off Mko Abiola Way Gra Iyaganku Ibadan , 23402 Ibadan, Nigeria –\r\nOffering an outdoor pool and views of the garden, Best Western Plus Ibadan is located in Ibadan. Guests can enjoy the on-site bar.\r\nEach room includes a flat-screen TV with satellite channels. Some rooms have a seating area where you can relax. You will find a kettle in the room. The rooms include a private bathroom. For your comfort, you will find free toiletries and a hairdryer.\r\nThere is a 24-hour front desk at the property\r\nAVG PRICE\/NIGHT: ₦22,000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"109","title":"Fawzy Hotel Ibadan","content":"Block VII, Adewunmi Layout, Akinyemi Way, Off Ringroad, Ibadan, Oyo AVG PRICE\/NIGHT: ₦22,000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"110","title":"SDM Tavern Hotel, GRA, Agodi, Ibadan","content":"SDM Tavern Hotel offers clean and spacious rooms designed for both leisure and business travellers. The hotel is equipped with modern hotel amenities that will make your stay a remarkable one.\r\nSDM Tavern Hotel provides maximum comforts and convenience; elegant and very sophisticated accommodation services at moderate charges.\r\nLocated in a quiet and serene area of Agodi, Ibadan, SDM Tavern Hotel is an ideal place to stay in Ibadan for business or pleasure.\r\nSDM Tavern Hotel offers spacious and luxuriously designed rooms, tastefully furnished and equipped with hotel facilities that offer maximum comfort.\r\nStaffed by friendly and professional team eager to make your stay a remarkable one, the hotel’s location offers easy access to Oyo State government secretariat and other establishments.\r\nAll the hotel rooms are equipped with wireless broadband internet service, in-room safe, digital television, bedside lamp etc.\r\nAVG PRICE\/NIGHT: ₦9,000","contentgroup":"Hotels","travel":"0","favourite":"0"},
{"id":"111","title":"Sango Festival","content":"Sango Festival is an annual festival held among the Yoruba people in honor of Sango, thunder and fire deity who was a warlord and the third king of the Oyo Kingdom after succeeding Ajaka his elder brother.[1] Rebranded in 2013 to World Sango Festival by the government of Oyo State, the festival is usually held in August at the palace of the Alaafin of Oyo and also observed in over forty countries around the world.\r\n\r\nThe annual Sango Festival celebrations can be traced back to about a millennium ago when the Yoruba deity, Sango departed. He is known as the founding father of the modern Oyo state.\r\n\r\nIt is celebrated every August at every Yoruba recognized country such as Nigeria, Cuba, Brazil, the Benin Republic among others. Although Oyo State, Nigeria is known as its original root and it is always celebrated at the place of Alaafin. The festival attracts visitors from various walks of life.\r\n\r\nIn 2013, the Oyo State Government made Sango Festival internationally recognized by renaming it to World Sango Festival. This day serves as a day in which the Yorubas across the globe come together to celebrate Sango.\r\n\r\nThe Sango festival celebration usually takes place for about 10 days. It is marked with pageantry, pomp, and circumstance. The worshippers are usually dressed in white or red attire. The females wear traditional hairstyles adorn with cowries or traditional beads.\r\n\r\nThe atmosphere is usually full of music and dance from local dancers and drummers.\r\n\r\nDay One\r\nThe Sango Celebration week starts with playing of ayò ’a traditional board game’ and ‘ogun ajobo’ day traditional night rites.\r\n\r\nAyò is a special game that is common among the Yorubas. It is a game usually played by both aged and young men to relax in the evening after a tiring day.\r\n\r\nDay Two\r\nOgun Ajobo Day is celebrated on the second day of the festival. On this day, various traditional groups from Oyo zone from Owode in Oyo town to the palace of Alaafin. A night party is always held afterward called the ‘Aisun Koso’ featuring music, dance, eating, and drinking.\r\n\r\nDay Three\r\nOn this day, various cultural groups such as the Igunu and Omolulu would entertain the audience. This day is called Sango Obakoso day.\r\n\r\nDay Four\r\nThe shrine of Sango would be opened. This is usually marked by performances from the Nigerian Theatre Practitioners and followed by a night for Oya Okenira.\r\n\r\nDay Five to Nine\r\nOn these days, there would be celebrations of Oyo State, Oya Day, Aje Oloja Day, Sango Oyo Day, Osun State Day, Iyemonja Day, Esin Elejo Day as well as Kwara State Day.\r\n\r\nThe D-Day\r\nAnd there comes the most anticipated day. On this particular day, a group of Sango devotees called the ’Elegun Sango’ would thrill the audience with a magic performance which could be seen as scary. The ’Elegun Sango’ group come from different states in the South-West geopolitical zone.\r\n\r\nThe ’Elegun Sango Koso Alaafin’ is usually the last to come up on stage. He takes a tour around the Oyo town to pray for the people before heading to the palace. He greets everyone and goes to Iya Ilekoto before leaving the palace.\r\n\r\nSango is regarded as the progenitor of the present Yoruba kingdom which necessitated the World Sango Day festival.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"112","title":"New Yam Festival","content":"The New Yam festival is celebrated annually in August. The festival symbolizes the end of a season of work and the beginning of a new season. Friends and family congregate to feast on meals of yams and there are displays of cultural dances. Once the festival is over old yams are thrown away as it is believed that the new cycle should begin with a fresh start.\r\n\r\nThe New Yam festival is celebrated annually in August. The festival symbolizes the end of a season of work and the beginning of a new season. Friends and family congregate to feast on meals of yams and there are displays of cultural dances. Once the festival is over old yams are thrown away as it is believed that the new cycle should begin with a fresh start.\r\n\r\nAt the beginning of the festival, yams are offered to the gods and ancestors to thank them for a good harvest and to ensure a good harvest the following season. The elders performs the ritual and eat the first yam to show their important position.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"113","title":"Oke Ibadan Festival","content":"This is an ancient festival that is celebrated annually. Popular among locals, crowds flock to take part in the festivities. The festival name translates to \"hill of Ibadan\" and the festival includes legends about the original site of Ibadan, which was located on a hill. Settlers from the east and north congregated on the hill during the 18th century and the town was formed. The hill has been deserted since then, but the legacy thrives. Oke Ibadan festival includes fertility rites and honors the founder of Ibadan and the goddess of the hill.\r\n\r\nThe Oke’badan festival is one of the many colorful and glamorous festivals celebrated in the city of Ibadan, the capital of Oyo State and the third-largest city in Africa. Oke’badan festival is held annually to celebrate the founding of Ibadan and show gratitude to its founders as well; and also to unite the sons and daughters of Ibadan at home and in the diaspora.\r\n\r\nThe festival is called Oke’badan (Oke Ibadan) which means ‘hill of Ibadan’ to immortalize the history of how Ibadan was founded on a hill by settlers led by Lagelu during the 18th century. The settlers later descended the hill and found Ibadan near its base. The historical significance of the hill cannot be forgotten thus Oke’badan festival was brought to life to uphold it. The Oke’badan festival, also known as Ibadan Cultural Festival, is organized annually by the Central Council of Ibadan Indigenes (CCII), a body that oversees the activities of all socio-cultural societies or clubs in Ibadan which are over 187.\r\n\r\nOke’badan cultural festival which is celebrated every third Thursday of March is graced with several exhilarating activities and events such as Ibadan beauty pageant, different cultural displays, stage plays, competitions, operation make Ibadan clean, conferences and so on. The people of Ibadan believe that Oke’badan (Oke Ibadan) festival protects them from evil and also deliver their men and women from impotency and barrenness.\r\nOke’badan festival in Ibadan land remains one of the most colorful festivals in Nigeria and West Africa.","contentgroup":"Festivals","travel":"0","favourite":"0"},
{"id":"114","title":"Egungun Festival","content":"It is observed by the Yoruba people of Ede, Oyo State, Nigeria. It takes place in June. During this festival, members of society come to the market place and perform masked dances. The high point of the festival is the appearance of Andu, the most important and powerful mask. It is also celebrated among the community of Egungun worshippers in Salvador da Bahia, Brazil.","contentgroup":"Festivals","travel":"0","favourite":"0"}
]
